Процедура ОбработкаПроведения(Отказ,Режим) 	
	
	Для Каждого ТекСтрока Из ОС Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетКт = ЗабалансовыйСчет;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = СкладОтправитель;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = ТекСтрока.ОсновноеСредство;
			Движение.КоличествоКт = ТекСтрока.Количество;
			Движение.Сумма = ТекСтрока.Стоимость;
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = ЗабалансовыйСчет;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = СкладПолучатель;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = ТекСтрока.ОсновноеСредство;
			Движение.КоличествоДт = ТекСтрока.Количество;
			Движение.Сумма = ТекСтрока.Стоимость;
		КонецЦикла;   
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
