
//&Перед("ЗакрытиеСчетов20_23_25_26")
//Процедура Расш1_ЗакрытиеСчетов20_23_25_26(Движения, Период, Организация, Ссылка, Отказ, Ошибки)       
//	Если Ссылка.ВидОперации = Перечисления.ВидыРегламентныхОпераций.ЗакрытиеСчетов20_23_25_26 Тогда
//		
//		//Счет 25.03
//		ПодразделениеОрганизации = ЮЦАУ.ПолучитьЗначениеПоИдентификатору ("ПодразделениеАвтоколоннаПассажирскиеПеревозки", Организация, Период);
//		СчетЗатрат = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;   //25.03
//		ЮЦАУ.ПеренестиОборотыСчета25_03наСчет20_01(Период, Организация, ПодразделениеОрганизации, СчетЗатрат);
//		
//		////Счет 25.02		
//		//Проводить = Ложь; //Перед закрытием счетов снимаем свои документы с проведения
//		//ПодразделениеОрганизации = Неопределено;
//		//СчетЗатрат = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники;   //25.02
//		//ЮЦАУ.РаспределитьОборотыСчета25_02наСчет20_01(Период, Организация, ПодразделениеОрганизации, СчетЗатрат, Проводить);
//		
//	КонецЕсли;	
//КонецПроцедуры

//&После("ЗакрытиеСчетов20_23_25_26")
//Процедура Расш1_ЗакрытиеСчетов20_23_25_261(Движения, Период, Организация, Ссылка, Отказ, Ошибки)
//	
//	Если Ссылка.ВидОперации = Перечисления.ВидыРегламентныхОпераций.ЗакрытиеСчетов20_23_25_26 Тогда
//		
//		//Счет 25.02		
//		Проводить = Истина;  //После закрытия счетов формируем и проводим свои документы закрытия
//		ПодразделениеОрганизации = Неопределено;
//		СчетЗатрат = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники;   //25.02
//		ЮЦАУ.РаспределитьОборотыСчета25_02наСчет20_01(Период, Организация, ПодразделениеОрганизации, СчетЗатрат, Проводить);
//		
//	КонецЕсли;	
//	
//	
//КонецПроцедуры
