
//&ИзменениеИКонтроль("СформироватьДвиженияИлиСообщенияОбОшибках")
//Процедура Расш1_СформироватьДвиженияИлиСообщенияОбОшибках(Отказ)

//	ДополнительныеСвойства.Вставить("Ошибки", ВыводСообщенийОбОшибках.НовыйДетальнаяИнформацияОбОшибках());
//	Ошибки = ДополнительныеСвойства.Ошибки;

//	// Сообщения об ошибках могут быть помещены в коллекцию Ошибки явно,
//	// или помещены в сообщения пользователю.
//	// В последнем случае они будут записаны в коллекцию Ошибки позже.

//	Заголовок   = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
//	СтруктураШапкиДокумента = ЗаполнитьСтруктуруШапкиДокумента(Отказ, Заголовок);

//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;

//	// При последовательном проведении регламентных операций проверку последовательности
//	// имеет смысл выполнить один раз в самом начале, для остальных регламетных операций 
//	// установить признак ПропуститьПроверкуПоследовательности.
//	#Удаление
//	НадоПроверятьПоследовательность = Истина;
//	#КонецУдаления
//	#Вставка
//	НадоПроверятьПоследовательность = Ложь;
//	#КонецВставки
//	Если ДополнительныеСвойства.Свойство("ПропуститьПроверкуПоследовательности")
//		И ДополнительныеСвойства.ПропуститьПроверкуПоследовательности = Истина Тогда
//		НадоПроверятьПоследовательность = Ложь;
//	КонецЕсли;

//	Если НадоПроверятьПоследовательность Тогда

//		НомерГруппыВидаОперации = ЗакрытиеМесяца.ГруппаПоВидуОперации(СтруктураШапкиДокумента.ВидОперации);

//		Если ЗакрытиеМесяца.ГруппаВыполняетсяПоОрганизацииВЦелом(НомерГруппыВидаОперации) Тогда
//			СписокОрганизаций = СтруктураШапкиДокумента.СписокОрганизаций;
//		Иначе
//			СписокОрганизаций = Новый СписокЗначений;
//			СписокОрганизаций.Добавить(Организация);
//		КонецЕсли;

//		ПроверитьПоследовательностьДокументов(СписокОрганизаций, Ошибки, Отказ);
//	КонецЕсли;

//	Если Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуСтатусаПредыдущих")
//		И Не ЗакрытиеМесяца.ПредыдущиеОперацииВыполнены(Дата, Организация, ВидОперации, Ошибки) Тогда
//		Отказ = Истина;
//	КонецЕсли;

//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;

//	ДополнительныеСвойства.Вставить("ЭтоНовый",                    ЭтоНовый());
//	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
//	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект, Ложь); // Записанные движения регистратора будут принудительно очищены

//	// Проверяем после очистки движений,
//	// чтобы движения регламентной операции не повлияли на результат проверки
//	ПроверитьИсходныеДанныеИНастройки(СтруктураШапкиДокумента, Отказ, Ошибки);
//	Если ВыводСообщенийОбОшибках.ЕстьОшибки(Ошибки) Тогда
//		Отказ = Истина;
//	КонецЕсли;

//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;

//	СформироватьДвижения(СтруктураШапкиДокумента, Отказ, Ошибки);

//	Если Не Отказ Тогда
//		Движения.Записать();
//	КонецЕсли;

//КонецПроцедуры

&ИзменениеИКонтроль("ЗакрытиеСчета97")
Процедура Расш1_ЗакрытиеСчета97(СтруктураШапкиДокумента, Отказ, Ошибки)

	ПрименяетсяУСНДоходыРасходы = УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.КонДата);

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПараметрыПроведения = Документы.РегламентнаяОперация.ПодготовитьПараметрыРасчетСписанияРБП(СтруктураШапкиДокумента, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	Реквизиты = ПараметрыПроведения.ТаблицаРеквизитыРБП[0];

	// Расчет списания РБП
	РасчетСписанияРБП = РасходыБудущихПериодов.РаспределитьЧастьРасходовЗаМесяц(Реквизиты.Период, Реквизиты.Организация, Отказ, Ошибки);

	// Учет доходов и расходов ИП
	ТаблицыСписанияРБПИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыСписанияРБП(
	РасчетСписанияРБП, ПараметрыПроведения.ТаблицаРеквизитыРБП, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	#Удаление   
	РасходыБудущихПериодов.СформироватьДвиженияРасчетСписанияРБП(РасчетСписанияРБП, ПараметрыПроведения.ТаблицаРеквизитыРБП, Движения, Отказ);
	#КонецУдаления

	#Вставка     
	ДвиженияРасчетСписанияРБП = ЮЦАУ.РаспределитьРасходыБудущихПериодов(РасчетСписанияРБП, ПараметрыПроведения.ТаблицаРеквизитыРБП);
	РасходыБудущихПериодов.СформироватьДвиженияРасчетСписанияРБП(ДвиженияРасчетСписанияРБП, ПараметрыПроведения.ТаблицаРеквизитыРБП, Движения, Отказ);
	#КонецВставки

	ЗакрытиеМесяца.ЗаписьВоВспомогательныеРегистрыСведений(
	Движения,
	РасчетСписанияРБП,
	ПараметрыПроведения.ТаблицаРеквизитыРБП,
	"РасчетСписанияРБП",
	Истина,
	"Организация, Статья, СчетУчета, СчетСписания, СпособПризнанияРасходов, ДатаНачала, ДатаОкончания, КоличествоМесяцевДнейТекущегоПериода, КоличествоМесяцевДней, СуммаДоговора, ПодразделениеОрганизации",
	"Сумма, НачОстаток, КонОстаток, НачОстатокНУ, КонОстатокНУ, СуммаНУ, НачОстатокПР, КонОстатокПР, СуммаПР, НачОстатокВР, КонОстатокВР, СуммаВР");


	Если ПрименяетсяУСНДоходыРасходы Тогда

		Параметры = Новый Структура;
		Параметры.Вставить("Ссылка", Ссылка);
		Параметры.Вставить("Объект", ЭтотОбъект);
		Параметры.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		Параметры.Вставить("Дата", СтруктураШапкиДокумента.Дата);
		Параметры.Вставить("ОтражатьВНалоговомУчетеУСН", Истина);
		Параметры.Вставить("ОтражатьВНалоговомУчетеУСНДоходы", Ложь);
		Параметры.Вставить("ОтражатьВНалоговомУчетеУСНПатент", Ложь);

		НалоговыйУчетУСН.ОтразитьВУСН(Ссылка, "СписаниеРБП", Параметры, 0);

	КонецЕсли;

	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияСписанияРБП(
	ТаблицыСписанияРБПИП.РБП, ТаблицыСписанияРБПИП.ПрочиеРасходы, ПараметрыПроведения.ТаблицаРеквизитыРБП, Движения, Отказ);

КонецПроцедуры



//&Вместо("СформироватьДвиженияИлиСообщенияОбОшибках")
//Процедура Расш1_СформироватьДвиженияИлиСообщенияОбОшибках(Отказ)
//		
//	ДополнительныеСвойства.Вставить("Ошибки", ВыводСообщенийОбОшибках.НовыйДетальнаяИнформацияОбОшибках());
//	Ошибки = ДополнительныеСвойства.Ошибки;
//	
//	// Сообщения об ошибках могут быть помещены в коллекцию Ошибки явно,
//	// или помещены в сообщения пользователю.
//	// В последнем случае они будут записаны в коллекцию Ошибки позже.
//	
//	Заголовок   = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
//	СтруктураШапкиДокумента = ЗаполнитьСтруктуруШапкиДокумента(Отказ, Заголовок);
//	
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// При последовательном проведении регламентных операций проверку последовательности
//	// имеет смысл выполнить один раз в самом начале, для остальных регламетных операций 
//	// установить признак ПропуститьПроверкуПоследовательности.
//	НадоПроверятьПоследовательность = Ложь; //Истина;//ЮЦАУ
//	Если ДополнительныеСвойства.Свойство("ПропуститьПроверкуПоследовательности")
//		И ДополнительныеСвойства.ПропуститьПроверкуПоследовательности = Истина Тогда
//		НадоПроверятьПоследовательность = Ложь; //Истина;//ЮЦАУ
//	КонецЕсли;
//	
//	Если НадоПроверятьПоследовательность Тогда

//		НомерГруппыВидаОперации = ЗакрытиеМесяца.ГруппаПоВидуОперации(СтруктураШапкиДокумента.ВидОперации);

//		Если ЗакрытиеМесяца.ГруппаВыполняетсяПоОрганизацииВЦелом(НомерГруппыВидаОперации) Тогда
//			СписокОрганизаций = СтруктураШапкиДокумента.СписокОрганизаций;
//		Иначе
//			СписокОрганизаций = Новый СписокЗначений;
//			СписокОрганизаций.Добавить(Организация);
//		КонецЕсли;
//	
//		ПроверитьПоследовательностьДокументов(СписокОрганизаций, Ошибки, Отказ);
//	КонецЕсли;
//	
//	Если Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуСтатусаПредыдущих")
//	   И Не ЗакрытиеМесяца.ПредыдущиеОперацииВыполнены(Дата, Организация, ВидОперации, Ошибки) Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДополнительныеСвойства.Вставить("ЭтоНовый",                    ЭтоНовый());
//	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
//	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект, Ложь); // Записанные движения регистратора будут принудительно очищены
//	
//	// Проверяем после очистки движений,
//	// чтобы движения регламентной операции не повлияли на результат проверки
//	ПроверитьИсходныеДанныеИНастройки(СтруктураШапкиДокумента, Отказ, Ошибки);
//	Если ВыводСообщенийОбОшибках.ЕстьОшибки(Ошибки) Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	СформироватьДвижения(СтруктураШапкиДокумента, Отказ, Ошибки);
//	
//	Если Не Отказ Тогда
//		Движения.Записать();
//	КонецЕсли;

//КонецПроцедуры

//&Вместо("ВыполнитьОперацию")
//Функция Расш1_ВыполнитьОперацию(БлокировкаУстановленаНеявно)
//	
//	// Отметка времени - начало выполнения регламентной операции.
//	// СтандартныеПодсистемы.ОценкаПроизводительности
//	НачалоВыполнения = ОценкаПроизводительности.НачатьЗамерВремени();
//	НачалоВыполненияДляЖурналаРегистрации = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	ИмяСобытия = ЗакрытиеМесяцаКлиентСервер.СобытиеЖурналаРегистрации(Строка(ВидОперации));// нет возможности привести к языку конфигурации
//	ЗаписьЖурналаРегистрации(ИмяСобытия,
//							 УровеньЖурналаРегистрации.Информация,
//							 Метаданные.Документы.РегламентнаяОперация,
//							 Ссылка,
//							 НСтр("ru = 'Начало операции'"),
//							 РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
//	
//	Отказ = Ложь;
//	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(
//		ЭтотОбъект,
//		Отказ,
//		РежимЗаписиДокумента.Запись,
//		РежимПроведенияДокумента.Неоперативный);
//	
//	Если Отказ ИЛИ НЕ ПроверитьЗаполнение() Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Действие = НСтр("ru = 'выполнить'");
//	УдалосьУстановитьБлокировку = УстановитьОбъектныеБлокировки(БлокировкаУстановленаНеявно, Действие);
//	Если НЕ УдалосьУстановитьБлокировку Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Если НайтиДубли() Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ПометкаУдаления Тогда
//		ПометкаУдаления = Ложь;
//	КонецЕсли;
//	
//	Если ЭтоНовый() ИЛИ Модифицированность() Тогда
//		Записать();
//	КонецЕсли;
//	
//	Если РучнаяКорректировка Тогда
//		МетаданныеОбъекта = Метаданные();
//		
//		МассивИменРегистров = ПроведениеСервер.ПолучитьМассивИспользуемыхРегистров(
//			Ссылка,
//			МетаданныеОбъекта.Движения);
//		
//		Для каждого ИмяРегистра Из МассивИменРегистров Цикл
//			Движения[ИмяРегистра].Прочитать();
//			Движения[ИмяРегистра].УстановитьАктивность(Истина);
//			Движения[ИмяРегистра].Записывать = Истина;
//		КонецЦикла;
//		
//		Движения.Записать();
//		ИзменитьСостояниеОперации(Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено);
//		
//		Возврат Истина;
//	КонецЕсли;
//	
//	// Собственно выполнение операции
//	Отказ = Ложь;
//	СформироватьДвиженияИлиСообщенияОбОшибках(Отказ); // Добавит в ДополнительныеСвойства свойство Ошибки
//	
//	ПропуститьПроверкуСтатусаПредыдущих = Ложь;
//	Если НЕ Отказ Тогда
//		
//		НовоеСостояние = Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено;
//		
//		// Если выполнение операции вызвано из ВыполнитьРегламентнуюОперацию() модуля менеджера обработки ЗакрытиеМесяца(),
//		// то ПропуститьПроверкуСтатусаПредыдущих может быть Истина уже в момент входа в процедуру ВыполнитьОперацию(). Это
//		// будет означать, что необходимые проверки уже проведены перед вызовом из обработки.
//		// При успешном выполнении операции в СформироватьДвиженияИлиСообщенияОбОшибках() данное свойство также устанавливается Истина.
//		Если Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуСтатусаПредыдущих", ПропуститьПроверкуСтатусаПредыдущих) Тогда
//			ПропуститьПроверкуСтатусаПредыдущих = Ложь;
//		КонецЕсли;
//		
//	Иначе
//		
//		// Некоторые сообщения об ошибках переданы через сообщения пользователю
//		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
//		ЗакрытиеМесяцаСообщенияОбОшибках.ДополнитьИнформациюОбОшибкахСообщениямиПользователю(
//			ДополнительныеСвойства.Ошибки,
//			СообщенияПользователю);
//		
//		Если ВыводСообщенийОбОшибках.ЕстьОшибки(ДополнительныеСвойства.Ошибки) Тогда
//			НовоеСостояние  = Перечисления.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками;
//		Иначе
//			НовоеСостояние  = Перечисления.ВидыСостоянийРегламентныхОпераций.НеВыполнено;
//		КонецЕсли;
//		
//		// Некоторые операции могли успеть записать какие-то движения.
//		// Такие движения не имеют смысла - удалим их.
//		ОбщегоНазначенияБПВызовСервера.УдалитьДвиженияРегистратора(ЭтотОбъект, Истина, РучнаяКорректировка);
//		
//	КонецЕсли;
//	
//	// Подготовим описание ошибок для пользователя и сохраним его в документ
//	Если ВыводСообщенийОбОшибках.ЕстьОшибки(ДополнительныеСвойства.Ошибки) ИЛИ ОписаниеОшибок.Получить() <> Неопределено Тогда
//		ОписаниеОшибок = ЗакрытиеМесяцаСообщенияОбОшибках.ОписаниеОшибок(
//			ДополнительныеСвойства.Ошибки,
//			Дата,
//			Организация,
//			ВидОперации);
//	КонецЕсли;
//	
//	ИзменитьСостояниеОперации(НовоеСостояние, ПропуститьПроверкуСтатусаПредыдущих);
//	
//	// Из-за выполнении рег.операции перенесем момент нарушения последовательности на начало следующего месяца.
//	Если Состояние <> Перечисления.ВидыСостоянийРегламентныхОпераций.НеВыполнено Тогда
//		НадоПроверятьПоследовательность = Ложь; //Истина;//ЮЦАУ
//		Если ДополнительныеСвойства.Свойство("ПропуститьПроверкуПоследовательности")
//		   И ДополнительныеСвойства.ПропуститьПроверкуПоследовательности = Истина Тогда
//		   НадоПроверятьПоследовательность = Ложь; //Истина;//ЮЦАУ
//		КонецЕсли;
//		
//		Если НадоПроверятьПоследовательность Тогда
//			МоментНарушения = РаботаСПоследовательностями.МоментНарушенияПоследовательности(Организация, КонецМесяца(Дата));
//			Если МоментНарушения = Неопределено Тогда
//				НачалоСледующегоМесяца = КонецМесяца(Дата) + 1;
//				МоментПервогоДокументаСледующегоМесяца = РаботаСПоследовательностями.МоментВремениПервогоДокументаВПоследовательности(
//					Организация, НачалоСледующегоМесяца);
//				Если МоментПервогоДокументаСледующегоМесяца <> Неопределено Тогда
//					РаботаСПоследовательностями.СброситьСостояниеПоследовательностиДокумента(
//						МоментПервогоДокументаСледующегоМесяца.Ссылка, МоментПервогоДокументаСледующегоМесяца.Дата, Организация);
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;

//	// Отметка времени - завершение выполнения регламентной операции.
//	ИмяКлючевойОперации = "ЗакрытиеМесяца" + ОбщегоНазначения.ИмяЗначенияПеречисления(ВидОперации);
//	// СтандартныеПодсистемы.ОценкаПроизводительности
//	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, НачалоВыполнения);
//	
//	ДлительностьВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполненияДляЖурналаРегистрации;
//	ЗаписьЖурналаРегистрации(ИмяСобытия,
//							 УровеньЖурналаРегистрации.Информация,
//							 Метаданные.Документы.РегламентнаяОперация,
//							 Ссылка,
//							 СтрШаблон(НСтр("ru = 'Результат операции (%1 мс)'"), ДлительностьВыполнения),
//							 РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
//							 
//	Возврат Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено;
//	
//КонецФункции
