// @strict-types

#Область ОбработчикиСобытий

// Параметры:
//   Поля - Массив из Строка
//   СтандартнаяОбработка - Булево
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидЧерновика");
КонецПроцедуры

// Параметры:
//   Данные - ДокументОбъект.ЧерновикЭлектронногоДокументаЭДО
//   Представление - Строка
//   СтандартнаяОбработка - Булево
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеДокумента = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), Данные.ВидЧерновика,
		Данные.Номер, Формат(Данные.Дата, "ДЛФ=D;"));
	ПредставлениеДокументаРП = ПолучитьСклоненияСтроки(ПредставлениеДокумента, "L=ru_RU", "CS=Genitive;")[0];
	Представление = СтрШаблон(НСтр("ru='Черновик %1'"), ПредставлениеДокументаРП);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий