Функция СформироватьЗапросПоСЧ26()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
	Запрос.Текст ="ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Подразделение КАК ПодразделениеКт,
	|	ХозрасчетныйОбороты.Субконто1 КАК СтатьяЗатрат,
	
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт	             
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Организация = &Организация
	|	И ХозрасчетныйОбороты.Счет = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеКт";
	
	Возврат Запрос;	
	
КонецФункции

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана организация");
		Возврат;
	КонецЕсли;
	
	Если ПодразделениеДт20 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Сообщить ("Не выбрано подразделение Дт 20.01 счета");
		Возврат;
	КонецЕсли;	
	
	СуммаКоэфф = 0;
	
	Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
		СуммаКоэфф = СуммаКоэфф+ТекСтрока.Коэффициент;	
	КонецЦикла;	
	
	Если СуммаКоэфф <> 1 Тогда
		Сообщить("Сумма коэффициентов распределения должна равняться единице");
		Возврат;
	КонецЕсли;
	
	СЧ = ТабЧастьКоэфф.Количество();		
	
	Запрос = СформироватьЗапросПоСЧ26();
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СуммаОст = 0;
		СуммаОстНУ = 0;
		Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
			Движение.ПодразделениеДт = ПодразделениеДт20;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
			Движение.ПодразделениеКт = Выборка.ПодразделениеКт;
			Если ТекСтрока.НомерСтроки<СЧ Тогда
				СуммаРаспр = Окр(Выборка.СуммаОборотДт*ТекСтрока.Коэффициент,2);
				СуммаРаспрНУ = Окр(Выборка.СуммаНУОборотДт*ТекСтрока.Коэффициент,2);  
				СуммаОст = СуммаОст+СуммаРаспр;
				СуммаОстНУ = СуммаОстНУ+СуммаРаспрНУ;
			Иначе 
				СуммаРаспр = Выборка.СуммаОборотДт-СуммаОст;
				СуммаРаспрНУ = Выборка.СуммаНУОборотДт-СуммаОстНУ;
			КонецЕсли;
			Движение.Сумма = СуммаРаспр;
			Если СуммаРаспр<>СуммаРаспрНУ Тогда
				//Сообщить("Обнаружены разницы между БУ и НУ"); 
				Движение.СуммаНУДт = СуммаРаспрНУ;
				Движение.СуммаВРДт = СуммаРаспр-СуммаРаспрНУ;
				Движение.СуммаНУКт = СуммаРаспрНУ;
				Движение.СуммаВРКт = СуммаРаспр-СуммаРаспрНУ;
			КонецЕсли; 
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
