
Функция ОстаткиОС(СписокОС = Неопределено)
	
	Дата = Объект.Дата;
	ПодразделениеОрганизации = Объект.ПодразделениеОрганизации;
	Организация = Объект.Организация;
	 
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ДатаОстатков",  Дата);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СубконтоОС",    ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("СписокОС",      СписокОС);
	
	УсловиеОС = ?(ЗначениеЗаполнено(СписокОС), "И ОсновноеСредство В(&СписокОС)", "");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК ПодразделениеОрганизации,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ
	|	ОсновныеСредства
	|ИЗ
	|	(ВЫБРАТЬ
	|		МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	|		МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение
	|	ИЗ
	|		(ВЫБРАТЬ 
	|			МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|			МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение
	|		ИЗ 
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаОстатков,	Организация = &Организация " + УсловиеОС + ") КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних) КАК МестонахождениеОСБухгалтерскийУчет
	|	ГДЕ МестонахождениеОСБухгалтерскийУчет.Местонахождение = &Подразделение) КАК МестонахождениеОСБухгалтерскийУчет
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаОстатков, Организация = &Организация " + УсловиеОС + ") КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|	ПО МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	|;
	|ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ХозрасчетныйОстатки_ВосстановительнаяСтоимость.СуммаОстатокДт, 0) КАК ВосстановительнаяСтоимость
	|ИЗ
	|	ОсновныеСредства
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков,
	|	                                                              Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетУчета ИЗ ОсновныеСредства),
	|	                                                              ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
	|	                                                              Организация = &Организация
	|	                                                              И Субконто1 В (ВЫБРАТЬ РАЗЛИЧНЫЕ ОсновноеСредство ИЗ ОсновныеСредства)) КАК ХозрасчетныйОстатки_ВосстановительнаяСтоимость
	|	ПО ОсновныеСредства.ОсновноеСредство = ХозрасчетныйОстатки_ВосстановительнаяСтоимость.Субконто1";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ОстаткиОС()

Функция ОстаткиОСПоМОЛ(СписокОС = Неопределено)	
	
	Дата = Объект.Дата;
	ПодразделениеОрганизации = Объект.ПодразделениеОрганизации;
	Организация = Объект.Организация;
	МОЛ = Объект.МОЛ;

	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ДатаОстатков",  Дата);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("МОЛ", МОЛ);
	Запрос.УстановитьПараметр("СубконтоОС",    ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("СписокОС",      СписокОС);	
	УсловиеОС = ?(ЗначениеЗаполнено(СписокОС), "И ОсновноеСредство В(&СписокОС)", "");  	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК ПодразделениеОрганизации,
	|	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ
	|	ОсновныеСредства
	|ИЗ
	|	(ВЫБРАТЬ
	|		МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	|		МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение,
	|		МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ
	|	ИЗ
	|		(ВЫБРАТЬ 
	|			МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|			МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение,
	|		    МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ
	|		ИЗ 
	|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаОстатков,	Организация = &Организация " + УсловиеОС + ") КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних) КАК МестонахождениеОСБухгалтерскийУчет
	|	ГДЕ  МестонахождениеОСБухгалтерскийУчет.Местонахождение = &Подразделение
	|   И МестонахождениеОСБухгалтерскийУчет.МОЛ = &МОЛ) КАК МестонахождениеОСБухгалтерскийУчет
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаОстатков, Организация = &Организация " + УсловиеОС + ") КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|	ПО МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	|;
	|ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ХозрасчетныйОстатки_ВосстановительнаяСтоимость.СуммаОстатокДт, 0) КАК ВосстановительнаяСтоимость
	|ИЗ
	|	ОсновныеСредства
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков,
	|	                                                              Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетУчета ИЗ ОсновныеСредства),
	|	                                                              ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
	|	                                                              Организация = &Организация
	|	                                                              И Субконто1 В (ВЫБРАТЬ РАЗЛИЧНЫЕ ОсновноеСредство ИЗ ОсновныеСредства)) КАК ХозрасчетныйОстатки_ВосстановительнаяСтоимость
	|	ПО ОсновныеСредства.ОсновноеСредство = ХозрасчетныйОстатки_ВосстановительнаяСтоимость.Субконто1";
   	Возврат Запрос.Выполнить().Выгрузить(); 	
КонецФункции // ОстаткиОС()

Функция ЗаполнитьОСПоСкладуЗабаланс() 
	
	Дата = Объект.Дата;
	СчетЗабалансовый = Объект.СчетЗабалансовый;
	Организация = Объект.Организация;
	Склад = Объект.Склад;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Счет",СчетЗабалансовый);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
	Если СчетЗабалансовый=ПланыСчетов.Хозрасчетный.ОсновныеСредстваБезвозмездноеПользование Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Счет = &Счет
		|	И ХозрасчетныйОстатки.Организация = &Организация
		|	И ХозрасчетныйОстатки.Субконто2 = &Склад
		|
		|УПОРЯДОЧИТЬ ПО	
		|	ОсновноеСредство";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто2 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Счет = &Счет
		|	И ХозрасчетныйОстатки.Организация = &Организация
		|	И ХозрасчетныйОстатки.Субконто1 = &Склад
		|
		|УПОРЯДОЧИТЬ ПО	
		|	ОсновноеСредство";
	КонецЕсли;
		Возврат Запрос.Выполнить().Выгрузить(); 
	
	КонецФункции

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	//Если НЕ ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Заполнение возможно только при выбранной организации.");
	//	Возврат;
	//КонецЕсли;
	//
	//Если ОС.Количество() > 0 Тогда
	//	Если Вопрос("Перед заполнением табличная часть будет очищена. Заполнить?", 
	//		РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	ОС = Объект.ОС;
	ОС.Очистить();
	
	ВыборкаОС = ОстаткиОС();
	
	Для Каждого СтрокаОС Из ВыборкаОС Цикл
		
		НоваяСтрока = ОС.Добавить();
		
		НоваяСтрока.ОсновноеСредство       = СтрокаОС.ОсновноеСредство;
		НоваяСтрока.СтоимостьПоДаннымУчета = СтрокаОС.ВосстановительнаяСтоимость;
		НоваяСтрока.НаличиеПоДаннымУчета   = Истина;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоОстаткамМОЛНаСервере()
	
	//Если НЕ ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Заполнение возможно только при выбранной организации.");
	//	Возврат;
	//КонецЕсли;	
	//Если НЕ ЗначениеЗаполнено(МОЛ) Тогда
	//	Предупреждение("Заполнение возможно только при выбранном МОЛ");
	//	Возврат;
	//КонецЕсли;	
	//Если ОС.Количество() > 0 Тогда 	
	//	Если Вопрос("Перед заполнением табличная часть будет очищена. Заполнить?", 
	//	            РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли;
	
	ОС = Объект.ОС;
	
	ОС.Очистить();	
	ВыборкаОС = ОстаткиОСПоМОЛ(); 	
	Для Каждого СтрокаОС Из ВыборкаОС Цикл		
		НоваяСтрока = ОС.Добавить(); 		
		НоваяСтрока.ОсновноеСредство       = СтрокаОС.ОсновноеСредство;
		НоваяСтрока.СтоимостьПоДаннымУчета = СтрокаОС.ВосстановительнаяСтоимость;
		НоваяСтрока.НаличиеПоДаннымУчета   = Истина;		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПоОстаткамМОЛ(Команда)
	ПоОстаткамМОЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеУчетаНаСервере()
	
	//Если НЕ ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Заполнение возможно только при выбранной организации.");
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
	//	Предупреждение("Заполнение возможно только при выбранном подразделении");
	//	Возврат;
	//КонецЕсли;
	//
	//Если ОС.Количество() > 0 Тогда
	//	Если Вопрос("При заполнении существующие данные будут пересчитаны! Продолжить?", 
	//	            РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	ОС = Объект.ОС;
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	ВыборкаОС = ОстаткиОС(СписокОС);
	ВыборкаОС.Индексы.Добавить("ОсновноеСредство");
	
	Для Каждого СтрокаОС Из ОС Цикл
		
		ОстатокОС = ВыборкаОС.Найти(СтрокаОС.ОсновноеСредство, "ОсновноеСредство");
		
		Если НЕ (ОстатокОС = Неопределено) Тогда
		
			СтрокаОС.СтоимостьПоДаннымУчета = ОстатокОС.ВосстановительнаяСтоимость;
			СтрокаОС.НаличиеПоДаннымУчета   = Истина;
			
		Иначе
			
			СтрокаОС.СтоимостьПоДаннымУчета = 0;
			СтрокаОС.НаличиеПоДаннымУчета   = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеУчета(Команда)
	ЗаполнитьДанныеУчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактическиеДанныеНаСервере()
	
	ОС = Объект.ОС;
	
	//Если ОС.Количество() > 0 Тогда
	//	Если Вопрос("При заполнении существующие данные будут пересчитаны! Продолжить?", 
	//	            РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	Для Каждого СтрокаОС Из ОС Цикл
		
		СтрокаОС.СтоимостьФактическая = СтрокаОС.СтоимостьПоДаннымУчета;
		СтрокаОС.НаличиеФактическое   = СтрокаОС.НаличиеПоДаннымУчета;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактическиеДанные(Команда)
	ЗаполнитьФактическиеДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоСкладуЗабалансНаСервере()
	
	ОС = Объект.ОС;
	 
	//Если НЕ ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Заполнение возможно только при выбранной организации.");
	//	Возврат;
	//КонецЕсли;		
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда
	//	Предупреждение("Заполнение возможно только при выбранном складе");
	//	Возврат;
	//КонецЕсли;	
	//Если НЕ ЗначениеЗаполнено(СчетЗабалансовый) Тогда
	//	Предупреждение("Заполнение возможно только при выбранном заб.счете");
	//	Возврат;
	//КонецЕсли;	
	//Если ОС.Количество() > 0 Тогда 	
	//	Если Вопрос("Перед заполнением табличная часть будет очищена. Заполнить?", 
	//	            РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли; 	
	ОС.Очистить();
	
	ВыборкаОС = ЗаполнитьОСПоСкладуЗабаланс(); 	
	
	Для Каждого СтрокаОС Из ВыборкаОС Цикл		
		НоваяСтрока = ОС.Добавить(); 		
		НоваяСтрока.ОсновноеСредство       = СтрокаОС.ОсновноеСредство;
		НоваяСтрока.СтоимостьПоДаннымУчета = СтрокаОС.Сумма;
		НоваяСтрока.НаличиеПоДаннымУчета   = СтрокаОС.Количество;		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСкладуЗабаланс(Команда)
	ПоСкладуЗабалансНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма); //ЮЦАУ
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

