#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//МассивНепроверяемыхРеквизитов = Новый Массив();
	//
	//ЭтоСписаниеСоСклада = (ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеСоСклада);
	//ЭтоСписаниеССотрудника = (ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеССотрудника);

	//Если ПроверяемыеРеквизиты.Найти("Склад") = Неопределено И ЭтоСписаниеСоСклада Тогда
	//	ПроверяемыеРеквизиты.Добавить("Склад");
	//КонецЕсли;
	//
	//Если ЭтоСписаниеССотрудника Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Склад");
	//КонецЕсли;
	//
	//Если ЭтоСписаниеСоСклада Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
	//КонецЕсли;

	//СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, Дата);
	//УчетВПродажныхЦенах = (СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	////ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада");
	//
	//ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для Каждого ТекСтрока Из ОсновныеМаршрутыТС Цикл
		
		НовоеДвижение = Движения.ЮЦАУ_ОсновныеМаршрутыТС.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, ТекСтрока);

		НовоеДвижение.Период = Дата;
		НовоеДвижение.Подразделение = Подразделение;
			
	КонецЦикла;	
	
	Движения.ЮЦАУ_ОсновныеМаршрутыТС.Записать(Истина);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ЗаполнитьОсновныеМашрутыТСПоОборотамПериода(Организация, Подразделение, ДатаПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут КАК Маршрут,
		|	СУММА(ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот) КАК РабочееВремяОборот,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат КАК СчетЗатрат
		|ПОМЕСТИТЬ ВТ_ОборотыПоТС
		|ИЗ
		|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&ДатаНач, &ДатаКон, Период, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
		|ГДЕ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
		|	И ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение = &Подразделение
		|	И НЕ ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут В (&СписокМаршрутовИсключений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОборотыПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	МАКСИМУМ(ВТ_ОборотыПоТС.РабочееВремяОборот) КАК РабочееВремяОборот,
		|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат
		|ПОМЕСТИТЬ ВТ_МаксимумПоТС
		|ИЗ
		|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОборотыПоТС.ТранспортноеСредство,
		|	ВТ_ОборотыПоТС.СчетЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОборотыПоТС.Маршрут КАК Маршрут,
		|	ВТ_ОборотыПоТС.Подразделение КАК Подразделение,
		|	ВТ_ОборотыПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_МаксимумПоТС.РабочееВремяОборот КАК РабочееВремяОборот,
		|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат
		|ИЗ
		|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_МаксимумПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|			ВТ_МаксимумПоТС.РабочееВремяОборот КАК РабочееВремяОборот
		|		ИЗ
		|			ВТ_МаксимумПоТС КАК ВТ_МаксимумПоТС) КАК ВТ_МаксимумПоТС
		|		ПО ВТ_ОборотыПоТС.ТранспортноеСредство = ВТ_МаксимумПоТС.ТранспортноеСредство
		|			И ВТ_ОборотыПоТС.РабочееВремяОборот = ВТ_МаксимумПоТС.РабочееВремяОборот
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	сзИсключенияМаршрутов = Новый СписокЗначений;
	сзИсключенияМаршрутов.Добавить(Справочники.ЮЦАУ_Маршруты.ПустаяСсылка(),);

	Маршрут_Перегон = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Перегон", Организация, КонецМесяца(ДатаПериода));
	Маршрут_Резерв = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Резерв", Организация, КонецМесяца(ДатаПериода));

	Если Маршрут_Перегон <> Неопределено Тогда
		сзИсключенияМаршрутов.Добавить(Маршрут_Перегон,);
	КонецЕсли;	
	Если Маршрут_Резерв <> Неопределено Тогда
		сзИсключенияМаршрутов.Добавить(Маршрут_Резерв,);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("СписокМаршрутовИсключений", сзИсключенияМаршрутов);
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаПериода));
	Граница = Новый Граница(КонецМесяца(ДатаПериода), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаКон", Граница);

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ОсновныеМаршрутыТС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет документ на основании другого документа
//
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка
//
Процедура ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)

КонецПроцедуры

#КонецОбласти

#КонецЕсли

