
&ИзменениеИКонтроль("РаспределениеСуммыДопРасходов")
Функция Расш1_РаспределениеСуммыДопРасходов(Знач ДопРасходыРеквизиты, Знач ДопРасходыТаблица, ТолькоВзаиморасчеты)

	Если ДопРасходыТаблица = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;

	ВремДопРасходыРеквизиты = ДопРасходыРеквизиты[0];
	ВремДопРасходыТаблица   = ДопРасходыТаблица;

	ЕстьСуммаКРаспределению = ВремДопРасходыРеквизиты.СуммаВзаиморасчетовШапки > 0
	И ЗначениеЗаполнено(ВремДопРасходыРеквизиты.СпособРаспределения);

	Если ЕстьСуммаКРаспределению Тогда
		ВремДопРасходыТаблица.Колонки.Добавить("СуммаРаспределеннаяИзШапки");
		ВремДопРасходыТаблица.Колонки.Добавить("СуммаРаспределеннаяРубИзШапки");
		ВремДопРасходыТаблица.Колонки.Добавить("СуммаНДСРаспределеннаяИзШапки");
		ВремДопРасходыТаблица.Колонки.Добавить("СуммаНДСРаспределеннаяРубИзШапки");
		Если ВремДопРасходыРеквизиты.СпособРаспределения = Перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству Тогда
			ИмяКолонкиПропорции = "Количество";
		Иначе
			ИмяКолонкиПропорции = "СуммаТовара";
		КонецЕсли;
		СуммаКРаспределению = ВремДопРасходыРеквизиты.СуммаВзаиморасчетовШапки
		+ ?(ВремДопРасходыРеквизиты.СуммаВключаетНДС, 0, ВремДопРасходыРеквизиты.СуммаНДСВзаиморасчетовШапки);
		СуммаРубКРаспределению = ВремДопРасходыРеквизиты.СуммаРубШапки
		+ ?(ВремДопРасходыРеквизиты.СуммаВключаетНДС, 0, ВремДопРасходыРеквизиты.СуммаНДСРубШапки);
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаКРаспределению, ВремДопРасходыТаблица,
		"СуммаРаспределеннаяИзШапки", ИмяКолонкиПропорции);
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СуммаРубКРаспределению, ВремДопРасходыТаблица,
		"СуммаРаспределеннаяРубИзШапки", ИмяКолонкиПропорции);
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(ВремДопРасходыРеквизиты.СуммаНДСВзаиморасчетовШапки, ВремДопРасходыТаблица,
		"СуммаНДСРаспределеннаяИзШапки", ИмяКолонкиПропорции);
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(ВремДопРасходыРеквизиты.СуммаНДСРубШапки, ВремДопРасходыТаблица,
		"СуммаНДСРаспределеннаяРубИзШапки", ИмяКолонкиПропорции);

		Для каждого СтрокаТаблицы Из ВремДопРасходыТаблица Цикл

			Если ТолькоВзаиморасчеты Тогда
				СтрокаТаблицы.Сумма    = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаРаспределеннаяРубИзШапки;
				СтрокаТаблицы.НДС      = СтрокаТаблицы.НДС   + СтрокаТаблицы.СуммаНДСРаспределеннаяРубИзШапки; 
			Иначе
				СтрокаТаблицы.СуммаВзаиморасчетов    = СтрокаТаблицы.СуммаВзаиморасчетов + СтрокаТаблицы.СуммаРаспределеннаяИзШапки;
				СтрокаТаблицы.СуммаНДСВзаиморасчетов = СтрокаТаблицы.СуммаНДСВзаиморасчетов + СтрокаТаблицы.СуммаНДСРаспределеннаяИзШапки; 
				СтрокаТаблицы.СуммаРуб               = СтрокаТаблицы.СуммаРуб + СтрокаТаблицы.СуммаРаспределеннаяРубИзШапки;
				СтрокаТаблицы.СуммаБУ                = СтрокаТаблицы.СуммаРуб;
				СтрокаТаблицы.СуммаНУ                = СтрокаТаблицы.СуммаРуб;
				СтрокаТаблицы.СуммаНДСРуб            = СтрокаТаблицы.СуммаНДСРуб + СтрокаТаблицы.СуммаНДСРаспределеннаяРубИзШапки; 
			КонецЕсли; 

		КонецЦикла;

	КонецЕсли;
	
	#Вставка     
	ЮЦАУ.РаспределитьПоступлениеДопРасходов(ВремДопРасходыТаблица, ДопРасходыРеквизиты);
	#КонецВставки
	
	Возврат ВремДопРасходыТаблица;

КонецФункции
