
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоНовый() И Ссылка.ВидМоделиТС <> ВидМоделиТС 
			И Справочники.уатМоделиТС.СущестуютСсылкиНаМодельВКарточкахТС(Ссылка) Тогда
		Если ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт тогда
			ТекстСообщения = "Модели оборудования " + СокрЛП(Ссылка) + " указаны в карточках ТС. 
			|Реквизит ""Вид модели ТС"" не может быть изменен";
		Иначе
			ТекстСообщения = "Модели автотранспорта " + СокрЛП(Ссылка) + " указаны в карточках ТС. 
			|Реквизит ""Вид модели ТС"" не может быть изменен";
		КонецЕсли;
		ЮЦАУ.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,, "ВидМоделиТС", Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Ссылка.ВидМоделиТС <> ВидМоделиТС 
			И Справочники.уатМоделиТС.СущестуютСсылкиНаПризнакАвтотранспорта(Ссылка) Тогда
		Если ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт тогда
			ТекстСообщения = "Модели оборудования " + СокрЛП(Ссылка) + " участвуют в документообороте. 
			|Реквизит ""Вид модели ТС"" не может быть изменен";
		Иначе
			ТекстСообщения = "Модели автотранспорта " + СокрЛП(Ссылка) + " участвуют в документообороте. 
			|Реквизит ""Вид модели ТС"" не может быть изменен";
		КонецЕсли;
		ЮЦАУ.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,, "ВидМоделиТС", Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Ссылка.НаличиеТопливногоБака <> НаличиеТопливногоБака 
			И Справочники.уатМоделиТС.СуществуютСсылкиНаНаличиеТопливногоБака(Ссылка) Тогда
		Если ВидМоделиТС = Перечисления.уатВидыМоделейТС тогда
			ТекстСообщения = "Транспортные средства модели """ + СокрЛП(Ссылка) + """ участвуют в движении ГСМ."
		Иначе
			ТекстСообщения = "Оборудование модели """ + СокрЛП(Ссылка) + """ участвует в движении ГСМ."
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Признак ""Наличие топливного бака"" не может быть изменен";
		ЮЦАУ.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,, "НаличиеТопливногоБака", Отказ);
	КонецЕсли;	
	
	Если НЕ ЭтоНовый() И Ссылка.НаличиеСпидометра <> НаличиеСпидометра 
			И Справочники.уатМоделиТС.СуществуютСсылкиНаНаличиеСпидометра(Ссылка) Тогда
		Если ВидМоделиТС = Перечисления.уатВидыМоделейТС тогда
			ТекстСообщения = "Для транспортных средств модели """ + СокрЛП(Ссылка) + """ есть изменения показаний счетчиков."
		Иначе
			ТекстСообщения = "Для оборудования модели """ + СокрЛП(Ссылка) + """ есть изменения показаний счетчиков."
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Признак ""Наличие спидометра"" не может быть изменен";
		ЮЦАУ.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,, "НаличиеСпидометра", Отказ);
	КонецЕсли;	
	
	Если ТипТС = Справочники.уатТипыТС.ГрузовыеСамосвалы И НЕ ЗначениеЗаполнено(НормируемаяЗагрузкаСамосвала) Тогда
		ТекстСообщения = "Для модели ТС типа ""Грузовой самосвал"" необходимо указать коэффициент загрузки самосвала.";
		ЮЦАУ.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,, "НормируемаяЗагрузкаСамосвала", Отказ);
	КонецЕсли;
	
КонецПроцедуры
