 
 Функция СформироватьЗапросПоТабЧасти()
	 
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("ТекущийДокумент",  ЭтотОбъект.Ссылка);
	 Запрос.Текст = "ВЫБРАТЬ
	 |	СчетДт,
	 |	ПодразделениеДт,
	 |	Субконто1,
	 |	Субконто2,
	 |	ПодразделениеКт,
	 |	Субконто1Кт,
	 |	СуммаОборотКт,
	 |	СуммаОборотКтНУ
	 |ИЗ
	 |	Документ.Закрытие23_02.ТабЧасть КАК Закрытие23_02ТабЧасть
	 |ГДЕ
	 |	Закрытие23_02ТабЧасть.Ссылка = &ТекущийДокумент";	
	 Возврат Запрос
	 
 КонецФункции
 
 Процедура ОбработкаПроведения(Отказ,Режим)
	 
	 Сч23_01 = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводстваКосв;
	 Сч23_02 = ПланыСчетов.Хозрасчетный.РасходыПоАвтомойкеКосв;
	 Сч20_01 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	 
	 Запрос = СформироватьЗапросПоТабЧасти();
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Движение = Движения.Хозрасчетный.Добавить();
		 Движение.Период = Дата;
		 Движение.Организация = Организация;
		 Движение.СчетДт = Выборка.СчетДт;
		 Движение.ПодразделениеДт = Выборка.ПодразделениеДт;
		 Если Выборка.СчетДт = Сч23_01 Тогда
			 Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.Субконто1;
		 ИначеЕсли Выборка.СчетДт = Сч20_01 Тогда
			 Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = Выборка.Субконто1;
			 Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.Субконто2;
		 КонецЕсли;
		 Движение.СчетКт = Сч23_02; 
		 Движение.ПодразделениеКт = Выборка.ПодразделениеКт;
		 Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.Субконто1Кт;
		 Движение.Сумма = Выборка.СуммаОборотКт;
		 Если Выборка.СуммаОборотКт<>Выборка.СуммаОборотКтНУ Тогда
			 //Сообщить("Обнаружены разницы между БУ и НУ");
			 Движение.СуммаНУДт = Выборка.СуммаОборотКтНУ;
			 Движение.СуммаВРДт = Выборка.СуммаОборотКт-Выборка.СуммаОборотКтНУ;
			 Движение.СуммаНУКт = Выборка.СуммаОборотКтНУ;
			 Движение.СуммаВРКт = Выборка.СуммаОборотКт-Выборка.СуммаОборотКтНУ;
		 КонецЕсли;	 
	 КонецЦикла;
	 
 КонецПроцедуры
 
 Процедура ПриЗаписи(Отказ)
	 Ответственный = Пользователи.ТекущийПользователь();
 КонецПроцедуры
 
 
