
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Организация = Объект.Организация;
	СкладОтправитель = Объект.СкладОтправитель;
	ЗабалансовыйСчет = Объект.ЗабалансовыйСчет;
	Дата = Объект.Дата;
	ОС =  Объект.ОС;
	ОС.Очистить();	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Склад",СкладОтправитель);
	Запрос.УстановитьПараметр("Счет",ЗабалансовыйСчет);
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата));
	
	Если ЗабалансовыйСчет=ПланыСчетов.Хозрасчетный.ОсновныеСредстваБезвозмездноеПользование Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.Субконто1.Наименование КАК НаименованиеОС,
		|	ХозрасчетныйОстатки.Субконто1.Код КАК ИнвентарныйНомер,
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Стоимость 		
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, , , ) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Счет = &Счет
		|	И ХозрасчетныйОстатки.Организация = &Организация
		|	И ХозрасчетныйОстатки.Субконто2 = &Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеОС";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто2 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.Субконто2.Наименование КАК НаименованиеОС,
		|	ХозрасчетныйОстатки.Субконто2.Код КАК ИнвентарныйНомер,
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Стоимость
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, , , ) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Счет = &Счет
		|	И ХозрасчетныйОстатки.Организация = &Организация
		|	И ХозрасчетныйОстатки.Субконто1 = &Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеОС";
	КонецЕсли;	
	
	Запрос.Текст =ТекстЗапроса;
	Выборка   = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл	
		
		СтрокаТабличнойЧасти = ОС.Добавить();
		СтрокаТабличнойЧасти.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
		СтрокаТабличнойЧасти.ОсновноеСредство = Выборка.ОсновноеСредство;
		СтрокаТабличнойЧасти.Количество       = Выборка.Количество;
		СтрокаТабличнойЧасти.Стоимость        = Выборка.Стоимость;
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСкладуЗабаланс(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

//СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма); //ЮЦАУ
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры
//Конец СтандартныеПодсистемы.Печать


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти
