
&НаКлиентеНаСервереБезКонтекста
&Вместо("ИзменениеРеквизитаШапкиОтчета")
Процедура Расш1_ИзменениеРеквизитаШапкиОтчета(Форма)
	
	Отчет = Форма.Отчет;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода",            Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода",             Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Организация",              Отчет.Организация);
	ПараметрыОтчета.Вставить("ПодразделениеОрганизации", Отчет.ПодразделениеОрганизации);
	ПараметрыОтчета.Вставить("ПлатежныйАгент",           Отчет.ПлатежныйАгент);
	ПараметрыОтчета.Вставить("ПассажирскиеПеревозки",    Форма.ПассажирскиеПеревозки);
	
	ДопПараметры = ПолучитьДополнительныеПараметры(ПараметрыОтчета);
	ЗаполнитьЗначенияСвойств(Форма, ДопПараметры, "Кассир, ГлавныйБухгалтер, НомерЛистаНачало");
	
	ОбновитьТекстЗаголовка(Форма);
	
КонецПроцедуры

//&НаКлиенте
//&Перед("КнигаФормируетсяПриИзменении")
//Процедура Расш1_КнигаФормируетсяПриИзменении(Элемент)
//	
//	Отчет.ПлатежныйАгент = НЕ КнигаФормируется;
//	ИзменениеРеквизитаШапкиОтчета(ЭтотОбъект);
//	
//	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
//	КонецЕсли;
//	
//КонецПроцедуры


