
&ИзменениеИКонтроль("ПредопределенныеСчетаКосвенныхРасходов")
Функция Расш1_ПредопределенныеСчетаКосвенныхРасходов()

	СчетаРасходов = Новый Массив();
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);   
	#Вставка
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводстваКосв); //23.01
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.РасходыПоАвтомойкеКосв); //23.02
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходыПассажирскиеПеревозки); //25.01.2
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходыРаспределяемые); //25.01.3
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники); //25.02
	СчетаРасходов.Добавить(ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов); //25.03
	#КонецВставки
	Возврат СчетаРасходов;

КонецФункции
