
&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе")  
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе(КонтекстВыполнения) Экспорт //ЮЦАУ //
           
	КонтекстВыполнения.Вставить("РассчитанныеПараметры", Новый Структура);
	
	НастройкиПолученияБухитогов = Новый Структура;
	НастройкиПолученияБухитогов.Вставить("Организация",   КонтекстВыполнения.Организация);
	НастройкиПолученияБухитогов.Вставить("НачалоПериода", КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета);
	НастройкиПолученияБухитогов.Вставить("КонецПериода",  КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = ЗаполнениеБухгалтерскойОтчетностиИтоги.СальдоИОборотыПоСчетам(НастройкиПолученияБухитогов);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СальдоИОборотыПоСчетам", СальдоИОборотыПоСчетам);
	
	СчетаДляРасчета = "76.01.1, 76.03, 76.05, 76.06, 76.09, 76.21, 76.25, 76.26, 76.29, 76.35, 76.36, 76.39, 76.41, 76.49, 76.К";
	СубконтоДляРасчета = "Контрагенты";
	
	СиО_Контрагенты = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_Контрагенты", СиО_Контрагенты);
	
	СчетаДляРасчета = "60.01, 60.21, 60.31, 62.01, 62.21, 62.31,
	|76.01.1, 76.03, 76.05, 76.06, 76.09, 76.21, 76.25, 76.26, 76.29, 76.35, 76.36, 76.39, 76.К, 76.НА, 76.07.2, 76.27.2, 76.37.2";
	СубконтоДляРасчета = "Контрагенты, Договоры";
	
	СиО_КонтрагентыДоговоры = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_КонтрагентыДоговоры", СиО_КонтрагентыДоговоры);
	
	СчетаДляРасчета = "68.01, 68.02, 68.03, 68.06, 68.07, 68.08, 68.09, 68.11, 68.12, 68.13, 68.14, 68.21, 68.34, 68.52,
	|69.01, 69.02.1, 69.02.2, 69.02.3, 69.02.4, 69.02.5, 69.02.6, 69.02.7,
	|69.03.1, 69.03.2, 69.04, 69.05.1, 69.05.2, 69.06.1, 69.06.2, 69.06.3, 69.06.4, 69.06.5, 69.11, 69.12";
	СубконтоДляРасчета = "ВидыПлатежейВГосБюджет";
	
	СиО_ВидыПлатежей = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_ВидыПлатежей", СиО_ВидыПлатежей);
	
	СчетаДляРасчета = "68.04.1, 68.10";
	СубконтоДляРасчета = "ВидыПлатежейВГосБюджет, УровниБюджетов";
	
	СиО_ВидыПлатежейУровниБюджетов = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_ВидыПлатежейУровниБюджетов", СиО_ВидыПлатежейУровниБюджетов);
	
	СчетаДляРасчета = "70, 71, 73.03, 76.10";
	СубконтоДляРасчета = "РаботникиОрганизаций";
	
	СиО_Работники = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_Работники", СиО_Работники);
	
	СчетаДляРасчета = "96.09";
	СубконтоДляРасчета = "Резервы";
	
	СиО_Резервы = СальдоИОборотыПоСчетамИСубконто(НастройкиПолученияБухитогов, СчетаДляРасчета, СубконтоДляРасчета);
	КонтекстВыполнения.РассчитанныеПараметры.Вставить("СиО_Резервы", СиО_Резервы);
	
	ИдентификаторАвтозаполнения = КонтекстВыполнения.СтруктураОтчета.Баланс.ИдентификаторАвтозаполнения;
	
	Если ИдентификаторАвтозаполнения = "Баланс_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел1_2012Кв1(КонтекстВыполнения);
	ИначеЕсли ИдентификаторАвтозаполнения = "Баланс"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО" Тогда
		ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел1_2011Кв4(КонтекстВыполнения);
	Иначе
		ЗаписьЖурналаРегистрации("Заполнение бухгалтерской отчетности", УровеньЖурналаРегистрации.Ошибка, , , "Переданный идентификатор автозаполнения бухгалтерского баланса - """ + ИдентификаторАвтозаполнения + """");
		ВызватьИсключение "Неизвестный идентификатор алгоритма автозаполнения бухгалтерского баланса";
	КонецЕсли;
	
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел2(КонтекстВыполнения);
	
	Если ИдентификаторАвтозаполнения = "Баланс"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3" Тогда
		ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел3(КонтекстВыполнения);
	ИначеЕсли ИдентификаторАвтозаполнения = "БалансНКО"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел3_НКО(КонтекстВыполнения);
	Иначе
		ЗаписьЖурналаРегистрации("Заполнение бухгалтерской отчетности", УровеньЖурналаРегистрации.Ошибка, , , "Переданный идентификатор автозаполнения бухгалтерского баланса - """ + ИдентификаторАвтозаполнения + """");
		ВызватьИсключение "Неизвестный идентификатор алгоритма автозаполнения бухгалтерского баланса";
	КонецЕсли;
	
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел4(КонтекстВыполнения);
	
	ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел5(КонтекстВыполнения);
	
	КонтекстВыполнения.Удалить("РассчитанныеПараметры");
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел1_2012Кв1")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел1_2012Кв1(КонтекстВыполнения) //ЮЦАУ //ОСНОВНОЕ 1
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	ДополнительныеПараметрыРасшифровки = Новый Структура("Организация", Организация);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	РазделенноеСальдоСчета_02_01 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_01(КонецПериодаОтчета, Организация);
	
	СтруктураСКД_97      = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_97(КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_2 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.2"), КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_9 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.9"), КонецПериодаОтчета, Организация);
	
	НомерСтроки = "1110";
	НаименованиеСтроки = "Нематериальные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_04_01 = СКД("04.01", СальдоИОборотыПоСчетам);
	СКК_05    = СКК("05", СальдоИОборотыПоСчетам);
	СКД_08_05 = СКД("08.05", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_04_01 - СКК_05 + СКД_08_05;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+","!СКД " + Счет("04.01").Код, СКД_04_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("05").Код, -СКК_05 ,ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.05").Код, СКД_08_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.05")));
	
	НомерВРасшифровке = 11101;
	
	НомерСтроки = "11101";
	НаименованиеСтроки = "Нематериальные активы в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_04_01 - СКК_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.01").Код, СКД_04_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("05").Код, -СКК_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("05")));
	КонецЕсли;
	
	НомерСтроки = "11102";
	НаименованиеСтроки = "Приобретение нематериальных активов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.05").Код, СКД_08_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.05")));
	КонецЕсли;
	
	НомерСтроки = "1120";
	НаименованиеСтроки = "Результаты исследований и разработок";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_04_02 = СКД("04.02", СальдоИОборотыПоСчетам);
	СКД_08_08 = СКД("08.08", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_04_02 + СКД_08_08;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.02").Код, СКД_04_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+","!СКД " + Счет("08.08").Код, СКД_08_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.08")));
	
	НомерВРасшифровке = 11201;
	
	НомерСтроки = "11201";
	НаименованиеСтроки = "Расходы на научно-исследовательские, опытно-конструкторские и технологические работы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_04_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.02").Код, СКД_04_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.02")));
	КонецЕсли;
	
	НомерСтроки = "11202";
	НаименованиеСтроки = "Выполнение научно-исследовательских, опытно-конструкторских и технологических работ";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.08").Код, СКД_08_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.08")));
	КонецЕсли;
	
	НомерСтроки = "1130";
	НаименованиеСтроки = "Нематериальные поисковые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_11 = СКД("08.11", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_08_11;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.11").Код, СКД_08_11, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.11")));
	
	НомерСтроки = "1140";
	НаименованиеСтроки = "Материальные поисковые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_12 = СКД("08.12", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_08_12;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.12").Код, СКД_08_12, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.12")));
	
	НомерСтроки = "1150";
	НаименованиеСтроки = "Основные средства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_01    = СКД("01", СальдоИОборотыПоСчетам);
	СКД_01_01 = СКД("01.01", СальдоИОборотыПоСчетам);
	СКД_01_03 = СКД("01.03", СальдоИОборотыПоСчетам);
	СКД_01_08 = СКД("01.08", СальдоИОборотыПоСчетам);
	СКК_02_01 = СКК("02.01", СальдоИОборотыПоСчетам);
	СКК_02_03 = СКК("02.03", СальдоИОборотыПоСчетам);
	СКД_07    = СКД("07", СальдоИОборотыПоСчетам);
	СКД_08_01 = СКД("08.01", СальдоИОборотыПоСчетам);
	СКД_08_02 = СКД("08.02", СальдоИОборотыПоСчетам);
	СКД_08_03 = СКД("08.03", СальдоИОборотыПоСчетам);
	СКД_08_04 = СКД("08.04", СальдоИОборотыПоСчетам);
	
	СКК_02_01__01_01 = РазделенноеСальдоСчета_02_01.СКК_02_01__01_01; // Амортизация ОС, учитываемых на счете 01.01
	СКК_02_01__01_08 = РазделенноеСальдоСчета_02_01.СКК_02_01__01_08; // Амортизация ОС, учитываемых на счете 01.08
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ОсновныеСредства;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_01 - СКК_02_01 - СКК_02_03
	+ СКД_07
	+ СКД_08_01 + СКД_08_02 + СКД_08_03 + СКД_08_04
	+ СКД_97_ПоВидуАктива
	+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01").Код, СКД_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.01").Код, -СКК_02_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.03").Код, -СКК_02_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("07").Код, СКД_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.01").Код, СКД_08_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.02").Код, СКД_08_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.03").Код, СКД_08_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.04").Код, СКД_08_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.04")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 11501;
	
	НомерСтроки = "11501";
	НаименованиеСтроки = "Основные средства в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_01 - СКК_02_01__01_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.01").Код, СКД_01_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.01 в части ОС в организации", -СКК_02_01__01_01, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11502";
	НаименованиеСтроки = "Объекты недвижимости, права собственности на которые не зарегистрированы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_08 - СКК_02_01__01_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.08").Код, СКД_01_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.01 в части объектов недвижимости на которые не зарегистрированы права собственности", -СКК_02_01__01_08, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11503";
	НаименованиеСтроки = "Оборудование к установке";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("07").Код, СКД_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("07")));
	КонецЕсли;
	
	НомерСтроки = "11504";
	НаименованиеСтроки = "Приобретение земельных участков";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.01").Код, СКД_08_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.01")));
	КонецЕсли;
	
	НомерСтроки = "11505";
	НаименованиеСтроки = "Приобретение объектов природопользования";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.02").Код, СКД_08_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.02")));
	КонецЕсли;
	
	НомерСтроки = "11506";
	НаименованиеСтроки = "Строительство объектов основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.03").Код, СКД_08_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.03")));
	КонецЕсли;
	
	НомерСтроки = "11507";
	НаименованиеСтроки = "Приобретение объектов основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.04").Код, СКД_08_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.04")));
	КонецЕсли;
	
	НомерСтроки = "11508";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "11509";
	НаименованиеСтроки = "Основные средства в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_03 - СКК_02_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.03").Код, СКД_01_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.03").Код, -СКК_02_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.03")));
	КонецЕсли;
	
	НомерСтроки = "1160";
	НаименованиеСтроки = "Доходные вложения в материальные ценности";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_02_02 = СКК("02.02", СальдоИОборотыПоСчетам);
	СКД_03    = СКД("03", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_03 - СКК_02_02;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03").Код, СКД_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.02").Код, -СКК_02_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.02")));
	
	НомерВРасшифровке = 11601;
	
	РазделенноеСальдоСчета_02_02 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_02(КонецПериодаОтчета, Организация);
	СКК_02_02__03_01 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_01; // Амортизация ОС, учитываемых на счете 03.01
	СКК_02_02__03_02 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_02; // Амортизация ОС, учитываемых на счете 03.02
	СКК_02_02__03_03 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_03; // Амортизация ОС, учитываемых на счете 03.03
	СКК_02_02__03_04 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_04; // Амортизация ОС, учитываемых на счете 03.04
	
	СКД_03_01 = СКД("03.01", СальдоИОборотыПоСчетам);
	СКД_03_02 = СКД("03.02", СальдоИОборотыПоСчетам);
	СКД_03_03 = СКД("03.03", СальдоИОборотыПоСчетам);
	СКД_03_04 = СКД("03.04", СальдоИОборотыПоСчетам);
	
	НомерСтроки = "11601";
	НаименованиеСтроки = "Материальные ценности в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_01 - СКК_02_02__03_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.01").Код, СКД_03_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.01", -СКК_02_02__03_01, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11602";
	НаименованиеСтроки = "Материальные ценности предоставленные во временное владение и пользование";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_02 - СКК_02_02__03_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.02").Код, СКД_03_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.02", -СКК_02_02__03_02, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11603";
	НаименованиеСтроки = "Материальные ценности предоставленные во временное пользование";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_03 - СКК_02_02__03_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.03").Код, СКД_03_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.03", -СКК_02_02__03_03, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11604";
	НаименованиеСтроки = "Прочие доходные вложения";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_04 - СКК_02_02__03_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.04").Код, СКД_03_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.04", -СКК_02_02__03_04, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "1170";
	НаименованиеСтроки = "Финансовые вложения";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_58_01_1 = СКД("58.01.1", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_58_01_1;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.1").Код, СКД_58_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.1")));
	
	НомерВРасшифровке = 11701;
	
	НомерСтроки = "11701";
	НаименованиеСтроки = "Паи";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_01_1;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.1").Код, СКД_58_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.1")));
	КонецЕсли;
	
	НомерСтроки = "1180";
	НаименованиеСтроки = "Отложенные налоговые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_09 = СКД("09", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_09;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("09").Код, СКД_09, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("09")));
	
	НомерСтроки = "1190";
	НаименованиеСтроки = "Прочие внеоборотные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_06 = СКД("08.06", СальдоИОборотыПоСчетам);
	СКД_08_07 = СКД("08.07", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеВнеоборотныеАктивы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_08_06 + СКД_08_07
	+ СКД_97_ПоВидуАктива
	+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.06").Код, СКД_08_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.07").Код, СКД_08_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.07")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 11901;
	
	НомерСтроки = "11901";
	НаименованиеСтроки = "Перевод молодняка животных в основное стадо";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_06;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.06").Код, СКД_08_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.06")));
	КонецЕсли;
	
	НомерСтроки = "11902";
	НаименованиеСтроки = "Приобретение взрослых животных";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.07").Код, СКД_08_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.07")));
	КонецЕсли;
	
	НомерСтроки = "11903";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел2_2015Кв1")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел2_2015Кв1(КонтекстВыполнения) //ЮЦАУ//ОСНОВНОЕ 2
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	УчетНа70ВедетсяСводно = КонтекстВыполнения.УчетНа70ВедетсяСводно;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	СиО_Контрагенты = КонтекстВыполнения.РассчитанныеПараметры.СиО_Контрагенты;
	СиО_КонтрагентыДоговоры = КонтекстВыполнения.РассчитанныеПараметры.СиО_КонтрагентыДоговоры;
	
	СиО_ВидыПлатежей = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежей;
	СиО_ВидыПлатежейУровниБюджетов = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежейУровниБюджетов;
	
	СиО_Работники = КонтекстВыполнения.РассчитанныеПараметры.СиО_Работники;
	СиО_Резервы = КонтекстВыполнения.РассчитанныеПараметры.СиО_Резервы;
	
	ИдентификаторАвтозаполнения = КонтекстВыполнения.СтруктураОтчета.Баланс.ИдентификаторАвтозаполнения;
	ЭтоИП = НЕ РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	
	ЭтоБаланс2012 = ИдентификаторАвтозаполнения = "Баланс_2012Кв1" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв1"
	ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4"
	ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_2" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_2"
	ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3";
	
	СтрокаОтраженияСчета46 = "1210";
	СтрокаОтраженияСчета96 = "1260";
	
	СтрокаОтраженияСчета76_АВ = "1260";
	СтрокаОтраженияСчета76_ВА = "1550";
	
	Если ИдентификаторАвтозаполнения = "Баланс_2012Кв4" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4" Тогда
		СтрокаОтраженияСчета46 = "1260";
	КонецЕсли;
	
	Если ИдентификаторАвтозаполнения = "Баланс_2012Кв4_2" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3" ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		СтрокаОтраженияСчета46 = "1230";
		СтрокаОтраженияСчета96 = "1230";
	КонецЕсли;
	
	Если ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		СтрокаОтраженияСчета76_АВ = "1520";
		СтрокаОтраженияСчета76_ВА = "1230";
	КонецЕсли;
	
	С2018 = (КонецПериодаОтчета >= '2018-01-01');
	
	СтрокаОтраженияСчета76_АВ = "1260"; //ЮЦАУ
	
	РазделенноеСальдоСчета_02_01 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_01(КонецПериодаОтчета, Организация);
	
	СтруктураСКД_97      = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_97(КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_2 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.2"), КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_9 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.9"), КонецПериодаОтчета, Организация);
	
	НомерСтроки = "1210";
	НаименованиеСтроки = "Запасы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_10    = СКД("10", СальдоИОборотыПоСчетам);
	СКД_11    = СКД("11", СальдоИОборотыПоСчетам);
	СКК_14_01 = СКК("14.01", СальдоИОборотыПоСчетам);
	СКК_14_02 = СКК("14.02", СальдоИОборотыПоСчетам);
	СКК_14_03 = СКК("14.03", СальдоИОборотыПоСчетам);
	СКК_14_04 = СКК("14.04", СальдоИОборотыПоСчетам);
	СКД_15_01 = СКД("15.01", СальдоИОборотыПоСчетам);
	СКД_15_02 = СКД("15.02", СальдоИОборотыПоСчетам);
	СКК_16_01 = СКК("16.01", СальдоИОборотыПоСчетам);
	СКД_16_01 = СКД("16.01", СальдоИОборотыПоСчетам);
	СКК_16_02 = СКК("16.02", СальдоИОборотыПоСчетам);
	СКД_16_02 = СКД("16.02", СальдоИОборотыПоСчетам);
	СКД_20    = СКД("20", СальдоИОборотыПоСчетам);
	СКД_21    = СКД("21", СальдоИОборотыПоСчетам);
	СКД_23    = СКД("23", СальдоИОборотыПоСчетам);
	СКД_28    = СКД("28", СальдоИОборотыПоСчетам);
	СКД_29    = СКД("29", СальдоИОборотыПоСчетам);
	СКД_41    = СКД("41", СальдоИОборотыПоСчетам);
	СКК_42    = СКК("42", СальдоИОборотыПоСчетам);
	СКД_43    = СКД("43", СальдоИОборотыПоСчетам);
	СКД_44    = СКД("44", СальдоИОборотыПоСчетам);
	СКД_45    = СКД("45", СальдоИОборотыПоСчетам);
	СКД_46    = СКД("46", СальдоИОборотыПоСчетам);
	СКК_76_ВА = СКК("76.ВА", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.Запасы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_10 - СКК_14_01 + СКД_15_01 + СКД_16_01 - СКК_16_01
	+ СКД_11 + СКД_20 + СКД_21 + СКД_23 + СКД_29 + СКД_44
	+ ?(СтрокаОтраженияСчета46 = "1210", СКД_46, 0)
	- СКК_14_04 + СКД_43 - СКК_14_03 + СКД_41 - СКК_14_02
	+ СКД_15_02 + СКД_16_02 - СКК_16_02 - СКК_42 + СКД_45 + СКД_28
	+ СКД_97_ПоВидуАктива
	+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("10").Код, СКД_10, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.01").Код, -СКК_14_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.01").Код, СКД_15_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.01").Код, СКД_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.01").Код, -СКК_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("11").Код, СКД_11, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("20").Код, СКД_20, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("20")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("21").Код, СКД_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("23").Код, СКД_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("23")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("29").Код, СКД_29, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("44").Код, СКД_44, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("44")));
	Если СтрокаОтраженияСчета46 = "1210" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.04").Код, -СКК_14_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("43").Код, СКД_43, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("43")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.03").Код, -СКК_14_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("41").Код, СКД_41, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.02").Код, -СКК_14_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.02").Код, СКД_15_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.02").Код, СКД_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.02").Код, -СКК_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("42").Код, -СКК_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("42")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("45").Код, СКД_45, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("45")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("28").Код, СКД_28, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("28")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 12101;
	
	НомерСтроки = "12101";
	НаименованиеСтроки = "Материалы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_10 - СКК_14_01 + СКД_15_01 + СКД_16_01 - СКК_16_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("10").Код, СКД_10, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.01").Код, -СКК_14_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.01").Код, СКД_15_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.01").Код, СКД_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.01").Код, -СКК_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	КонецЕсли;
	
	НомерСтроки = "12102";
	НаименованиеСтроки = "Брак в производстве";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_28;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("28").Код, СКД_28, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("28")));
	КонецЕсли;
	
	НомерСтроки = "12103";
	НаименованиеСтроки = "Товары отгруженные";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_45;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("45").Код, СКД_45, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("45")));
	КонецЕсли;
	
	НомерСтроки = "12104";
	НаименованиеСтроки = "Товары";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_41 - СКК_14_02 + СКД_15_02 + СКД_16_02 - СКК_16_02 - СКК_42;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("41").Код, СКД_41, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.02").Код, -СКК_14_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.02").Код, СКД_15_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.02").Код, СКД_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.02").Код, -СКК_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("42").Код, -СКК_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("42")));
	КонецЕсли;
	
	НомерСтроки = "12105";
	НаименованиеСтроки = "Готовая продукция";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_43 - СКК_14_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("43").Код, СКД_43, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("43")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.03").Код, -СКК_14_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.03")));
	КонецЕсли;
	
	НомерСтроки = "12106";
	НаименованиеСтроки = "Расходы на продажу";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_44;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("44").Код, СКД_44, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("44")));
	КонецЕсли;
	
	Если СтрокаОтраженияСчета46 = "1210" Тогда
		НомерСтроки = "12107";
		НаименованиеСтроки = "Выполненные этапы по незавершенным работам";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКД_46;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12108";
	НаименованиеСтроки = "Основное производство";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_20 - СКК_14_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("20").Код, СКД_20, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("20")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.04").Код, -СКК_14_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.04")));
	КонецЕсли;
	
	НомерСтроки = "12109";
	НаименованиеСтроки = "Полуфабрикаты собственного производства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("21").Код, СКД_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("21")));
	КонецЕсли;
	
	НомерСтроки = "12110";
	НаименованиеСтроки = "Вспомогательные производства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("23").Код, СКД_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("23")));
	КонецЕсли;
	
	НомерСтроки = "12111";
	НаименованиеСтроки = "Обслуживающие производства и хозяйства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_29;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("29").Код, СКД_29, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("29")));
	КонецЕсли;
	
	НомерСтроки = "12112";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "1220";
	НаименованиеСтроки = "Налог на добавленную стоимость по приобретенным ценностям";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_19    = СКД("19", СальдоИОборотыПоСчетам);
	СКД_19_01 = СКД("19.01", СальдоИОборотыПоСчетам);
	СКД_19_02 = СКД("19.02", СальдоИОборотыПоСчетам);
	СКД_19_03 = СКД("19.03", СальдоИОборотыПоСчетам);
	СКД_19_04 = СКД("19.04", СальдоИОборотыПоСчетам);
	СКД_19_05 = СКД("19.05", СальдоИОборотыПоСчетам);
	СКД_19_06 = СКД("19.06", СальдоИОборотыПоСчетам);
	СКД_19_07 = СКД("19.07", СальдоИОборотыПоСчетам);
	СКД_19_08 = СКД("19.08", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_19 - СКД_19_06;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19").Код, СКД_19, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("19.06").Код, -СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	
	НомерВРасшифровке = 12201;
	
	НомерСтроки = "12201";
	НаименованиеСтроки = "НДС по приобретенным ОС";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.01").Код, СКД_19_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.01")));
	КонецЕсли;
	
	НомерСтроки = "12202";
	НаименованиеСтроки = "НДС по приобретенным НМА";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.02").Код, СКД_19_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.02")));
	КонецЕсли;
	
	НомерСтроки = "12203";
	НаименованиеСтроки = "НДС по приобретенным материально-производственным запасам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.03").Код, СКД_19_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.03")));
	КонецЕсли;
	
	НомерСтроки = "12204";
	НаименованиеСтроки = "НДС по приобретенным услугам";
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.04").Код, СКД_19_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.04")));
	КонецЕсли;
	
	НомерСтроки = "12205";
	НаименованиеСтроки = "НДС, уплаченный при ввозе товаров на территорию РФ";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.05").Код, СКД_19_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.05")));
	КонецЕсли;
	
	НомерСтроки = "12206";
	НаименованиеСтроки = "НДС по товарам, реализованным по ставке 0% (экспорт)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.07").Код, СКД_19_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.07")));
	КонецЕсли;
	
	НомерСтроки = "12207";
	НаименованиеСтроки = "НДС при строительстве ОС";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.08").Код, СКД_19_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.08")));
	КонецЕсли;
	
	НомерСтроки = "1230";
	НаименованиеСтроки = "Дебиторская задолженность";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКДР_62_01_КонтрагентыДоговоры = СКДР("62.01", СиО_КонтрагентыДоговоры);
	СКДР_62_21_КонтрагентыДоговоры = СКДР("62.21", СиО_КонтрагентыДоговоры);
	СКДР_62_31_КонтрагентыДоговоры = СКДР("62.31", СиО_КонтрагентыДоговоры);
	
	СКДР_60_01_КонтрагентыДоговоры = СКДР("60.01", СиО_КонтрагентыДоговоры);
	СКДР_60_21_КонтрагентыДоговоры = СКДР("60.21", СиО_КонтрагентыДоговоры);
	СКДР_60_31_КонтрагентыДоговоры = СКДР("60.31", СиО_КонтрагентыДоговоры);
	
	СКД_60_02   = СКД("60.02", СальдоИОборотыПоСчетам);
	СКД_60_22   = СКД("60.22", СальдоИОборотыПоСчетам);
	СКД_60_32   = СКД("60.32", СальдоИОборотыПоСчетам);
	СКД_62_03   = СКД("62.03", СальдоИОборотыПоСчетам);
	СКК_63      = СКК("63", СальдоИОборотыПоСчетам);
	СКД_68_04_2 = СКД("68.04.2", СальдоИОборотыПоСчетам);
	СКДР_69_13  = СКДР("69.13", СальдоИОборотыПоСчетам);
	СКД_73_01   = СКД("73.01", СальдоИОборотыПоСчетам);
	СКД_73_02   = СКД("73.02", СальдоИОборотыПоСчетам);
	СКД_75_01   = СКД("75.01", СальдоИОборотыПоСчетам);
	
	СКД_76_02   = СКД("76.02", СальдоИОборотыПоСчетам);
	СКД_76_22   = СКД("76.22", СальдоИОборотыПоСчетам);
	СКД_76_32   = СКД("76.32", СальдоИОборотыПоСчетам);
	
	СКД_76_13   = СКД("76.13", СальдоИОборотыПоСчетам);
	
	НоваяСтрока75_01 = КонтекстВыполнения.ТаблицаСведенийСчета75_01.Добавить();
	НоваяСтрока75_01.Графа = Графа;
	НоваяСтрока75_01.Сумма = СКД_75_01;
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	Если УчетНа70ВедетсяСводно Тогда
		СКДР_70_Работники = СКД("70", СальдоИОборотыПоСчетам);
	Иначе
		СКДР_70_Работники = СКДР("70", СиО_Работники);
	КонецЕсли;
	
	СКДР_71_Работники = СКДР("71", СиО_Работники);
	//СКДР_73_03_Работники = СКДР("73.03", СиО_Работники);
	СКДР_73_03_Работники = СКД("73.03", СальдоИОборотыПоСчетам); // ЮЦАУ //
	СКДР_76_10_Работники = СКДР("76.10", СиО_Работники);
	
	СКДР_68_01_ВидыПлатежей = СКДР("68.01", СиО_ВидыПлатежей);
	СКДР_68_02_ВидыПлатежей = СКДР("68.02", СиО_ВидыПлатежей);
	СКДР_68_03_ВидыПлатежей = СКДР("68.03", СиО_ВидыПлатежей);
	СКДР_68_06_ВидыПлатежей = СКДР("68.06", СиО_ВидыПлатежей);
	СКДР_68_07_ВидыПлатежей = СКДР("68.07", СиО_ВидыПлатежей);
	СКДР_68_08_ВидыПлатежей = СКДР("68.08", СиО_ВидыПлатежей);
	СКДР_68_09_ВидыПлатежей = СКДР("68.09", СиО_ВидыПлатежей);
	СКДР_68_11_ВидыПлатежей = СКДР("68.11", СиО_ВидыПлатежей);
	СКДР_68_12_ВидыПлатежей = СКДР("68.12", СиО_ВидыПлатежей);
	СКДР_68_13_ВидыПлатежей = СКДР("68.13", СиО_ВидыПлатежей);
	СКДР_68_14_ВидыПлатежей = СКДР("68.14", СиО_ВидыПлатежей);
	СКДР_68_21_ВидыПлатежей = СКДР("68.21", СиО_ВидыПлатежей);
	СКДР_68_34_ВидыПлатежей = СКДР("68.34", СиО_ВидыПлатежей);
	СКДР_68_52_ВидыПлатежей = СКДР("68.52", СиО_ВидыПлатежей);
	
	//СКДР_69_01_ВидыПлатежей   = СКДР("69.01", СиО_ВидыПлатежей);
	СКДР_69_01_ВидыПлатежей   = СКД("69.01", СальдоИОборотыПоСчетам);  //ЮЦАУ 
	
	СКДР_69_02_1_ВидыПлатежей = СКДР("69.02.1", СиО_ВидыПлатежей);
	СКДР_69_02_2_ВидыПлатежей = СКДР("69.02.2", СиО_ВидыПлатежей);
	СКДР_69_02_3_ВидыПлатежей = СКДР("69.02.3", СиО_ВидыПлатежей);
	СКДР_69_02_4_ВидыПлатежей = СКДР("69.02.4", СиО_ВидыПлатежей);
	СКДР_69_02_5_ВидыПлатежей = СКДР("69.02.5", СиО_ВидыПлатежей);
	СКДР_69_02_6_ВидыПлатежей = СКДР("69.02.6", СиО_ВидыПлатежей);
	СКДР_69_02_7_ВидыПлатежей = СКДР("69.02.7", СиО_ВидыПлатежей);
	
	СКДР_69_03_1_ВидыПлатежей = СКДР("69.03.1", СиО_ВидыПлатежей);
	СКДР_69_03_2_ВидыПлатежей = СКДР("69.03.2", СиО_ВидыПлатежей);
	
	СКДР_69_04_ВидыПлатежей   = СКДР("69.04", СиО_ВидыПлатежей);
	
	СКДР_69_05_1_ВидыПлатежей = СКДР("69.05.1", СиО_ВидыПлатежей);
	СКДР_69_05_2_ВидыПлатежей = СКДР("69.05.2", СиО_ВидыПлатежей);
	
	СКДР_69_06_1_ВидыПлатежей = СКДР("69.06.1", СиО_ВидыПлатежей);
	СКДР_69_06_2_ВидыПлатежей = СКДР("69.06.2", СиО_ВидыПлатежей);
	СКДР_69_06_3_ВидыПлатежей = СКДР("69.06.3", СиО_ВидыПлатежей);
	СКДР_69_06_4_ВидыПлатежей = СКДР("69.06.4", СиО_ВидыПлатежей);
	СКДР_69_06_5_ВидыПлатежей = СКДР("69.06.5", СиО_ВидыПлатежей);
	
	СКДР_69_11_ВидыПлатежей   = СКДР("69.11", СиО_ВидыПлатежей);
	СКДР_69_12_ВидыПлатежей   = СКДР("69.12", СиО_ВидыПлатежей);
	
	//СКДР_68_04_1_ВидыПлатежейУровни = СКДР("68.04.1", СиО_ВидыПлатежейУровниБюджетов);
	СКДР_68_04_1_ВидыПлатежейУровни = СКД("68.04.1", СальдоИОборотыПоСчетам); //ЮЦАУ 
	
	СКДР_68_10_ВидыПлатежейУровни   = СКДР("68.10", СиО_ВидыПлатежейУровниБюджетов);
	
	ВидыСубконтоКонтрагентыДоговоры = Новый Массив;
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	СКДР_76_01_1_КонтрагентыДоговоры = СКДР("76.01.1", СиО_КонтрагентыДоговоры);
	СКДР_76_03_КонтрагентыДоговоры   = СКДР("76.03", СиО_КонтрагентыДоговоры);
	СКДР_76_05_КонтрагентыДоговоры   = СКДР("76.05", СиО_КонтрагентыДоговоры);
	СКДР_76_06_КонтрагентыДоговоры   = СКДР("76.06", СиО_КонтрагентыДоговоры);
	//СКДР_76_09_КонтрагентыДоговоры   = СКДР("76.09", СиО_КонтрагентыДоговоры);
	СКДР_76_09_КонтрагентыДоговоры   = СКДР("76.09", СиО_Контрагенты); //ЮЦАУ
	СКДР_76_21_КонтрагентыДоговоры   = СКДР("76.21", СиО_КонтрагентыДоговоры);
	СКДР_76_25_КонтрагентыДоговоры   = СКДР("76.25", СиО_КонтрагентыДоговоры);
	СКДР_76_26_КонтрагентыДоговоры   = СКДР("76.26", СиО_КонтрагентыДоговоры);
	СКДР_76_29_КонтрагентыДоговоры   = СКДР("76.29", СиО_КонтрагентыДоговоры);
	СКДР_76_35_КонтрагентыДоговоры   = СКДР("76.35", СиО_КонтрагентыДоговоры);
	СКДР_76_36_КонтрагентыДоговоры   = СКДР("76.36", СиО_КонтрагентыДоговоры);
	СКДР_76_39_КонтрагентыДоговоры   = СКДР("76.39", СиО_КонтрагентыДоговоры);
	СКДР_76_К_КонтрагентыДоговоры    = СКДР("76.К", СиО_КонтрагентыДоговоры);
	СКДР_76_НА_КонтрагентыДоговоры   = СКДР("76.НА", СиО_КонтрагентыДоговоры);
	
	СКДР_76_07_2_КонтрагентыДоговоры = СКДР("76.07.2", СиО_КонтрагентыДоговоры);
	СКДР_76_27_2_КонтрагентыДоговоры = СКДР("76.27.2", СиО_КонтрагентыДоговоры);
	СКДР_76_37_2_КонтрагентыДоговоры = СКДР("76.37.2", СиО_КонтрагентыДоговоры);
	
	СКДР_76_41_Контрагенты = СКДР("76.41", СиО_Контрагенты);
	СКДР_76_49_Контрагенты = СКДР("76.49", СиО_Контрагенты);
	
	СКДР_96_09_Резервы = СКДР("96.09", СиО_Резервы);
	
	ЗначениеПоказателя = СКД_60_02 + СКДР_60_01_КонтрагентыДоговоры
	+ СКД_60_22 + СКДР_60_21_КонтрагентыДоговоры
	+ СКД_60_32 + СКДР_60_31_КонтрагентыДоговоры
	- ?(СтрокаОтраженияСчета76_ВА = "1230", СКК_76_ВА, 0)
	+ СКД_62_03
	+ СКДР_62_01_КонтрагентыДоговоры + СКДР_62_21_КонтрагентыДоговоры + СКДР_62_31_КонтрагентыДоговоры - СКК_63
	+ СКДР_68_01_ВидыПлатежей + СКДР_68_02_ВидыПлатежей + СКДР_68_03_ВидыПлатежей
	+ СКДР_68_04_1_ВидыПлатежейУровни + СКД_68_04_2
	+ СКДР_68_06_ВидыПлатежей + СКДР_68_07_ВидыПлатежей + СКДР_68_08_ВидыПлатежей + СКДР_68_09_ВидыПлатежей
	+ СКДР_68_10_ВидыПлатежейУровни
	+ СКДР_68_11_ВидыПлатежей + СКДР_68_12_ВидыПлатежей + СКДР_68_13_ВидыПлатежей
	+ СКДР_69_01_ВидыПлатежей
	//+ СКДР_69_02_1_ВидыПлатежей + СКДР_69_02_2_ВидыПлатежей + СКДР_69_02_3_ВидыПлатежей + СКДР_69_02_4_ВидыПлатежей + СКДР_69_02_5_ВидыПлатежей + СКДР_69_02_6_ВидыПлатежей + СКДР_69_02_7_ВидыПлатежей
	//+ СКДР_69_03_1_ВидыПлатежей + СКДР_69_03_2_ВидыПлатежей
	//+ СКДР_69_04_ВидыПлатежей
	//+ СКДР_69_05_1_ВидыПлатежей + СКДР_69_05_2_ВидыПлатежей
	//+ СКДР_69_06_1_ВидыПлатежей + СКДР_69_06_2_ВидыПлатежей + СКДР_69_06_3_ВидыПлатежей + СКДР_69_06_4_ВидыПлатежей + СКДР_69_06_5_ВидыПлатежей
	//+ СКДР_69_11_ВидыПлатежей + СКДР_69_12_ВидыПлатежей //ЮЦАУ
	+ ?(ЭтоИП, СКДР_68_21_ВидыПлатежей, 0)
	+ СКДР_69_13
	+ ?(ЭтоИП, СКДР_68_14_ВидыПлатежей, 0)
	+ ?(С2018, СКДР_68_34_ВидыПлатежей, 0)
	+ ?(С2018, СКДР_68_52_ВидыПлатежей, 0)
	+ СКДР_70_Работники
	+ СКДР_71_Работники
	+ СКД_73_01 + СКД_73_02 + СКДР_73_03_Работники
	+ СКД_75_01
	+ СКДР_76_01_1_КонтрагентыДоговоры + СКДР_76_21_КонтрагентыДоговоры + СКД_76_02 + СКД_76_22 + СКДР_76_03_КонтрагентыДоговоры + СКД_76_32 + СКДР_76_05_КонтрагентыДоговоры
	+ СКДР_76_10_Работники
	+ СКДР_76_25_КонтрагентыДоговоры + СКДР_76_35_КонтрагентыДоговоры + СКДР_76_09_КонтрагентыДоговоры + СКДР_76_29_КонтрагентыДоговоры + СКДР_76_39_КонтрагентыДоговоры
	+ СКДР_76_41_Контрагенты + СКДР_76_49_Контрагенты
	+ СКДР_76_06_КонтрагентыДоговоры + СКДР_76_26_КонтрагентыДоговоры + СКДР_76_36_КонтрагентыДоговоры + СКДР_76_К_КонтрагентыДоговоры
	+ СКДР_76_07_2_КонтрагентыДоговоры + СКДР_76_27_2_КонтрагентыДоговоры + СКДР_76_37_2_КонтрагентыДоговоры
	+ СКД_76_13
	+ СКД_97_ПоВидуАктива
	+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива
	+ ?(СтрокаОтраженияСчета96 = "1230", СКДР_96_09_Резервы, 0)
	+ ?(СтрокаОтраженияСчета46 = "1230", СКД_46, 0);
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("60.02").Код, СКД_60_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.22").Код, СКД_60_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.32").Код, СКД_60_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
	Если СтрокаОтраженияСчета76_ВА = "1230" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("76.ВА").Код, -СКК_76_ВА, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ВА")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("62.03").Код, СКД_62_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("63").Код, -СКК_63, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("63")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("68.04.2").Код, СКД_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
	КонецЕсли;
	Если С2018 Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКДР " + Счет("69.13").Код, СКДР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	
	Если УчетНа70ВедетсяСводно Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("70").Код, СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
	Иначе
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 70, развернутое по субконто ""Работники организации""", СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 71, развернутое по субконто ""Работники организации""", СКДР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.01").Код, СКД_73_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.02").Код, СКД_73_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета " + Счет("73.03").Код + ", развернутое по субконто ""Работники организации""", СКДР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("75.01").Код, СКД_75_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.02").Код, СКД_76_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.22").Код, СКД_76_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.32").Код, СКД_76_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.10, развернутое по субконто ""Работники организации""", СКДР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.41, развернутое по субконто ""Контрагенты""", СКДР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.49, развернутое по субконто ""Контрагенты""", СКДР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.13").Код, СКД_76_13, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.13")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	Если СтрокаОтраженияСчета96 = "1230" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	КонецЕсли;
	Если СтрокаОтраженияСчета46 = "1230" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
	КонецЕсли;
	
	НомерВРасшифровке = 12301;
	
	НомерСтроки = "12301";
	НаименованиеСтроки = "Расчеты с поставщиками и подрядчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_60_02 + СКДР_60_01_КонтрагентыДоговоры
		+ СКД_60_22 + СКДР_60_21_КонтрагентыДоговоры
		+ СКД_60_32 + СКДР_60_31_КонтрагентыДоговоры
		- ?(СтрокаОтраженияСчета76_ВА = "1230", СКК_76_ВА, 0);
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("60.02").Код, СКД_60_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.22").Код, СКД_60_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.32").Код, СКД_60_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
		Если СтрокаОтраженияСчета76_ВА = "1230" Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("76.ВА").Код, -СКК_76_ВА, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ВА")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12302";
	НаименованиеСтроки = "Расчеты с покупателями и заказчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_62_03 + СКДР_62_01_КонтрагентыДоговоры
		+ СКДР_62_21_КонтрагентыДоговоры + СКДР_62_31_КонтрагентыДоговоры
		- СКК_63;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("62.03").Код, СКД_62_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Положительное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Положительное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Положительное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "-", "!СКК" + Счет("63").Код, -СКК_63, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("63")));
	КонецЕсли;
	
	НомерСтроки = "12303";
	НаименованиеСтроки = "Расчеты по налогам и сборам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_68_01_ВидыПлатежей + СКДР_68_02_ВидыПлатежей + СКДР_68_03_ВидыПлатежей
		+ СКДР_68_04_1_ВидыПлатежейУровни + СКД_68_04_2
		+ СКДР_68_06_ВидыПлатежей + СКДР_68_07_ВидыПлатежей + СКДР_68_08_ВидыПлатежей + СКДР_68_09_ВидыПлатежей
		+ СКДР_68_10_ВидыПлатежейУровни
		+ СКДР_68_11_ВидыПлатежей + СКДР_68_12_ВидыПлатежей + СКДР_68_13_ВидыПлатежей
		+ ?(ЭтоИП, СКДР_68_14_ВидыПлатежей, 0)
		+ ?(С2018, СКДР_68_34_ВидыПлатежей, 0)
		+ ?(С2018, СКДР_68_52_ВидыПлатежей, 0)
		+ ?(ЭтоИП, СКДР_68_21_ВидыПлатежей, 0);
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
		КонецЕсли;
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "!СКД " + Счет("68.04.2").Код, СКД_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
		КонецЕсли;
		Если С2018 Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "12304";
	НаименованиеСтроки = "Расчеты по социальному страхованию и обеспечению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_69_01_ВидыПлатежей
		+ СКДР_69_02_1_ВидыПлатежей + СКДР_69_02_2_ВидыПлатежей + СКДР_69_02_3_ВидыПлатежей + СКДР_69_02_4_ВидыПлатежей + СКДР_69_02_5_ВидыПлатежей + СКДР_69_02_6_ВидыПлатежей + СКДР_69_02_7_ВидыПлатежей
		+ СКДР_69_03_1_ВидыПлатежей + СКДР_69_03_2_ВидыПлатежей
		+ СКДР_69_04_ВидыПлатежей
		+ СКДР_69_05_1_ВидыПлатежей + СКДР_69_05_2_ВидыПлатежей
		+ СКДР_69_06_1_ВидыПлатежей + СКДР_69_06_2_ВидыПлатежей + СКДР_69_06_3_ВидыПлатежей + СКДР_69_06_4_ВидыПлатежей + СКДР_69_06_5_ВидыПлатежей
		+ СКДР_69_11_ВидыПлатежей + СКДР_69_12_ВидыПлатежей
		+ СКДР_69_13;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКДР " + Счет("69.13").Код, СКДР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	КонецЕсли;
	
	НомерСтроки = "12310";
	НаименованиеСтроки = "Расчеты с персоналом по оплате труда";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_70_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		Если УчетНа70ВедетсяСводно Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("70").Код, СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
		Иначе
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 70, развернутое по субконто ""Работники организации""", СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12305";
	НаименованиеСтроки = "Расчеты с подотчетными лицами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_71_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 71, развернутое по субконто ""Работники организации""", СКДР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	КонецЕсли;
	
	НомерСтроки = "12306";
	НаименованиеСтроки = "Расчеты с персоналом по прочим операциям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_73_01 + СКД_73_02 + СКДР_73_03_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("73.01").Код, СКД_73_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.02").Код, СКД_73_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 73.03, развернутое по субконто ""Работники организации""", СКДР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	КонецЕсли;
	
	НомерСтроки = "12307";
	НаименованиеСтроки = "Расчеты по вкладам в уставный (складочный) капитал";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_75_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("75.01").Код, СКД_75_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.01")));
	КонецЕсли;
	
	НомерСтроки = "12308";
	НаименованиеСтроки = "Расчеты с разными дебиторами и кредиторами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_76_01_1_КонтрагентыДоговоры + СКДР_76_21_КонтрагентыДоговоры + СКД_76_02 + СКД_76_22 + СКДР_76_03_КонтрагентыДоговоры + СКД_76_32 + СКДР_76_05_КонтрагентыДоговоры
		+ СКДР_76_25_КонтрагентыДоговоры + СКДР_76_35_КонтрагентыДоговоры + СКДР_76_09_КонтрагентыДоговоры + СКДР_76_29_КонтрагентыДоговоры + СКДР_76_39_КонтрагентыДоговоры
		+ СКДР_76_10_Работники
		+ СКДР_76_41_Контрагенты + СКДР_76_49_Контрагенты
		+ СКДР_76_06_КонтрагентыДоговоры + СКДР_76_26_КонтрагентыДоговоры + СКДР_76_36_КонтрагентыДоговоры + СКДР_76_К_КонтрагентыДоговоры
		+ СКДР_76_07_2_КонтрагентыДоговоры + СКДР_76_27_2_КонтрагентыДоговоры + СКДР_76_37_2_КонтрагентыДоговоры;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "!СКД " + Счет("76.02").Код, СКД_76_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "!СКД " + Счет("76.22").Код, СКД_76_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "!СКД " + Счет("76.32").Код, СКД_76_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.10, развернутое по субконто ""Работники организации""", СКДР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.41, развернутое по субконто ""Контрагенты""", СКДР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.49, развернутое по субконто ""Контрагенты""", СКДР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	КонецЕсли;
	
	НомерСтроки = "12309";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	Если СтрокаОтраженияСчета46 = "1230" Тогда
		НомерСтроки = "12311";
		НаименованиеСтроки = "Выполненные этапы по незавершенным работам";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКД_46;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаОтраженияСчета96 = "1230" Тогда
		НомерСтроки = "12312";
		НаименованиеСтроки = "Оценочные обязательства";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКДР_96_09_Резервы;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12313";
	НаименованиеСтроки = "Расчеты с факторинговыми компаниями";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_76_13;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.13").Код, СКД_76_13, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.13")));
	КонецЕсли;
	
	НомерСтроки = "1240";
	НаименованиеСтроки = "Финансовые вложения";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_55_03   = СКД("55.03", СальдоИОборотыПоСчетам);
	СКД_55_23   = СКД("55.23", СальдоИОборотыПоСчетам);
	СКД_58_01_2 = СКД("58.01.2", СальдоИОборотыПоСчетам);
	СКД_58_02   = СКД("58.02", СальдоИОборотыПоСчетам);
	СКД_58_03   = СКД("58.03", СальдоИОборотыПоСчетам);
	СКД_58_04   = СКД("58.04", СальдоИОборотыПоСчетам);
	СКД_58_05   = СКД("58.05", СальдоИОборотыПоСчетам);
	СКК_59      = СКК("59", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_58_01_2 + СКД_58_02 - СКК_59
	+ СКД_58_03 + СКД_58_04 + СКД_58_05 + СКД_55_03 + СКД_55_23;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.2").Код, СКД_58_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.02").Код, СКД_58_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("59").Код, -СКК_59, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("59")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.03").Код, СКД_58_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.04").Код, СКД_58_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.05").Код, СКД_58_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.03").Код, СКД_55_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.23").Код, СКД_55_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.23")));
	
	НомерВРасшифровке = 12401;
	
	НомерСтроки = "12401";
	НаименованиеСтроки = "Акции";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_01_2;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.2").Код, СКД_58_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.2")));
	КонецЕсли;
	
	НомерСтроки = "12402";
	НаименованиеСтроки = "Долговые ценные бумаги";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_02 - СКК_59;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.02").Код, СКД_58_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("59").Код, -СКК_59, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("59")));
	КонецЕсли;
	
	НомерСтроки = "12403";
	НаименованиеСтроки = "Предоставленные займы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.03").Код, СКД_58_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.03")));
	КонецЕсли;
	
	НомерСтроки = "12404";
	НаименованиеСтроки = "Вклады по договору простого товарищества";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.04").Код, СКД_58_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.04")));
	КонецЕсли;
	
	НомерСтроки = "12405";
	НаименованиеСтроки = "Приобретенные права в рамках оказания финансовых услуг";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("58.05").Код, СКД_58_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.05")));
	КонецЕсли;
	
	НомерСтроки = "12406";
	НаименованиеСтроки = "Депозитные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.03"), СКД_55_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.03")));
	КонецЕсли;
	
	НомерСтроки = "12407";
	НаименованиеСтроки = "Депозитные счета (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.23"), СКД_55_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.23")));
	КонецЕсли;
	
	НомерСтроки = "1250";
	НаименованиеСтроки = "Денежные средства и денежные эквиваленты";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_50_01 = СКД("50.01", СальдоИОборотыПоСчетам);
	СКД_50_02 = СКД("50.02", СальдоИОборотыПоСчетам);
	СКД_50_04 = СКД("50.04", СальдоИОборотыПоСчетам);
	СКД_50_21 = СКД("50.21", СальдоИОборотыПоСчетам);
	СКД_51    = СКД("51", СальдоИОборотыПоСчетам);
	СКД_52    = СКД("52", СальдоИОборотыПоСчетам);
	СКД_55_01 = СКД("55.01", СальдоИОборотыПоСчетам);
	СКД_55_02 = СКД("55.02", СальдоИОборотыПоСчетам);
	СКД_55_04 = СКД("55.04", СальдоИОборотыПоСчетам);
	СКД_55_21 = СКД("55.21", СальдоИОборотыПоСчетам);
	СКД_55_24 = СКД("55.24", СальдоИОборотыПоСчетам);
	СКД_57    = СКД("57", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_50_01 + СКД_50_02 + СКД_50_21
	+ ?(ЭтоБаланс2012, СКД_50_04, 0)
	+ СКД_51 + СКД_52
	+ СКД_55_01 + СКД_55_02 + СКД_55_04 + СКД_55_21 + СКД_55_24
	+ СКД_57;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.01").Код, СКД_50_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.02").Код, СКД_50_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.21").Код, СКД_50_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.21")));
	Если ЭтоБаланс2012 Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.04").Код, СКД_50_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.04")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("51").Код, СКД_51, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("51")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("52").Код, СКД_52, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("52")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.01").Код, СКД_55_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.02").Код, СКД_55_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.04").Код, СКД_55_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.21").Код, СКД_55_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.24").Код, СКД_55_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.24")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("57").Код, СКД_57, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("57")));
	
	НомерВРасшифровке = 12501;
	
	НомерСтроки = "12501";
	НаименованиеСтроки ="Касса организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.01").Код, СКД_50_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.01")));
	КонецЕсли;
	
	НомерСтроки = "12502";
	НаименованиеСтроки ="Операционная касса";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.02").Код, СКД_50_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.02")));
	КонецЕсли;
	
	НомерСтроки = "12503";
	НаименованиеСтроки ="Касса организации (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.21").Код, СКД_50_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.21")));
	КонецЕсли;
	
	НомерСтроки = "12512";
	НаименованиеСтроки = "Касса по деятельности платежного агента";
	
	Если ЭтоБаланс2012 И ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.04").Код, СКД_50_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.04")));
	КонецЕсли;
	
	НомерСтроки = "12504";
	НаименованиеСтроки = "Расчетные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_51;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("51").Код, СКД_51, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("51")));
	КонецЕсли;
	
	НомерСтроки = "12505";
	НаименованиеСтроки = "Валютные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_52;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("52").Код, СКД_52, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("52")));
	КонецЕсли;
	
	НомерСтроки = "12506";
	НаименованиеСтроки = "Аккредитивы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.01").Код, СКД_55_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.01")));
	КонецЕсли;
	
	НомерСтроки = "12507";
	НаименованиеСтроки = "Чековые книжки";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.02").Код, СКД_55_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.02")));
	КонецЕсли;
	
	НомерСтроки = "12508";
	НаименованиеСтроки = "Прочие специальные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("55.04").Код, СКД_55_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.04")));
	КонецЕсли;
	
	НомерСтроки = "12509";
	НаименованиеСтроки = "Аккредитивы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.21").Код, СКД_55_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.21")));
	КонецЕсли;
	
	НомерСтроки = "12510";
	НаименованиеСтроки = "Прочие специальные счета (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_24;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.24").Код, СКД_55_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.24")));
	КонецЕсли;
	
	НомерСтроки = "12511";
	НаименованиеСтроки = "Переводы в пути";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_57;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("57").Код, СКД_57, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("57")));
	КонецЕсли;
	
	НомерСтроки = "1260";
	НаименованиеСтроки = "Прочие оборотные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_19_06 = СКД("19.06", СальдоИОборотыПоСчетам);
	СКД_50_03 = СКД("50.03", СальдоИОборотыПоСчетам);
	СКД_50_23 = СКД("50.23", СальдоИОборотыПоСчетам);
	СКД_68_22 = СКД("68.22", СальдоИОборотыПоСчетам);
	СКД_76_АВ = СКД("76.АВ", СальдоИОборотыПоСчетам);
	СКД_76_ОТ = СКД("76.ОТ", СальдоИОборотыПоСчетам);
	СКД_94    = СКД("94", СальдоИОборотыПоСчетам);
	
	СКД_76_07_9 = СКД("76.07.9", СальдоИОборотыПоСчетам);
	СКД_76_37_9 = СКД("76.37.9", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_19_06 + СКД_50_03 + СКД_50_23 + СКД_68_22
	+ ?(СтрокаОтраженияСчета76_АВ = "1260", СКД_76_АВ, 0)
	+ СКД_76_ОТ + СКДР_76_НА_КонтрагентыДоговоры + СКД_94
	+ СКД_97_ПоВидуАктива
	+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива
	+ СКД_76_07_9 + СКД_76_37_9
	+ ?(СтрокаОтраженияСчета96 = "1260", СКДР_96_09_Резервы, 0)
	+ ?(СтрокаОтраженияСчета46 = "1260", СКД_46, 0);
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.06").Код, СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.03").Код, СКД_50_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.23").Код, СКД_50_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.23")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("68.22").Код, СКД_68_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.22")));
	Если СтрокаОтраженияСчета76_АВ = "1260" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.АВ").Код, СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.ОТ").Код, СКД_76_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ОТ")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по дебету счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.07.9").Код, СКД_76_07_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.07.9")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.37.9").Код, СКД_76_37_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.37.9")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("94").Код, СКД_94, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("94")));
	Если СтрокаОтраженияСчета96 = "1260" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	КонецЕсли;
	Если СтрокаОтраженияСчета46 = "1260" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
	КонецЕсли;
	
	НомерВРасшифровке = 12601;
	
	НомерСтроки = "12601";
	НаименованиеСтроки ="Акцизы по оплаченным материальным ценностям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_06;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.06").Код, СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	КонецЕсли;
	
	НомерСтроки = "12602";
	НаименованиеСтроки ="Денежные документы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.03").Код, СКД_50_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.03")));
	КонецЕсли;
	
	НомерСтроки = "12603";
	НаименованиеСтроки ="Денежные документы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.23").Код, СКД_50_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.23")));
	КонецЕсли;
	
	НомерСтроки = "12604";
	НаименованиеСтроки ="НДС по экспорту к возмещению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_68_22;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("68.22").Код, СКД_68_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.22")));
	КонецЕсли;
	
	Если СтрокаОтраженияСчета76_АВ = "1260" Тогда
		НомерСтроки = "12605";
		НаименованиеСтроки ="НДС по авансам и предоплатам";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКД_76_АВ;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.АВ").Код, СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12606";
	НаименованиеСтроки ="НДС, начисленный по отгрузке";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_76_ОТ;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.ОТ").Код, СКД_76_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ОТ")));
	КонецЕсли;
	
	НомерСтроки = "12607";
	НаименованиеСтроки ="Расчеты по НДС при исполнении обязанностей налогового агента";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_76_НА_КонтрагентыДоговоры;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	КонецЕсли;
	
	НомерСтроки = "12608";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		+ СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "12609";
	НаименованиеСтроки ="Недостачи и потери от порчи ценностей";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_94;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("94").Код, СКД_94, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("94")));
	КонецЕсли;
	
	Если СтрокаОтраженияСчета96 = "1260" Тогда
		НомерСтроки = "12610";
		НаименованиеСтроки ="Оценочные резервы";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКДР_96_09_Резервы;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
		КонецЕсли;
		
	Иначе
		НомерСтроки = "12610";
		НаименованиеСтроки ="НДС по арендным обязательствам";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКД_76_07_9 + СКД_76_37_9;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.07.9").Код, СКД_76_07_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.07.9")));
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.37.9").Код, СКД_76_37_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.37.9")));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаОтраженияСчета46 = "1260" Тогда
		НомерСтроки = "12611";
		НаименованиеСтроки = "Выполненные этапы по незавершенным работам";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКД_46;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел3")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел3(КонтекстВыполнения) //ЮЦАУ //ОСНОВНОЕ 3
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	НомерСтроки = "1310";
	НаименованиеСтроки = "Уставный капитал (складочный капитал, уставный фонд, вклады товарищей)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_80 = СКК("80", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_80;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("80").Код, СКК_80, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("80")));
	
	НомерСтроки = "1320";
	НаименованиеСтроки = "Собственные акции, выкупленные у акционеров";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_81 = СКД("81", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_81;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, -ЗначениеПоказателя); // вычитаемый
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("81").Код, СКД_81, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("81")));
	
	НомерСтроки = "1340";
	НаименованиеСтроки = "Переоценка внеоборотных активов";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_83_01 = СКК("83.01", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_83_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01").Код, СКК_83_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01")));
	
	НомерВРасшифровке = 13401;
	
	СКК_83_01_1 = СКК("83.01.1", СальдоИОборотыПоСчетам);
	СКК_83_01_2 = СКК("83.01.2", СальдоИОборотыПоСчетам);
	СКК_83_01_3 = СКК("83.01.3", СальдоИОборотыПоСчетам);
	
	НомерСтроки = "13401";
	НаименованиеСтроки = "Переоценка основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_1;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.1").Код, СКК_83_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.1")));
	КонецЕсли;
	
	НомерСтроки = "13402";
	НаименованиеСтроки = "Переоценка НМА";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_2;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.2").Код, СКК_83_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.2")));
	КонецЕсли;
	
	НомерСтроки = "13403";
	НаименованиеСтроки = "Переоценка прочих внеоборотных активов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_3;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.3").Код, СКК_83_01_3, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.3")));
	КонецЕсли;
	
	НомерСтроки = "1350";
	НаименованиеСтроки = "Добавочный капитал (без переоценки)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_83    = СКК("83", СальдоИОборотыПоСчетам);
	СКК_83_01 = СКК("83.01", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_83 - СКК_83_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " +  Счет("83").Код, СКК_83, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " +  Счет("83.01").Код, -СКК_83_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01")));
	
	НомерСтроки = "1360";
	НаименованиеСтроки = "Резервный капитал";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_82    = СКК("82", СальдоИОборотыПоСчетам);
	СКК_82_01 = СКК("82.01", СальдоИОборотыПоСчетам);
	СКК_82_02 = СКК("82.02", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_82;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("82").Код, СКК_82, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82")));
	
	НомерВРасшифровке = 13601;
	
	НомерСтроки = "13601";
	НаименованиеСтроки = "Резервы, образованные в соответствии с законодательством";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_82_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("82.01").Код, СКК_82_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82.01")));
	КонецЕсли;
	
	НомерСтроки = "13602";
	НаименованиеСтроки = "Резервы, образованные в соответствии с учредительными документами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_82_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " +  Счет("82.02").Код, СКК_82_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82.02")));
	КонецЕсли;
	
	НомерСтроки = "1370";
	НаименованиеСтроки = "Нераспределенная прибыль (непокрытый убыток)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_84 = СКК("84", СальдоИОборотыПоСчетам);
	СКД_84 = СКД("84", СальдоИОборотыПоСчетам);
	СКК_99 = СКК("99", СальдоИОборотыПоСчетам);
	СКД_99 = СКД("99", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_84 - СКД_84 + СКК_99 - СКД_99;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("84").Код, СКК_84, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("84")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("84").Код, -СКД_84, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("84")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("99").Код, СКК_99, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("99")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("99").Код, -СКД_99, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("99")));
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел4")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел4(КонтекстВыполнения) //ЮЦАУ //ОСНОВНОЕ 4
	
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	НомерСтроки = "1410";
	НаименованиеСтроки = "Заемные средства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = ЗаголовокРасшифровки(НомерСтроки, НаименованиеСтроки, ЗаголовокГрафы);
	
	СКК_67_01 = СКК("67.01", СальдоИОборотыПоСчетам);
	СКК_67_03 = СКК("67.03", СальдоИОборотыПоСчетам);
	СКК_67_21 = СКК("67.21", СальдоИОборотыПоСчетам);
	СКК_67_23 = СКК("67.23", СальдоИОборотыПоСчетам);
	СКК_67_05 = СКК("67.05", СальдоИОборотыПоСчетам);
	СКК_67_25 = СКК("67.25", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_67_01 + СКК_67_21 + СКК_67_03 + СКК_67_23;
	Если НачалоПериодаОтчета >= '2015-10-01' Тогда
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_05 + СКК_67_25;
	КонецЕсли;
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.01").Код, СКК_67_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.21").Код, СКК_67_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.03").Код, СКК_67_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.23").Код, СКК_67_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.23")));
	Если НачалоПериодаОтчета >= '2015-10-01' Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.05").Код, СКК_67_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.05")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.25").Код, СКК_67_25, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.25")));
	КонецЕсли;
	
	НомерВРасшифровке = 14101;
	
	НомерСтроки = "14101";
	НаименованиеСтроки = "Долгосрочные кредиты";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.01").Код, СКК_67_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.01")));
	КонецЕсли;
	
	НомерСтроки = "14102";
	НаименованиеСтроки = "Долгосрочные займы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_03;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_05;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.03").Код, СКК_67_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.03")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.05").Код, СКК_67_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.05")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "14103";
	НаименованиеСтроки = "Долгосрочные кредиты (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_21;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.21").Код, СКК_67_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.21")));
		
	КонецЕсли;
	
	НомерСтроки = "14104";
	НаименованиеСтроки = "Долгосрочные займы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_23;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_25;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.23").Код, СКК_67_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.23")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.25").Код, СКК_67_25, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.25")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "1420";
	НаименованиеСтроки = "Отложенные налоговые обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = ЗаголовокРасшифровки(НомерСтроки, НаименованиеСтроки, ЗаголовокГрафы);
	
	СКК_77 = СКК("77", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_77;
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("77").Код, СКК_77, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("77")));
	
	НомерСтроки = "1450";
	НаименованиеСтроки = "Прочие обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = ЗаголовокРасшифровки(НомерСтроки, НаименованиеСтроки, ЗаголовокГрафы);
	
	СКК_76_07_1 = СКК("76.07.1", СальдоИОборотыПоСчетам);
	СКК_76_27_1 = СКК("76.27.1", СальдоИОборотыПоСчетам);
	СКК_76_37_1 = СКК("76.37.1", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_76_07_1 + СКК_76_27_1 + СКК_76_37_1;
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("76.07.1").Код, СКК_76_07_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.07.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.27.1").Код, СКК_76_27_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.27.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.37.1").Код, СКК_76_37_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.37.1")));
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел5_2015Кв1")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2011Кв4_БалансПоГрафе_Раздел5_2015Кв1(КонтекстВыполнения) //ЮЦАУ //ОСНОВНОЕ 5
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	УчетНа70ВедетсяСводно = КонтекстВыполнения.УчетНа70ВедетсяСводно;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	СиО_Контрагенты = КонтекстВыполнения.РассчитанныеПараметры.СиО_Контрагенты;
	СиО_КонтрагентыДоговоры = КонтекстВыполнения.РассчитанныеПараметры.СиО_КонтрагентыДоговоры;
	
	СиО_ВидыПлатежей = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежей;
	СиО_ВидыПлатежейУровниБюджетов = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежейУровниБюджетов;
	
	СиО_Работники = КонтекстВыполнения.РассчитанныеПараметры.СиО_Работники;
	СиО_Резервы = КонтекстВыполнения.РассчитанныеПараметры.СиО_Резервы;
	
	ИдентификаторАвтозаполнения = КонтекстВыполнения.СтруктураОтчета.Баланс.ИдентификаторАвтозаполнения;
	ЭтоИП = НЕ РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	
	СтрокаОтраженияСчета76_АВ = "1260";
	СтрокаОтраженияСчета76_ВА = "1550";
	
	Если ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		СтрокаОтраженияСчета76_АВ = "1520";
		СтрокаОтраженияСчета76_ВА = "1230";
	КонецЕсли;
	
	С2018 = (КонецПериодаОтчета >= '2018-01-01');
	
	НомерСтроки = "1510";
	НаименованиеСтроки = "Заемные средства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_66    = СКК("66", СальдоИОборотыПоСчетам);
	СКК_66_01 = СКК("66.01", СальдоИОборотыПоСчетам);
	СКК_66_02 = СКК("66.02", СальдоИОборотыПоСчетам);
	СКК_66_03 = СКК("66.03", СальдоИОборотыПоСчетам);
	СКК_66_04 = СКК("66.04", СальдоИОборотыПоСчетам);
	СКК_66_05 = СКК("66.05", СальдоИОборотыПоСчетам);
	СКК_66_06 = СКК("66.06", СальдоИОборотыПоСчетам);
	СКК_66_21 = СКК("66.21", СальдоИОборотыПоСчетам);
	СКК_66_22 = СКК("66.22", СальдоИОборотыПоСчетам);
	СКК_66_23 = СКК("66.23", СальдоИОборотыПоСчетам);
	СКК_66_24 = СКК("66.24", СальдоИОборотыПоСчетам);
	СКК_66_25 = СКК("66.25", СальдоИОборотыПоСчетам);
	СКК_66_26 = СКК("66.26", СальдоИОборотыПоСчетам);
	СКК_67_02 = СКК("67.02", СальдоИОборотыПоСчетам);
	СКК_67_04 = СКК("67.04", СальдоИОборотыПоСчетам);
	СКК_67_22 = СКК("67.22", СальдоИОборотыПоСчетам);
	СКК_67_24 = СКК("67.24", СальдоИОборотыПоСчетам);
	СКК_67_06 = СКК("67.06", СальдоИОборотыПоСчетам);
	СКК_67_26 = СКК("67.26", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_66 + СКК_67_02 + СКК_67_04 + СКК_67_22 + СКК_67_24;
	Если НачалоПериодаОтчета >= '2015-10-01' Тогда
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_06 + СКК_67_26;
	КонецЕсли;
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66").Код, СКК_66, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.02").Код, СКК_67_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.04").Код, СКК_67_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.22").Код, СКК_67_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.24").Код, СКК_67_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.24")));
	Если НачалоПериодаОтчета >= '2015-10-01' Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.06").Код, СКК_67_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.26").Код, СКК_67_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.26")));
	КонецЕсли;
	
	НомерВРасшифровке = 15101;
	
	НомерСтроки = "15101";
	НаименованиеСтроки = "Краткосрочные кредиты";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_01;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.01").Код, СКК_66_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.01")));
		
	КонецЕсли;
	
	НомерСтроки = "15102";
	НаименованиеСтроки = "Краткосрочные займы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_03;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_05;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.03").Код, СКК_66_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.03")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.05").Код, СКК_66_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.05")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15103";
	НаименованиеСтроки = "Проценты по краткосрочным кредитам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_02;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.02").Код, СКК_66_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.02")));
		
	КонецЕсли;
	
	НомерСтроки = "15104";
	НаименованиеСтроки = "Проценты по долгосрочным кредитам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_02;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.02").Код, СКК_67_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.02")));
		
	КонецЕсли;
	
	НомерСтроки = "15105";
	НаименованиеСтроки = "Проценты по краткосрочным займам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_04;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_06;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.04").Код, СКК_66_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.04")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.06").Код, СКК_66_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.06")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15106";
	НаименованиеСтроки = "Проценты по долгосрочным займам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_04;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_06;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.04").Код, СКК_67_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.04")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.06").Код, СКК_67_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.06")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15107";
	НаименованиеСтроки = "Краткосрочные кредиты (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_21;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.21").Код, СКК_66_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.21")));
		
	КонецЕсли;
	
	НомерСтроки = "15108";
	НаименованиеСтроки = "Краткосрочные займы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_23;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_25;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.23").Код, СКК_66_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.23")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.25").Код, СКК_66_25, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.25")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15109";
	НаименованиеСтроки = "Проценты по краткосрочным кредитам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_22;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.22").Код, СКК_66_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.22")));
		
	КонецЕсли;
	
	НомерСтроки = "15110";
	НаименованиеСтроки = "Проценты по долгосрочным кредитам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_22;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.22").Код, СКК_67_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.22")));
		
	КонецЕсли;
	
	НомерСтроки = "15111";
	НаименованиеСтроки = "Проценты по краткосрочным займам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_24;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_26;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.24").Код, СКК_66_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.24")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.26").Код, СКК_66_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.26")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15112";
	НаименованиеСтроки = "Проценты по долгосрочным займам (в валюте)";
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_24;
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_26;
		КонецЕсли;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.24").Код, СКК_67_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.24")));
		Если НачалоПериодаОтчета >= '2015-10-01' Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.26").Код, СКК_67_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.26")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "1520";
	НаименованиеСтроки = "Кредиторская задолженность";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СККР_60_01_КонтрагентыДоговоры = СККР("60.01", СиО_КонтрагентыДоговоры);
	СККР_60_21_КонтрагентыДоговоры = СККР("60.21", СиО_КонтрагентыДоговоры);
	СККР_60_31_КонтрагентыДоговоры = СККР("60.31", СиО_КонтрагентыДоговоры);
	
	СККР_62_01_КонтрагентыДоговоры = СККР("62.01", СиО_КонтрагентыДоговоры);
	СККР_62_21_КонтрагентыДоговоры = СККР("62.21", СиО_КонтрагентыДоговоры);
	СККР_62_31_КонтрагентыДоговоры = СККР("62.31", СиО_КонтрагентыДоговоры);
	
	Если УчетНа70ВедетсяСводно Тогда
		СККР_70_Работники = СКК("70", СальдоИОборотыПоСчетам);
	Иначе
		СККР_70_Работники = СККР("70", СиО_Работники);
	КонецЕсли;
	
	//СККР_71_Работники = СККР("71", СиО_Работники);  //ЮЦАУ
	СККР_71_Работники   = СКК("71", СальдоИОборотыПоСчетам);
	
	//СККР_73_03_Работники = СККР("73.03", СиО_Работники); //ЮЦАУ
	СККР_73_03_Работники = СКК("73.03", СальдоИОборотыПоСчетам);
	
	СККР_76_10_Работники = СККР("76.10", СиО_Работники);
	
	СККР_68_01_ВидыПлатежей = СККР("68.01", СиО_ВидыПлатежей);
	СККР_68_02_ВидыПлатежей = СККР("68.02", СиО_ВидыПлатежей);
	СККР_68_03_ВидыПлатежей = СККР("68.03", СиО_ВидыПлатежей);
	СККР_68_05_ВидыПлатежей = СККР("68.05", СиО_ВидыПлатежей); //ЮЦАУ //ДОбавлено
	СККР_68_06_ВидыПлатежей = СККР("68.06", СиО_ВидыПлатежей);
	СККР_68_07_ВидыПлатежей = СККР("68.07", СиО_ВидыПлатежей);
	СККР_68_08_ВидыПлатежей = СККР("68.08", СиО_ВидыПлатежей);
	СККР_68_09_ВидыПлатежей = СККР("68.09", СиО_ВидыПлатежей);
	СККР_68_11_ВидыПлатежей = СККР("68.11", СиО_ВидыПлатежей);
	СККР_68_12_ВидыПлатежей = СККР("68.12", СиО_ВидыПлатежей);
	СККР_68_13_ВидыПлатежей = СККР("68.13", СиО_ВидыПлатежей);
	СККР_68_14_ВидыПлатежей = СККР("68.14", СиО_ВидыПлатежей);
	СККР_68_34_ВидыПлатежей = СККР("68.34", СиО_ВидыПлатежей);
	СККР_68_52_ВидыПлатежей = СККР("68.52", СиО_ВидыПлатежей);
	СККР_68_21_ВидыПлатежей = СККР("68.21", СиО_ВидыПлатежей);
	
	//СККР_69_01_ВидыПлатежей   = СККР("69.01", СиО_ВидыПлатежей);
	СККР_69_01_ВидыПлатежей   = СКК("69", СальдоИОборотыПоСчетам); //ЮЦАУ 
	
	СККР_69_02_1_ВидыПлатежей = СККР("69.02.1", СиО_ВидыПлатежей);
	СККР_69_02_2_ВидыПлатежей = СККР("69.02.2", СиО_ВидыПлатежей);
	СККР_69_02_3_ВидыПлатежей = СККР("69.02.3", СиО_ВидыПлатежей);
	СККР_69_02_4_ВидыПлатежей = СККР("69.02.4", СиО_ВидыПлатежей);
	СККР_69_02_5_ВидыПлатежей = СККР("69.02.5", СиО_ВидыПлатежей);
	СККР_69_02_6_ВидыПлатежей = СККР("69.02.6", СиО_ВидыПлатежей);
	СККР_69_02_7_ВидыПлатежей = СККР("69.02.7", СиО_ВидыПлатежей);
	
	СККР_69_03_1_ВидыПлатежей = СККР("69.03.1", СиО_ВидыПлатежей);
	СККР_69_03_2_ВидыПлатежей = СККР("69.03.2", СиО_ВидыПлатежей);
	
	СККР_69_04_ВидыПлатежей   = СККР("69.04", СиО_ВидыПлатежей);
	
	СККР_69_05_1_ВидыПлатежей = СККР("69.05.1", СиО_ВидыПлатежей);
	СККР_69_05_2_ВидыПлатежей = СККР("69.05.2", СиО_ВидыПлатежей);
	
	СККР_69_06_1_ВидыПлатежей = СККР("69.06.1", СиО_ВидыПлатежей);
	СККР_69_06_2_ВидыПлатежей = СККР("69.06.2", СиО_ВидыПлатежей);
	СККР_69_06_3_ВидыПлатежей = СККР("69.06.3", СиО_ВидыПлатежей);
	СККР_69_06_4_ВидыПлатежей = СККР("69.06.4", СиО_ВидыПлатежей);
	СККР_69_06_5_ВидыПлатежей = СККР("69.06.5", СиО_ВидыПлатежей);
	
	СККР_69_11_ВидыПлатежей   = СККР("69.11", СиО_ВидыПлатежей);
	СККР_69_12_ВидыПлатежей   = СККР("69.12", СиО_ВидыПлатежей);
	
	//СККР_68_04_1_ВидыПлатежейУровни = СККР("68.04.1", СиО_ВидыПлатежейУровниБюджетов);
	СККР_68_04_1_ВидыПлатежейУровни = СКК("68.04.1", СальдоИОборотыПоСчетам); //ЮЦАУ
	СККР_68_10_ВидыПлатежейУровни   = СККР("68.10", СиО_ВидыПлатежейУровниБюджетов);
	
	СККР_76_01_1_КонтрагентыДоговоры = СККР("76.01.1", СиО_КонтрагентыДоговоры);
	СККР_76_03_КонтрагентыДоговоры   = СККР("76.03", СиО_КонтрагентыДоговоры);
	СККР_76_05_КонтрагентыДоговоры   = СККР("76.05", СиО_КонтрагентыДоговоры);
	СККР_76_06_КонтрагентыДоговоры   = СККР("76.06", СиО_КонтрагентыДоговоры);
	//СККР_76_09_КонтрагентыДоговоры   = СККР("76.09", СиО_КонтрагентыДоговоры);
	СККР_76_09_КонтрагентыДоговоры   = СКК("76.09", СиО_Контрагенты); //ЮЦАУ
	СККР_76_21_КонтрагентыДоговоры   = СККР("76.21", СиО_КонтрагентыДоговоры);
	СККР_76_25_КонтрагентыДоговоры   = СККР("76.25", СиО_КонтрагентыДоговоры);
	СККР_76_26_КонтрагентыДоговоры   = СККР("76.26", СиО_КонтрагентыДоговоры);
	СККР_76_29_КонтрагентыДоговоры   = СККР("76.29", СиО_КонтрагентыДоговоры);
	СККР_76_35_КонтрагентыДоговоры   = СККР("76.35", СиО_КонтрагентыДоговоры);
	СККР_76_36_КонтрагентыДоговоры   = СККР("76.36", СиО_КонтрагентыДоговоры);
	СККР_76_39_КонтрагентыДоговоры   = СККР("76.39", СиО_КонтрагентыДоговоры);
	СККР_76_К_КонтрагентыДоговоры    = СККР("76.К", СиО_КонтрагентыДоговоры);
	СККР_76_НА_КонтрагентыДоговоры   = СККР("76.НА", СиО_КонтрагентыДоговоры);
	
	СККР_76_07_2_КонтрагентыДоговоры = СККР("76.07.2", СиО_КонтрагентыДоговоры);
	СККР_76_27_2_КонтрагентыДоговоры = СККР("76.27.2", СиО_КонтрагентыДоговоры);
	СККР_76_37_2_КонтрагентыДоговоры = СККР("76.37.2", СиО_КонтрагентыДоговоры);
	
	СККР_76_41_Контрагенты = СККР("76.41", СиО_Контрагенты);
	СККР_76_49_Контрагенты = СККР("76.49", СиО_Контрагенты);
	
	СКК_60_03   = СКК("60.03", СальдоИОборотыПоСчетам);
	СКК_62_02   = СКК("62.02", СальдоИОборотыПоСчетам);
	СКК_62_22   = СКК("62.22", СальдоИОборотыПоСчетам);
	СКК_62_32   = СКК("62.32", СальдоИОборотыПоСчетам);
	СКК_62_ОТ   = СКК("62.ОТ", СальдоИОборотыПоСчетам);
	СКК_68_04_2 = СКК("68.04.2", СальдоИОборотыПоСчетам);
	СКК_68_32   = СКК("68.32", СальдоИОборотыПоСчетам);
	СКК_68_42   = СКК("68.42", СальдоИОборотыПоСчетам);
	СККР_69_13  = СККР("69.13", СальдоИОборотыПоСчетам);
	СКК_75_01   = СКК("75.01", СальдоИОборотыПоСчетам);
	СКК_75_02   = СКК("75.02", СальдоИОборотыПоСчетам);
	СКК_76_04   = СКК("76.04", СальдоИОборотыПоСчетам);
	СКК_76_Н    = СКК("76.Н", СальдоИОборотыПоСчетам);
	СКД_76_АВ   = 0; //СКД("76.АВ", СальдоИОборотыПоСчетам); //ЮЦАУ
	
	ЗначениеПоказателя = СККР_60_01_КонтрагентыДоговоры + СККР_60_21_КонтрагентыДоговоры + СККР_60_31_КонтрагентыДоговоры + СКК_60_03
	+ СКК_62_02 + СККР_62_01_КонтрагентыДоговоры + СКК_62_22 + СККР_62_21_КонтрагентыДоговоры + СКК_62_32 + СККР_62_31_КонтрагентыДоговоры + СКК_62_ОТ
	- ?(СтрокаОтраженияСчета76_АВ = "1520", СКД_76_АВ, 0)
	+ СККР_68_01_ВидыПлатежей + СККР_68_02_ВидыПлатежей + СККР_68_03_ВидыПлатежей
	+ СККР_68_04_1_ВидыПлатежейУровни + СКК_68_04_2
	+ СККР_68_06_ВидыПлатежей + СККР_68_07_ВидыПлатежей + СККР_68_08_ВидыПлатежей + СККР_68_09_ВидыПлатежей
	+ СККР_68_10_ВидыПлатежейУровни
	+ СККР_68_11_ВидыПлатежей + СККР_68_12_ВидыПлатежей + СККР_68_13_ВидыПлатежей
	+ ?(ЭтоИП, СККР_68_14_ВидыПлатежей, 0)
	+ ?(С2018, СККР_68_34_ВидыПлатежей, 0)
	+ ?(С2018, СККР_68_52_ВидыПлатежей, 0)
	+ ?(ЭтоИП, СККР_68_21_ВидыПлатежей, 0)
	+ СКК_68_32 + СКК_68_42
	+ СККР_69_01_ВидыПлатежей
	//+ СККР_69_02_1_ВидыПлатежей + СККР_69_02_2_ВидыПлатежей + СККР_69_02_3_ВидыПлатежей + СККР_69_02_4_ВидыПлатежей + СККР_69_02_5_ВидыПлатежей + СККР_69_02_6_ВидыПлатежей + СККР_69_02_7_ВидыПлатежей
	//+ СККР_69_03_1_ВидыПлатежей + СККР_69_03_2_ВидыПлатежей
	//+ СККР_69_04_ВидыПлатежей
	//+ СККР_69_05_1_ВидыПлатежей + СККР_69_05_2_ВидыПлатежей
	//+ СККР_69_06_1_ВидыПлатежей + СККР_69_06_2_ВидыПлатежей + СККР_69_06_3_ВидыПлатежей + СККР_69_06_4_ВидыПлатежей + СККР_69_06_5_ВидыПлатежей
	//+ СККР_69_11_ВидыПлатежей + СККР_69_12_ВидыПлатежей  //ЮЦАУ
	+ СККР_69_13
	+ СККР_70_Работники
	+ СККР_71_Работники
	+ СККР_73_03_Работники
	+ СКК_75_02
	+ СККР_76_05_КонтрагентыДоговоры + СККР_76_25_КонтрагентыДоговоры + СККР_76_35_КонтрагентыДоговоры
	+ СККР_76_06_КонтрагентыДоговоры + СККР_76_26_КонтрагентыДоговоры + СККР_76_36_КонтрагентыДоговоры
	+ СККР_76_01_1_КонтрагентыДоговоры + СККР_76_21_КонтрагентыДоговоры + СККР_76_03_КонтрагентыДоговоры
	+ СКК_76_04
	+ СККР_76_09_КонтрагентыДоговоры + СККР_76_29_КонтрагентыДоговоры + СККР_76_39_КонтрагентыДоговоры
	+ СККР_76_10_Работники
	+ СККР_76_41_Контрагенты + СККР_76_49_Контрагенты
	+ СККР_76_07_2_КонтрагентыДоговоры + СККР_76_27_2_КонтрагентыДоговоры + СККР_76_37_2_КонтрагентыДоговоры
	+ СККР_76_К_КонтрагентыДоговоры + СКК_76_Н + СККР_68_05_ВидыПлатежей; //ЮЦАУ Добавил СККР_68_05_ВидыПлатежей
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Положительное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СККР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СККР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СККР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("60.03").Код, СКК_60_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.02").Код, СКК_62_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СККР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.22").Код, СКК_62_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СККР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.32").Код, СКК_62_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СККР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.ОТ").Код, СКК_62_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.ОТ")));
	Если СтрокаОтраженияСчета76_АВ = "1520" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("76.АВ").Код, -СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.04.2").Код, СКК_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
	КонецЕсли;
	Если С2018 Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.32").Код, СКК_68_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.42").Код, СКК_68_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.42")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СККР " + Счет("69.13").Код, СККР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	
	Если УчетНа70ВедетсяСводно Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("70").Код, СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
	Иначе
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 70, развернутое по субконто ""Работники организации""", СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 71, развернутое по субконто ""Работники организации""", СККР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 73.03, развернутое по субконто ""Работники организации""", СККР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("75.02").Код, СКК_75_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.02")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.04").Код, СКК_76_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.10, развернутое по субконто ""Работники организации""", СККР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.41, развернутое по субконто ""Контрагенты""", СККР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.49, развернутое по субконто ""Контрагенты""", СККР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.Н").Код, СКК_76_Н, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.Н")));
	
	НомерВРасшифровке = 15201;
	
	НомерСтроки = "15201";
	НаименованиеСтроки = "Расчеты с поставщиками и подрядчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_60_01_КонтрагентыДоговоры + СККР_60_21_КонтрагентыДоговоры + СККР_60_31_КонтрагентыДоговоры + СКК_60_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Положительное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СККР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СККР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СККР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("60.03").Код, СКК_60_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.03")));
	КонецЕсли;
	
	НомерСтроки = "15202";
	НаименованиеСтроки = "Расчеты с покупателями и заказчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_62_02 + СККР_62_01_КонтрагентыДоговоры
		+ СКК_62_22 + СККР_62_21_КонтрагентыДоговоры
		+ СКК_62_32 + СККР_62_31_КонтрагентыДоговоры
		+ СКК_62_ОТ
		- ?(СтрокаОтраженияСчета76_АВ = "1520", СКД_76_АВ, 0);
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("62.02").Код, СКК_62_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СККР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.22").Код, СКК_62_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СККР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.32").Код, СКК_62_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СККР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.ОТ").Код, СКК_62_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.ОТ")));
		Если СтрокаОтраженияСчета76_АВ = "1520" Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("76.АВ").Код, -СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "15203";
	НаименованиеСтроки = "Расчеты по налогам и сборам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_68_01_ВидыПлатежей + СККР_68_02_ВидыПлатежей + СККР_68_03_ВидыПлатежей
		+ СККР_68_04_1_ВидыПлатежейУровни + СКК_68_04_2
		+ СККР_68_06_ВидыПлатежей + СККР_68_07_ВидыПлатежей + СККР_68_08_ВидыПлатежей + СККР_68_09_ВидыПлатежей
		+ СККР_68_10_ВидыПлатежейУровни
		+ СККР_68_11_ВидыПлатежей + СККР_68_12_ВидыПлатежей + СККР_68_13_ВидыПлатежей
		+ ?(ЭтоИП, СККР_68_14_ВидыПлатежей, 0)
		+ ?(С2018, СККР_68_34_ВидыПлатежей, 0)
		+ ?(С2018, СККР_68_52_ВидыПлатежей, 0)
		+ ?(ЭтоИП, СККР_68_21_ВидыПлатежей, 0)
		+ СКК_68_32 + СКК_68_42;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
		КонецЕсли;
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.04.2").Код, СКК_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
		КонецЕсли;
		Если С2018 Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
		КонецЕсли;
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.32").Код, СКК_68_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.42").Код, СКК_68_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.42")));
	КонецЕсли;
	
	НомерСтроки = "15204";
	НаименованиеСтроки = "Расчеты по социальному страхованию и обеспечению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_69_01_ВидыПлатежей
		+ СККР_69_02_1_ВидыПлатежей + СККР_69_02_2_ВидыПлатежей + СККР_69_02_3_ВидыПлатежей + СККР_69_02_4_ВидыПлатежей + СККР_69_02_5_ВидыПлатежей + СККР_69_02_6_ВидыПлатежей + СККР_69_02_7_ВидыПлатежей
		+ СККР_69_03_1_ВидыПлатежей + СККР_69_03_2_ВидыПлатежей
		+ СККР_69_04_ВидыПлатежей
		+ СККР_69_05_1_ВидыПлатежей + СККР_69_05_2_ВидыПлатежей
		+ СККР_69_06_1_ВидыПлатежей + СККР_69_06_2_ВидыПлатежей + СККР_69_06_3_ВидыПлатежей + СККР_69_06_4_ВидыПлатежей + СККР_69_06_5_ВидыПлатежей
		+ СККР_69_11_ВидыПлатежей + СККР_69_12_ВидыПлатежей
		+ СККР_69_13;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СККР " + Счет("69.13").Код, СККР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	КонецЕсли;
	
	НомерСтроки = "15205";
	НаименованиеСтроки = "Расчеты с персоналом по оплате труда";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_70_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		Если УчетНа70ВедетсяСводно Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("70").Код, СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
		Иначе
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 70, развернутое по субконто ""Работники организации""", СККР_70_Работники,  ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "15206";
	НаименованиеСтроки = "Расчеты с подотчетными лицами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_71_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 71, развернутое по субконто ""Работники организации""", СККР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	КонецЕсли;
	
	НомерСтроки = "15209";
	НаименованиеСтроки = "Расчеты с персоналом по прочим операциям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_73_03_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 73.03, развернутое по субконто ""Работники организации""", СККР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	КонецЕсли;
	
	НомерСтроки = "15207";
	НаименованиеСтроки = "Задолженность участникам (учредителям) по выплате доходов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_75_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("75.02").Код, СКК_75_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.02")));
	КонецЕсли;
	
	НомерСтроки = "15208";
	НаименованиеСтроки = "Расчеты с разными дебиторами и кредиторами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_76_05_КонтрагентыДоговоры + СККР_76_25_КонтрагентыДоговоры + СККР_76_35_КонтрагентыДоговоры
		+ СККР_76_06_КонтрагентыДоговоры + СККР_76_26_КонтрагентыДоговоры + СККР_76_36_КонтрагентыДоговоры
		+ СККР_76_01_1_КонтрагентыДоговоры + СККР_76_21_КонтрагентыДоговоры + СККР_76_03_КонтрагентыДоговоры + СКК_76_04
		+ СККР_76_09_КонтрагентыДоговоры + СККР_76_29_КонтрагентыДоговоры + СККР_76_39_КонтрагентыДоговоры
		+ СККР_76_10_Работники
		+ СККР_76_41_Контрагенты + СККР_76_49_Контрагенты
		+ СККР_76_К_КонтрагентыДоговоры + СКК_76_Н;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.04").Код, СКК_76_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.10, развернутое по субконто ""Работники организации""", СККР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.41, развернутое по субконто ""Контрагенты""", СККР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.49, развернутое по субконто ""Контрагенты""", СККР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.Н").Код, СКК_76_Н, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.Н")));
	КонецЕсли;
	
	НомерСтроки = "1530";
	НаименованиеСтроки = "Доходы будущих периодов";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_86    = СКК("86", СальдоИОборотыПоСчетам);
	СКК_98    = СКК("98", СальдоИОборотыПоСчетам);
	СКК_98_01 = СКК("98.01", СальдоИОборотыПоСчетам);
	СКК_98_02 = СКК("98.02", СальдоИОборотыПоСчетам);
	СКК_98_03 = СКК("98.03", СальдоИОборотыПоСчетам);
	СКК_98_04 = СКК("98.04", СальдоИОборотыПоСчетам);
	
	НомерВРасшифровке = 15301;
	
	Если ИдентификаторАвтозаполнения = "БалансНКО"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "БалансНКО_2012Кв4_3" Тогда
		
		ЗначениеПоказателя = СКК_98;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98").Код, СКК_98, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98")));
		
	ИначеЕсли ИдентификаторАвтозаполнения = "Баланс"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв1"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_2"
		ИЛИ ИдентификаторАвтозаполнения = "Баланс_2012Кв4_3" Тогда
		
		ЗначениеПоказателя = СКК_86 + СКК_98;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("86").Код, СКК_86, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("86")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("98").Код, СКК_98, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98")));
		
		НомерСтроки = "15301";
		НаименованиеСтроки = "Целевое финансирование";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКК_86;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("86").Код, СКК_86, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("86")));
		КонецЕсли;
		
	Иначе
		ЗаписьЖурналаРегистрации("Заполнение бухгалтерской отчетности", УровеньЖурналаРегистрации.Ошибка, , , "Переданный идентификатор автозаполнения бухгалтерского баланса - """ + ИдентификаторАвтозаполнения + """");
		ВызватьИсключение "Неизвестный идентификатор алгоритма автозаполнения бухгалтерского баланса";
	КонецЕсли;
	
	НомерСтроки = "15302";
	НаименованиеСтроки = "Доходы, полученные в счет будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.01").Код, СКК_98_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.01")));
	КонецЕсли;
	
	НомерСтроки = "15303";
	НаименованиеСтроки = "Безвозмездные поступления";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.02").Код, СКК_98_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.02")));
	КонецЕсли;
	
	НомерСтроки = "15304";
	НаименованиеСтроки = "Предстоящие поступления по недостачам, выявленным за прошлые годы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.03").Код, СКК_98_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.03")));
	КонецЕсли;
	
	НомерСтроки = "15305";
	НаименованиеСтроки = "Разница между суммой, подлежащей взысканию с виновных лиц, и балансовой стоимостью по недостачам ценностей";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.04").Код, СКК_98_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.04")));
	КонецЕсли;
	
	НомерСтроки = "1540";
	НаименованиеСтроки = "Оценочные обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СККР_96_09_Резервы = СККР("96.09", СиО_Резервы);
	СКК_96_01 = СКК("96.01", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СККР_96_09_Резервы + СКК_96_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СККР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("96.01").Код, СКК_96_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("96.01")));
	
	НомерВРасшифровке = 15401;
	
	НомерСтроки = "15401";
	НаименованиеСтроки = "Оценочные обязательства по вознаграждениям работников";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_96_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("96.01").Код, СКК_96_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("96.01")));
	КонецЕсли;
	
	НомерСтроки = "15402";
	НаименованиеСтроки = "Резервы предстоящих расходов прочие";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_96_09_Резервы;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СККР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	КонецЕсли;
	
	НомерСтроки = "1550";
	НаименованиеСтроки = "Прочие обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_76_ВА = СКК("76.ВА", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = ?(СтрокаОтраженияСчета76_ВА = "1550", СКК_76_ВА, 0) + СККР_76_НА_КонтрагентыДоговоры;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	Если СтрокаОтраженияСчета76_ВА = "1550" Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("76.ВА").Код, СКК_76_ВА, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ВА")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, , "+", "Сальдо на конец периода по кредиту счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	Иначе
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	КонецЕсли;
	
КонецПроцедуры

&Вместо("УчетНа70ВедетсяСводно")
Функция Расш1_УчетНа70ВедетсяСводно()
	Возврат Истина; 
КонецФункции

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел1")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел1(КонтекстВыполнения)
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	ДополнительныеПараметрыРасшифровки = Новый Структура("Организация", Организация);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	РазделенноеСальдоСчета_02_01 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_01(КонецПериодаОтчета, Организация);
	
	СтруктураСКД_97      = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_97(КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_2 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.2"), КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_9 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.9"), КонецПериодаОтчета, Организация);
	
	НомерСтроки = "1110";
	НаименованиеСтроки = "Нематериальные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_04_01 = СКД("04.01", СальдоИОборотыПоСчетам);
	СКК_05    = СКК("05", СальдоИОборотыПоСчетам);
	СКД_08_05 = СКД("08.05", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_04_01 - СКК_05 + СКД_08_05;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+","!СКД " + Счет("04.01").Код, СКД_04_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("05").Код, -СКК_05 ,ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.05").Код, СКД_08_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.05")));
	
	НомерВРасшифровке = 11101;
	
	НомерСтроки = "11101";
	НаименованиеСтроки = "Нематериальные активы в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_04_01 - СКК_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.01").Код, СКД_04_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("05").Код, -СКК_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("05")));
	КонецЕсли;
	
	НомерСтроки = "11102";
	НаименованиеСтроки = "Приобретение нематериальных активов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.05").Код, СКД_08_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.05")));
	КонецЕсли;
	
	НомерСтроки = "1120";
	НаименованиеСтроки = "Результаты исследований и разработок";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_04_02 = СКД("04.02", СальдоИОборотыПоСчетам);
	СКД_08_08 = СКД("08.08", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_04_02 + СКД_08_08;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.02").Код, СКД_04_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+","!СКД " + Счет("08.08").Код, СКД_08_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.08")));
	
	НомерВРасшифровке = 11201;
	
	НомерСтроки = "11201";
	НаименованиеСтроки = "Расходы на научно-исследовательские, опытно-конструкторские и технологические работы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_04_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("04.02").Код, СКД_04_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("04.02")));
	КонецЕсли;
	
	НомерСтроки = "11202";
	НаименованиеСтроки = "Выполнение научно-исследовательских, опытно-конструкторских и технологических работ";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.08").Код, СКД_08_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.08")));
	КонецЕсли;
	
	НомерСтроки = "1130";
	НаименованиеСтроки = "Нематериальные поисковые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_11 = СКД("08.11", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_08_11;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.11").Код, СКД_08_11, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.11")));
	
	НомерСтроки = "1140";
	НаименованиеСтроки = "Материальные поисковые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_12 = СКД("08.12", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_08_12;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.12").Код, СКД_08_12, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.12")));
	
	НомерСтроки = "1150";
	НаименованиеСтроки = "Основные средства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_01    = СКД("01", СальдоИОборотыПоСчетам);
	СКД_01_01 = СКД("01.01", СальдоИОборотыПоСчетам);
	СКД_01_03 = СКД("01.03", СальдоИОборотыПоСчетам);
	СКД_01_08 = СКД("01.08", СальдоИОборотыПоСчетам);
	СКК_02_01 = СКК("02.01", СальдоИОборотыПоСчетам);
	СКК_02_03 = СКК("02.03", СальдоИОборотыПоСчетам);
	СКД_07    = СКД("07", СальдоИОборотыПоСчетам);
	СКД_08_01 = СКД("08.01", СальдоИОборотыПоСчетам);
	СКД_08_02 = СКД("08.02", СальдоИОборотыПоСчетам);
	СКД_08_03 = СКД("08.03", СальдоИОборотыПоСчетам);
	СКД_08_04 = СКД("08.04", СальдоИОборотыПоСчетам);
	
	СКК_02_01__01_01 = РазделенноеСальдоСчета_02_01.СКК_02_01__01_01; // Амортизация ОС, учитываемых на счете 01.01
	СКК_02_01__01_08 = РазделенноеСальдоСчета_02_01.СКК_02_01__01_08; // Амортизация ОС, учитываемых на счете 01.08
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ОсновныеСредства;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_01 - СКК_02_01 - СКК_02_03
	                   + СКД_07
	                   + СКД_08_01 + СКД_08_02 + СКД_08_03 + СКД_08_04
	                   + СКД_97_ПоВидуАктива
	                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01").Код, СКД_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.01").Код, -СКК_02_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.03").Код, -СКК_02_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("07").Код, СКД_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.01").Код, СКД_08_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.02").Код, СКД_08_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.03").Код, СКД_08_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.04").Код, СКД_08_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.04")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 11501;
	
	НомерСтроки = "11501";
	НаименованиеСтроки = "Основные средства в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_01 - СКК_02_01__01_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.01").Код, СКД_01_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.01 в части ОС в организации", -СКК_02_01__01_01, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11502";
	НаименованиеСтроки = "Объекты недвижимости, права собственности на которые не зарегистрированы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_08 - СКК_02_01__01_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.08").Код, СКД_01_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.01 в части объектов недвижимости на которые не зарегистрированы права собственности", -СКК_02_01__01_08, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11503";
	НаименованиеСтроки = "Оборудование к установке";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("07").Код, СКД_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("07")));
	КонецЕсли;
	
	НомерСтроки = "11504";
	НаименованиеСтроки = "Приобретение земельных участков";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.01").Код, СКД_08_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.01")));
	КонецЕсли;
	
	НомерСтроки = "11505";
	НаименованиеСтроки = "Приобретение объектов природопользования";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.02").Код, СКД_08_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.02")));
	КонецЕсли;
	
	НомерСтроки = "11506";
	НаименованиеСтроки = "Строительство объектов основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.03").Код, СКД_08_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.03")));
	КонецЕсли;
	
	НомерСтроки = "11507";
	НаименованиеСтроки = "Приобретение объектов основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.04").Код, СКД_08_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.04")));
	КонецЕсли;
	
	НомерСтроки = "11508";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "11509";
	НаименованиеСтроки = "Основные средства в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_01_03 - СКК_02_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("01.03").Код, СКД_01_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("01.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.03").Код, -СКК_02_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.03")));
	КонецЕсли;
	
	НомерСтроки = "1160";
	НаименованиеСтроки = "Доходные вложения в материальные ценности";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_02_02 = СКК("02.02", СальдоИОборотыПоСчетам);
	СКД_03    = СКД("03", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_03 - СКК_02_02;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03").Код, СКД_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("02.02").Код, -СКК_02_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("02.02")));
	
	НомерВРасшифровке = 11601;
	
	РазделенноеСальдоСчета_02_02 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_02(КонецПериодаОтчета, Организация);
	СКК_02_02__03_01 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_01; // Амортизация ОС, учитываемых на счете 03.01
	СКК_02_02__03_02 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_02; // Амортизация ОС, учитываемых на счете 03.02
	СКК_02_02__03_03 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_03; // Амортизация ОС, учитываемых на счете 03.03
	СКК_02_02__03_04 = РазделенноеСальдоСчета_02_02.СКК_02_02__03_04; // Амортизация ОС, учитываемых на счете 03.04
	
	СКД_03_01 = СКД("03.01", СальдоИОборотыПоСчетам);
	СКД_03_02 = СКД("03.02", СальдоИОборотыПоСчетам);
	СКД_03_03 = СКД("03.03", СальдоИОборотыПоСчетам);
	СКД_03_04 = СКД("03.04", СальдоИОборотыПоСчетам);
	
	НомерСтроки = "11601";
	НаименованиеСтроки = "Материальные ценности в организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_01 - СКК_02_02__03_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.01").Код, СКД_03_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.01", -СКК_02_02__03_01, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11602";
	НаименованиеСтроки = "Материальные ценности предоставленные во временное владение и пользование";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_02 - СКК_02_02__03_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.02").Код, СКД_03_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.02", -СКК_02_02__03_02, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11603";
	НаименованиеСтроки = "Материальные ценности предоставленные во временное пользование";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_03 - СКК_02_02__03_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.03").Код, СКД_03_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.03", -СКК_02_02__03_03, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "11604";
	НаименованиеСтроки = "Прочие доходные вложения";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_03_04 - СКК_02_02__03_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("03.04").Код, СКД_03_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("03.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "Сальдо на конец периода по кредиту счета 02.02 в части объектов по счету 03.04", -СКК_02_02__03_04, ИмяРаздела, ДополнительныеПараметрыРасшифровки);
	КонецЕсли;
	
	НомерСтроки = "1170";
	НаименованиеСтроки = "Финансовые вложения";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_58_01_1 = СКД("58.01.1", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_58_01_1;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.1").Код, СКД_58_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.1")));
	
	НомерВРасшифровке = 11701;
	
	НомерСтроки = "11701";
	НаименованиеСтроки = "Паи";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_01_1;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.1").Код, СКД_58_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.1")));
	КонецЕсли;
	
	НомерСтроки = "1180";
	НаименованиеСтроки = "Отложенные налоговые активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_09 = СКД("09", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_09;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("09").Код, СКД_09, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("09")));
	
	НомерСтроки = "1190";
	НаименованиеСтроки = "Прочие внеоборотные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_08_06 = СКД("08.06", СальдоИОборотыПоСчетам);
	СКД_08_07 = СКД("08.07", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеВнеоборотныеАктивы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_08_06 + СКД_08_07
	                   + СКД_97_ПоВидуАктива
	                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.06").Код, СКД_08_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("08.07").Код, СКД_08_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.07")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 11901;
	
	НомерСтроки = "11901";
	НаименованиеСтроки = "Перевод молодняка животных в основное стадо";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_06;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.06").Код, СКД_08_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.06")));
	КонецЕсли;
	
	НомерСтроки = "11902";
	НаименованиеСтроки = "Приобретение взрослых животных";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_08_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("08.07").Код, СКД_08_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("08.07")));
	КонецЕсли;
	
	НомерСтроки = "11903";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел2")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел2(КонтекстВыполнения)
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	УчетНа70ВедетсяСводно = КонтекстВыполнения.УчетНа70ВедетсяСводно;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	СиО_Контрагенты = КонтекстВыполнения.РассчитанныеПараметры.СиО_Контрагенты;
	СиО_КонтрагентыДоговоры = КонтекстВыполнения.РассчитанныеПараметры.СиО_КонтрагентыДоговоры;
	
	СиО_ВидыПлатежей = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежей;
	СиО_ВидыПлатежейУровниБюджетов = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежейУровниБюджетов;
	
	СиО_Работники = КонтекстВыполнения.РассчитанныеПараметры.СиО_Работники;
	СиО_Резервы = КонтекстВыполнения.РассчитанныеПараметры.СиО_Резервы;
	
	ИдентификаторАвтозаполнения = КонтекстВыполнения.СтруктураОтчета.Баланс.ИдентификаторАвтозаполнения;
	ЭтоИП = НЕ РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	
	РазделенноеСальдоСчета_02_01 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_02_01(КонецПериодаОтчета, Организация);
	
	СтруктураСКД_97      = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_97(КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_2 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.2"), КонецПериодаОтчета, Организация);
	СтруктураСКД_76_01_9 = ЗаполнениеБухгалтерскойОтчетностиИтоги.РазделенноеСальдоСчета_76(Счет("76.01.9"), КонецПериодаОтчета, Организация);
	
	УчетС2018 = (КонецПериодаОтчета >= '2018-01-01');
	
	НомерСтроки = "1210";
	НаименованиеСтроки = "Запасы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_10    = СКД("10", СальдоИОборотыПоСчетам);
	СКД_11    = СКД("11", СальдоИОборотыПоСчетам);
	СКК_14_01 = СКК("14.01", СальдоИОборотыПоСчетам);
	СКК_14_02 = СКК("14.02", СальдоИОборотыПоСчетам);
	СКК_14_03 = СКК("14.03", СальдоИОборотыПоСчетам);
	СКК_14_04 = СКК("14.04", СальдоИОборотыПоСчетам);
	СКД_15_01 = СКД("15.01", СальдоИОборотыПоСчетам);
	СКД_15_02 = СКД("15.02", СальдоИОборотыПоСчетам);
	СКК_16_01 = СКК("16.01", СальдоИОборотыПоСчетам);
	СКД_16_01 = СКД("16.01", СальдоИОборотыПоСчетам);
	СКК_16_02 = СКК("16.02", СальдоИОборотыПоСчетам);
	СКД_16_02 = СКД("16.02", СальдоИОборотыПоСчетам);
	СКД_20    = СКД("20", СальдоИОборотыПоСчетам);
	СКД_21    = СКД("21", СальдоИОборотыПоСчетам);
	СКД_23    = СКД("23", СальдоИОборотыПоСчетам);
	СКД_28    = СКД("28", СальдоИОборотыПоСчетам);
	СКД_29    = СКД("29", СальдоИОборотыПоСчетам);
	СКД_41    = СКД("41", СальдоИОборотыПоСчетам);
	СКК_42    = СКК("42", СальдоИОборотыПоСчетам);
	СКД_43    = СКД("43", СальдоИОборотыПоСчетам);
	СКД_44    = СКД("44", СальдоИОборотыПоСчетам);
	СКД_45    = СКД("45", СальдоИОборотыПоСчетам);
	СКД_46    = СКД("46", СальдоИОборотыПоСчетам);
	СКК_76_ВА = СКК("76.ВА", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.Запасы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_10 - СКК_14_01 + СКД_15_01 + СКД_16_01 - СКК_16_01
	                   + СКД_11 + СКД_20 + СКД_21 + СКД_23 + СКД_29 + СКД_44
	                   - СКК_14_04 + СКД_43 - СКК_14_03 + СКД_41 - СКК_14_02
	                   + СКД_15_02 + СКД_16_02 - СКК_16_02 - СКК_42 + СКД_45 + СКД_28
	                   + СКД_97_ПоВидуАктива
	                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("10").Код, СКД_10, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.01").Код, -СКК_14_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.01").Код, СКД_15_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.01").Код, СКД_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.01").Код, -СКК_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("11").Код, СКД_11, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("20").Код, СКД_20, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("20")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("21").Код, СКД_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("23").Код, СКД_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("23")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("29").Код, СКД_29, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("44").Код, СКД_44, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("44")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.04").Код, -СКК_14_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("43").Код, СКД_43, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("43")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.03").Код, -СКК_14_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("41").Код, СКД_41, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.02").Код, -СКК_14_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.02").Код, СКД_15_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.02").Код, СКД_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.02").Код, -СКК_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("42").Код, -СКК_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("42")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("45").Код, СКД_45, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("45")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("28").Код, СКД_28, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("28")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	НомерВРасшифровке = 12101;
	
	НомерСтроки = "12101";
	НаименованиеСтроки = "Материалы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_10 - СКК_14_01 + СКД_15_01 + СКД_16_01 - СКК_16_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("10").Код, СКД_10, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.01").Код, -СКК_14_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.01").Код, СКД_15_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.01").Код, СКД_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.01").Код, -СКК_16_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.01")));
	КонецЕсли;
	
	НомерСтроки = "12102";
	НаименованиеСтроки = "Брак в производстве";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_28;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("28").Код, СКД_28, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("28")));
	КонецЕсли;
	
	НомерСтроки = "12103";
	НаименованиеСтроки = "Товары отгруженные";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_45;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("45").Код, СКД_45, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("45")));
	КонецЕсли;
	
	НомерСтроки = "12104";
	НаименованиеСтроки = "Товары";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_41 - СКК_14_02 + СКД_15_02 + СКД_16_02 - СКК_16_02 - СКК_42;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("41").Код, СКД_41, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.02").Код, -СКК_14_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("15.02").Код, СКД_15_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("15.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("16.02").Код, СКД_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("16.02").Код, -СКК_16_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("16.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("42").Код, -СКК_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("42")));
	КонецЕсли;
	
	НомерСтроки = "12105";
	НаименованиеСтроки = "Готовая продукция";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_43 - СКК_14_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("43").Код, СКД_43, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("43")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.03").Код, -СКК_14_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.03")));
	КонецЕсли;
	
	НомерСтроки = "12106";
	НаименованиеСтроки = "Расходы на продажу";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_44;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("44").Код, СКД_44, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("44")));
	КонецЕсли;
	
	НомерСтроки = "12108";
	НаименованиеСтроки = "Основное производство";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_20 - СКК_14_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("20").Код, СКД_20, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("20")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("14.04").Код, -СКК_14_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("14.04")));
	КонецЕсли;
	
	НомерСтроки = "12109";
	НаименованиеСтроки = "Полуфабрикаты собственного производства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("21").Код, СКД_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("21")));
	КонецЕсли;
	
	НомерСтроки = "12110";
	НаименованиеСтроки = "Вспомогательные производства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("23").Код, СКД_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("23")));
	КонецЕсли;
	
	НомерСтроки = "12111";
	НаименованиеСтроки = "Обслуживающие производства и хозяйства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_29;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("29").Код, СКД_29, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("29")));
	КонецЕсли;
	
	НомерСтроки = "12112";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "1220";
	НаименованиеСтроки = "Налог на добавленную стоимость по приобретенным ценностям";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_19    = СКД("19", СальдоИОборотыПоСчетам);
	СКД_19_01 = СКД("19.01", СальдоИОборотыПоСчетам);
	СКД_19_02 = СКД("19.02", СальдоИОборотыПоСчетам);
	СКД_19_03 = СКД("19.03", СальдоИОборотыПоСчетам);
	СКД_19_04 = СКД("19.04", СальдоИОборотыПоСчетам);
	СКД_19_05 = СКД("19.05", СальдоИОборотыПоСчетам);
	СКД_19_06 = СКД("19.06", СальдоИОборотыПоСчетам);
	СКД_19_07 = СКД("19.07", СальдоИОборотыПоСчетам);
	СКД_19_08 = СКД("19.08", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_19 - СКД_19_06;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19").Код, СКД_19, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("19.06").Код, -СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	
	НомерВРасшифровке = 12201;
	
	НомерСтроки = "12201";
	НаименованиеСтроки = "НДС по приобретенным ОС";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.01").Код, СКД_19_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.01")));
	КонецЕсли;
	
	НомерСтроки = "12202";
	НаименованиеСтроки = "НДС по приобретенным НМА";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.02").Код, СКД_19_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.02")));
	КонецЕсли;
	
	НомерСтроки = "12203";
	НаименованиеСтроки = "НДС по приобретенным материально-производственным запасам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.03").Код, СКД_19_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.03")));
	КонецЕсли;
	
	НомерСтроки = "12204";
	НаименованиеСтроки = "НДС по приобретенным услугам";
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.04").Код, СКД_19_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.04")));
	КонецЕсли;
	
	НомерСтроки = "12205";
	НаименованиеСтроки = "НДС, уплаченный при ввозе товаров на территорию РФ";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.05").Код, СКД_19_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.05")));
	КонецЕсли;
	
	НомерСтроки = "12206";
	НаименованиеСтроки = "НДС по товарам, реализованным по ставке 0% (экспорт)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_07;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.07").Код, СКД_19_07, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.07")));
	КонецЕсли;
	
	НомерСтроки = "12207";
	НаименованиеСтроки = "НДС при строительстве ОС";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_08;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("19.08").Код, СКД_19_08, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.08")));
	КонецЕсли;
	
	НомерСтроки = "1230";
	НаименованиеСтроки = "Дебиторская задолженность";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКДР_62_01_КонтрагентыДоговоры = СКДР("62.01", СиО_КонтрагентыДоговоры);
	СКДР_62_21_КонтрагентыДоговоры = СКДР("62.21", СиО_КонтрагентыДоговоры);
	СКДР_62_31_КонтрагентыДоговоры = СКДР("62.31", СиО_КонтрагентыДоговоры);
	
	СКДР_60_01_КонтрагентыДоговоры = СКДР("60.01", СиО_КонтрагентыДоговоры);
	СКДР_60_21_КонтрагентыДоговоры = СКДР("60.21", СиО_КонтрагентыДоговоры);
	СКДР_60_31_КонтрагентыДоговоры = СКДР("60.31", СиО_КонтрагентыДоговоры);
	
	СКД_60_02   = СКД("60.02", СальдоИОборотыПоСчетам);
	СКД_60_22   = СКД("60.22", СальдоИОборотыПоСчетам);
	СКД_60_32   = СКД("60.32", СальдоИОборотыПоСчетам);
	СКД_62_03   = СКД("62.03", СальдоИОборотыПоСчетам);
	СКК_63      = СКК("63", СальдоИОборотыПоСчетам);
	СКД_68_04_2 = СКД("68.04.2", СальдоИОборотыПоСчетам);
	СКДР_69_13  = СКДР("69.13", СальдоИОборотыПоСчетам);
	СКД_73_01   = СКД("73.01", СальдоИОборотыПоСчетам);
	СКД_73_02   = СКД("73.02", СальдоИОборотыПоСчетам);
	СКД_75_01   = СКД("75.01", СальдоИОборотыПоСчетам);
	
	СКД_76_02   = СКД("76.02", СальдоИОборотыПоСчетам);
	СКД_76_22   = СКД("76.22", СальдоИОборотыПоСчетам);
	СКД_76_32   = СКД("76.32", СальдоИОборотыПоСчетам);
	
	СКД_76_13   = СКД("76.13", СальдоИОборотыПоСчетам);
	СКД_76_14   = СКД("76.14", СальдоИОборотыПоСчетам);
	
	НоваяСтрока75_01 = КонтекстВыполнения.ТаблицаСведенийСчета75_01.Добавить();
	НоваяСтрока75_01.Графа = Графа;
	НоваяСтрока75_01.Сумма = СКД_75_01;
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	Если УчетНа70ВедетсяСводно Тогда
		СКДР_70_Работники = СКД("70", СальдоИОборотыПоСчетам);
	Иначе
		СКДР_70_Работники = СКДР("70", СиО_Работники);
	КонецЕсли;
	
	СКДР_71_Работники = СКДР("71", СиО_Работники);
	//СКДР_73_03_Работники = СКДР("73.03", СиО_Работники);
	СКДР_73_03_Работники = СКД("73.03", СальдоИОборотыПоСчетам); // ЮЦАУ //
	СКДР_76_10_Работники = СКДР("76.10", СиО_Работники);
	
	СКДР_68_01_ВидыПлатежей = СКДР("68.01", СиО_ВидыПлатежей);
	СКДР_68_02_ВидыПлатежей = СКДР("68.02", СиО_ВидыПлатежей);
	СКДР_68_03_ВидыПлатежей = СКДР("68.03", СиО_ВидыПлатежей);
	СКДР_68_06_ВидыПлатежей = СКДР("68.06", СиО_ВидыПлатежей);
	СКДР_68_07_ВидыПлатежей = СКДР("68.07", СиО_ВидыПлатежей);
	СКДР_68_08_ВидыПлатежей = СКДР("68.08", СиО_ВидыПлатежей);
	СКДР_68_09_ВидыПлатежей = СКДР("68.09", СиО_ВидыПлатежей);
	СКДР_68_11_ВидыПлатежей = СКДР("68.11", СиО_ВидыПлатежей);
	СКДР_68_12_ВидыПлатежей = СКДР("68.12", СиО_ВидыПлатежей);
	СКДР_68_13_ВидыПлатежей = СКДР("68.13", СиО_ВидыПлатежей);
	СКДР_68_14_ВидыПлатежей = СКДР("68.14", СиО_ВидыПлатежей);
	СКДР_68_21_ВидыПлатежей = СКДР("68.21", СиО_ВидыПлатежей);
	СКДР_68_34_ВидыПлатежей = СКДР("68.34", СиО_ВидыПлатежей);
	СКДР_68_52_ВидыПлатежей = СКДР("68.52", СиО_ВидыПлатежей);
	
	//СКДР_69_01_ВидыПлатежей   = СКДР("69.01", СиО_ВидыПлатежей);
	СКДР_69_01_ВидыПлатежей   = СКД("69.01", СальдоИОборотыПоСчетам);  //ЮЦАУ 
	
	СКДР_69_02_1_ВидыПлатежей = СКДР("69.02.1", СиО_ВидыПлатежей);
	СКДР_69_02_2_ВидыПлатежей = СКДР("69.02.2", СиО_ВидыПлатежей);
	СКДР_69_02_3_ВидыПлатежей = СКДР("69.02.3", СиО_ВидыПлатежей);
	СКДР_69_02_4_ВидыПлатежей = СКДР("69.02.4", СиО_ВидыПлатежей);
	СКДР_69_02_5_ВидыПлатежей = СКДР("69.02.5", СиО_ВидыПлатежей);
	СКДР_69_02_6_ВидыПлатежей = СКДР("69.02.6", СиО_ВидыПлатежей);
	СКДР_69_02_7_ВидыПлатежей = СКДР("69.02.7", СиО_ВидыПлатежей);
	
	СКДР_69_03_1_ВидыПлатежей = СКДР("69.03.1", СиО_ВидыПлатежей);
	СКДР_69_03_2_ВидыПлатежей = СКДР("69.03.2", СиО_ВидыПлатежей);
	
	СКДР_69_04_ВидыПлатежей   = СКДР("69.04", СиО_ВидыПлатежей);
	
	СКДР_69_05_1_ВидыПлатежей = СКДР("69.05.1", СиО_ВидыПлатежей);
	СКДР_69_05_2_ВидыПлатежей = СКДР("69.05.2", СиО_ВидыПлатежей);
	
	СКДР_69_06_1_ВидыПлатежей = СКДР("69.06.1", СиО_ВидыПлатежей);
	СКДР_69_06_2_ВидыПлатежей = СКДР("69.06.2", СиО_ВидыПлатежей);
	СКДР_69_06_3_ВидыПлатежей = СКДР("69.06.3", СиО_ВидыПлатежей);
	СКДР_69_06_4_ВидыПлатежей = СКДР("69.06.4", СиО_ВидыПлатежей);
	СКДР_69_06_5_ВидыПлатежей = СКДР("69.06.5", СиО_ВидыПлатежей);
	
	СКДР_69_11_ВидыПлатежей   = СКДР("69.11", СиО_ВидыПлатежей);
	СКДР_69_12_ВидыПлатежей   = СКДР("69.12", СиО_ВидыПлатежей);
	
	//СКДР_68_04_1_ВидыПлатежейУровни = СКДР("68.04.1", СиО_ВидыПлатежейУровниБюджетов);
	СКДР_68_04_1_ВидыПлатежейУровни = СКД("68.04.1", СальдоИОборотыПоСчетам); //ЮЦАУ 
	СКДР_68_10_ВидыПлатежейУровни   = СКДР("68.10", СиО_ВидыПлатежейУровниБюджетов);
	
	ВидыСубконтоКонтрагентыДоговоры = Новый Массив;
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	СКДР_76_01_1_КонтрагентыДоговоры = СКДР("76.01.1", СиО_КонтрагентыДоговоры);
	СКДР_76_03_КонтрагентыДоговоры   = СКДР("76.03", СиО_КонтрагентыДоговоры);
	СКДР_76_05_КонтрагентыДоговоры   = СКДР("76.05", СиО_КонтрагентыДоговоры);
	СКДР_76_06_КонтрагентыДоговоры   = СКДР("76.06", СиО_КонтрагентыДоговоры);
	//СКДР_76_09_КонтрагентыДоговоры   = СКДР("76.09", СиО_КонтрагентыДоговоры);
	СКДР_76_09_КонтрагентыДоговоры   = СКДР("76.09", СиО_Контрагенты); //ЮЦАУ
	СКДР_76_21_КонтрагентыДоговоры   = СКДР("76.21", СиО_КонтрагентыДоговоры);
	СКДР_76_25_КонтрагентыДоговоры   = СКДР("76.25", СиО_КонтрагентыДоговоры);
	СКДР_76_26_КонтрагентыДоговоры   = СКДР("76.26", СиО_КонтрагентыДоговоры);
	СКДР_76_29_КонтрагентыДоговоры   = СКДР("76.29", СиО_КонтрагентыДоговоры);
	СКДР_76_35_КонтрагентыДоговоры   = СКДР("76.35", СиО_КонтрагентыДоговоры);
	СКДР_76_36_КонтрагентыДоговоры   = СКДР("76.36", СиО_КонтрагентыДоговоры);
	СКДР_76_39_КонтрагентыДоговоры   = СКДР("76.39", СиО_КонтрагентыДоговоры);
	СКДР_76_К_КонтрагентыДоговоры    = СКДР("76.К", СиО_КонтрагентыДоговоры);
	СКДР_76_НА_КонтрагентыДоговоры   = СКДР("76.НА", СиО_КонтрагентыДоговоры);
	
	СКДР_76_07_2_КонтрагентыДоговоры = СКДР("76.07.2", СиО_КонтрагентыДоговоры);
	СКДР_76_27_2_КонтрагентыДоговоры = СКДР("76.27.2", СиО_КонтрагентыДоговоры);
	СКДР_76_37_2_КонтрагентыДоговоры = СКДР("76.37.2", СиО_КонтрагентыДоговоры);
	
	СКДР_76_41_Контрагенты = СКДР("76.41", СиО_Контрагенты);
	СКДР_76_49_Контрагенты = СКДР("76.49", СиО_Контрагенты);
	
	СКДР_96_09_Резервы = СКДР("96.09", СиО_Резервы);
	
	ЗначениеПоказателя = СКД_60_02 + СКДР_60_01_КонтрагентыДоговоры
	                   + СКД_60_22 + СКДР_60_21_КонтрагентыДоговоры
	                   + СКД_60_32 + СКДР_60_31_КонтрагентыДоговоры
	                   - СКК_76_ВА
	                   + СКД_62_03
	                   + СКДР_62_01_КонтрагентыДоговоры + СКДР_62_21_КонтрагентыДоговоры + СКДР_62_31_КонтрагентыДоговоры - СКК_63
	                   + СКДР_68_01_ВидыПлатежей + СКДР_68_02_ВидыПлатежей + СКДР_68_03_ВидыПлатежей
	                   + СКДР_68_04_1_ВидыПлатежейУровни + СКД_68_04_2
	                   + СКДР_68_06_ВидыПлатежей + СКДР_68_07_ВидыПлатежей + СКДР_68_08_ВидыПлатежей + СКДР_68_09_ВидыПлатежей
	                   + СКДР_68_10_ВидыПлатежейУровни
	                   + СКДР_68_11_ВидыПлатежей + СКДР_68_12_ВидыПлатежей + СКДР_68_13_ВидыПлатежей
	                   + СКДР_69_01_ВидыПлатежей
					   //+ СКДР_69_02_1_ВидыПлатежей + СКДР_69_02_2_ВидыПлатежей + СКДР_69_02_3_ВидыПлатежей + СКДР_69_02_4_ВидыПлатежей + СКДР_69_02_5_ВидыПлатежей + СКДР_69_02_6_ВидыПлатежей + СКДР_69_02_7_ВидыПлатежей
					   //+ СКДР_69_03_1_ВидыПлатежей + СКДР_69_03_2_ВидыПлатежей
					   //+ СКДР_69_04_ВидыПлатежей
					   //+ СКДР_69_05_1_ВидыПлатежей + СКДР_69_05_2_ВидыПлатежей
					   //+ СКДР_69_06_1_ВидыПлатежей + СКДР_69_06_2_ВидыПлатежей + СКДР_69_06_3_ВидыПлатежей + СКДР_69_06_4_ВидыПлатежей + СКДР_69_06_5_ВидыПлатежей
					   //+ СКДР_69_11_ВидыПлатежей + СКДР_69_12_ВидыПлатежей //ЮЦАУ
	                   + ?(ЭтоИП, СКДР_68_21_ВидыПлатежей, 0)
	                   + СКДР_69_13
	                   + ?(ЭтоИП, СКДР_68_14_ВидыПлатежей, 0)
	                   + ?(УчетС2018, СКДР_68_34_ВидыПлатежей, 0)
	                   + ?(УчетС2018, СКДР_68_52_ВидыПлатежей, 0)
	                   + СКДР_70_Работники
	                   + СКДР_71_Работники
	                   + СКД_73_01 + СКД_73_02 + СКДР_73_03_Работники
	                   + СКД_75_01
	                   + СКДР_76_01_1_КонтрагентыДоговоры + СКДР_76_21_КонтрагентыДоговоры + СКД_76_02 + СКД_76_22 + СКДР_76_03_КонтрагентыДоговоры + СКД_76_32 + СКДР_76_05_КонтрагентыДоговоры
	                   + СКДР_76_10_Работники
	                   + СКДР_76_25_КонтрагентыДоговоры + СКДР_76_35_КонтрагентыДоговоры + СКДР_76_09_КонтрагентыДоговоры + СКДР_76_29_КонтрагентыДоговоры + СКДР_76_39_КонтрагентыДоговоры
	                   + СКДР_76_41_Контрагенты + СКДР_76_49_Контрагенты
	                   + СКДР_76_06_КонтрагентыДоговоры + СКДР_76_26_КонтрагентыДоговоры + СКДР_76_36_КонтрагентыДоговоры + СКДР_76_К_КонтрагентыДоговоры
	                   + СКДР_76_07_2_КонтрагентыДоговоры + СКДР_76_27_2_КонтрагентыДоговоры + СКДР_76_37_2_КонтрагентыДоговоры
	                   + СКД_76_13 + СКД_76_14
	                   + СКД_97_ПоВидуАктива
	                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива
	                   + СКДР_96_09_Резервы
	                   + СКД_46;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("60.02").Код, СКД_60_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.22").Код, СКД_60_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.32").Код, СКД_60_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("76.ВА").Код, -СКК_76_ВА, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ВА")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("62.03").Код, СКД_62_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("63").Код, -СКК_63, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("63")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("68.04.2").Код, СКД_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
	КонецЕсли;
	Если УчетС2018 Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКДР " + Счет("69.13").Код, СКДР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	
	Если УчетНа70ВедетсяСводно Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("70").Код, СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
	Иначе
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 70, развернутое по субконто ""Работники организации""", СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 71, развернутое по субконто ""Работники организации""", СКДР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.01").Код, СКД_73_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.02").Код, СКД_73_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета " + Счет("73.03").Код + ", развернутое по субконто ""Работники организации""", СКДР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("75.01").Код, СКД_75_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.02").Код, СКД_76_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.22").Код, СКД_76_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.32").Код, СКД_76_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.10, развернутое по субконто ""Работники организации""", СКДР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.41, развернутое по субконто ""Контрагенты""", СКДР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.49, развернутое по субконто ""Контрагенты""", СКДР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.13").Код, СКД_76_13, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.13")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.14").Код, СКД_76_14, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.14")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
	
	НомерВРасшифровке = 12301;
	
	НомерСтроки = "12301";
	НаименованиеСтроки = "Расчеты с поставщиками и подрядчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_60_02 + СКДР_60_01_КонтрагентыДоговоры
		                   + СКД_60_22 + СКДР_60_21_КонтрагентыДоговоры
		                   + СКД_60_32 + СКДР_60_31_КонтрагентыДоговоры
		                   - СКК_76_ВА;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("60.02").Код, СКД_60_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.22").Код, СКД_60_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("60.32").Код, СКД_60_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККОтрицательное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("76.ВА").Код, -СКК_76_ВА, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ВА")));
	КонецЕсли;
	
	НомерСтроки = "12302";
	НаименованиеСтроки = "Расчеты с покупателями и заказчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_62_03 + СКДР_62_01_КонтрагентыДоговоры
		                   + СКДР_62_21_КонтрагентыДоговоры + СКДР_62_31_КонтрагентыДоговоры
		                   - СКК_63;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("62.03").Код, СКД_62_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СКДР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДПоложительное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК" + Счет("63").Код, -СКК_63, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("63")));
	КонецЕсли;
	
	НомерСтроки = "12303";
	НаименованиеСтроки = "Расчеты по налогам и сборам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_68_01_ВидыПлатежей + СКДР_68_02_ВидыПлатежей + СКДР_68_03_ВидыПлатежей
		                   + СКДР_68_04_1_ВидыПлатежейУровни + СКД_68_04_2
		                   + СКДР_68_06_ВидыПлатежей + СКДР_68_07_ВидыПлатежей + СКДР_68_08_ВидыПлатежей + СКДР_68_09_ВидыПлатежей
		                   + СКДР_68_10_ВидыПлатежейУровни
		                   + СКДР_68_11_ВидыПлатежей + СКДР_68_12_ВидыПлатежей + СКДР_68_13_ВидыПлатежей
		                   + ?(ЭтоИП, СКДР_68_14_ВидыПлатежей, 0)
		                   + ?(УчетС2018, СКДР_68_34_ВидыПлатежей, 0)
		                   + ?(УчетС2018, СКДР_68_52_ВидыПлатежей, 0)
		                   + ?(ЭтоИП, СКДР_68_21_ВидыПлатежей, 0);
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
		КонецЕсли;
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("68.04.2").Код, СКД_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СКДР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
		КонецЕсли;
		Если УчетС2018 Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "12304";
	НаименованиеСтроки = "Расчеты по социальному страхованию и обеспечению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_69_01_ВидыПлатежей
		                   + СКДР_69_02_1_ВидыПлатежей + СКДР_69_02_2_ВидыПлатежей + СКДР_69_02_3_ВидыПлатежей + СКДР_69_02_4_ВидыПлатежей + СКДР_69_02_5_ВидыПлатежей + СКДР_69_02_6_ВидыПлатежей + СКДР_69_02_7_ВидыПлатежей
		                   + СКДР_69_03_1_ВидыПлатежей + СКДР_69_03_2_ВидыПлатежей
		                   + СКДР_69_04_ВидыПлатежей
		                   + СКДР_69_05_1_ВидыПлатежей + СКДР_69_05_2_ВидыПлатежей
		                   + СКДР_69_06_1_ВидыПлатежей + СКДР_69_06_2_ВидыПлатежей + СКДР_69_06_3_ВидыПлатежей + СКДР_69_06_4_ВидыПлатежей + СКДР_69_06_5_ВидыПлатежей
		                   + СКДР_69_11_ВидыПлатежей + СКДР_69_12_ВидыПлатежей
		                   + СКДР_69_13;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СКДР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""",   СКДР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКДР " + Счет("69.13").Код, СКДР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	КонецЕсли;
	
	НомерСтроки = "12310";
	НаименованиеСтроки = "Расчеты с персоналом по оплате труда";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_70_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		Если УчетНа70ВедетсяСводно Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("70").Код, СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
		Иначе
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 70, развернутое по субконто ""Работники организации""", СКДР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "12305";
	НаименованиеСтроки = "Расчеты с подотчетными лицами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_71_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 71, развернутое по субконто ""Работники организации""", СКДР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	КонецЕсли;
	
	НомерСтроки = "12306";
	НаименованиеСтроки = "Расчеты с персоналом по прочим операциям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_73_01 + СКД_73_02 + СКДР_73_03_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("73.01").Код, СКД_73_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("73.02").Код, СКД_73_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("73.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 73.03, развернутое по субконто ""Работники организации""", СКДР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	КонецЕсли;
	
	НомерСтроки = "12307";
	НаименованиеСтроки = "Расчеты по вкладам в уставный (складочный) капитал";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_75_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("75.01").Код, СКД_75_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.01")));
	КонецЕсли;
	
	НомерСтроки = "12308";
	НаименованиеСтроки = "Расчеты с разными дебиторами и кредиторами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_76_01_1_КонтрагентыДоговоры + СКДР_76_21_КонтрагентыДоговоры + СКД_76_02 + СКД_76_22 + СКДР_76_03_КонтрагентыДоговоры + СКД_76_32 + СКДР_76_05_КонтрагентыДоговоры
		                   + СКДР_76_25_КонтрагентыДоговоры + СКДР_76_35_КонтрагентыДоговоры + СКДР_76_09_КонтрагентыДоговоры + СКДР_76_29_КонтрагентыДоговоры + СКДР_76_39_КонтрагентыДоговоры
		                   + СКДР_76_10_Работники + СКД_76_14
		                   + СКДР_76_41_Контрагенты + СКДР_76_49_Контрагенты
		                   + СКДР_76_06_КонтрагентыДоговоры + СКДР_76_26_КонтрагентыДоговоры + СКДР_76_36_КонтрагентыДоговоры + СКДР_76_К_КонтрагентыДоговоры
		                   + СКДР_76_07_2_КонтрагентыДоговоры + СКДР_76_27_2_КонтрагентыДоговоры + СКДР_76_37_2_КонтрагентыДоговоры;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.02").Код, СКД_76_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.22").Код, СКД_76_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.32").Код, СКД_76_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.10, развернутое по субконто ""Работники организации""", СКДР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.14").Код, СКД_76_14, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.14")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.41, развернутое по субконто ""Контрагенты""", СКДР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.49, развернутое по субконто ""Контрагенты""", СКДР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	КонецЕсли;
	
	НомерСтроки = "12309";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "12311";
	НаименованиеСтроки = "Выполненные этапы по незавершенным работам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_46;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("46").Код, СКД_46, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("46")));
	КонецЕсли;
	
	НомерСтроки = "12312";
	НаименованиеСтроки = "Оценочные обязательства";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_96_09_Резервы;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СКДР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	КонецЕсли;
	
	НомерСтроки = "12313";
	НаименованиеСтроки = "Расчеты с факторинговыми компаниями";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_76_13;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.13").Код, СКД_76_13, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.13")));
	КонецЕсли;
	
	НомерСтроки = "1240";
	НаименованиеСтроки = "Финансовые вложения";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_55_03   = СКД("55.03", СальдоИОборотыПоСчетам);
	СКД_55_23   = СКД("55.23", СальдоИОборотыПоСчетам);
	СКД_58_01_2 = СКД("58.01.2", СальдоИОборотыПоСчетам);
	СКД_58_02   = СКД("58.02", СальдоИОборотыПоСчетам);
	СКД_58_03   = СКД("58.03", СальдоИОборотыПоСчетам);
	СКД_58_04   = СКД("58.04", СальдоИОборотыПоСчетам);
	СКД_58_05   = СКД("58.05", СальдоИОборотыПоСчетам);
	СКК_59      = СКК("59", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_58_01_2 + СКД_58_02 - СКК_59
	                   + СКД_58_03 + СКД_58_04 + СКД_58_05 + СКД_55_03 + СКД_55_23;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.2").Код, СКД_58_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.02").Код, СКД_58_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("59").Код, -СКК_59, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("59")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.03").Код, СКД_58_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.04").Код, СКД_58_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("58.05").Код, СКД_58_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.03").Код, СКД_55_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.23").Код, СКД_55_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.23")));
	
	НомерВРасшифровке = 12401;
	
	НомерСтроки = "12401";
	НаименованиеСтроки = "Акции";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_01_2;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.01.2").Код, СКД_58_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.01.2")));
	КонецЕсли;
	
	НомерСтроки = "12402";
	НаименованиеСтроки = "Долговые ценные бумаги";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_02 - СКК_59;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.02").Код, СКД_58_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " + Счет("59").Код, -СКК_59, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("59")));
	КонецЕсли;
	
	НомерСтроки = "12403";
	НаименованиеСтроки = "Предоставленные займы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.03").Код, СКД_58_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.03")));
	КонецЕсли;
	
	НомерСтроки = "12404";
	НаименованиеСтроки = "Вклады по договору простого товарищества";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("58.04").Код, СКД_58_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.04")));
	КонецЕсли;
	
	НомерСтроки = "12405";
	НаименованиеСтроки = "Приобретенные права в рамках оказания финансовых услуг";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_58_05;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("58.05").Код, СКД_58_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("58.05")));
	КонецЕсли;
	
	НомерСтроки = "12406";
	НаименованиеСтроки = "Депозитные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
	
		ЗначениеПоказателя = СКД_55_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.03"), СКД_55_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.03")));
	КонецЕсли;
	
	НомерСтроки = "12407";
	НаименованиеСтроки = "Депозитные счета (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.23"), СКД_55_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.23")));
	КонецЕсли;
	
	НомерСтроки = "1250";
	НаименованиеСтроки = "Денежные средства и денежные эквиваленты";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_50_01 = СКД("50.01", СальдоИОборотыПоСчетам);
	СКД_50_02 = СКД("50.02", СальдоИОборотыПоСчетам);
	СКД_50_04 = СКД("50.04", СальдоИОборотыПоСчетам);
	СКД_50_21 = СКД("50.21", СальдоИОборотыПоСчетам);
	СКД_51    = СКД("51", СальдоИОборотыПоСчетам);
	СКД_52    = СКД("52", СальдоИОборотыПоСчетам);
	СКД_55_01 = СКД("55.01", СальдоИОборотыПоСчетам);
	СКД_55_02 = СКД("55.02", СальдоИОборотыПоСчетам);
	СКД_55_04 = СКД("55.04", СальдоИОборотыПоСчетам);
	СКД_55_21 = СКД("55.21", СальдоИОборотыПоСчетам);
	СКД_55_24 = СКД("55.24", СальдоИОборотыПоСчетам);
	СКД_57    = СКД("57", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_50_01 + СКД_50_02 + СКД_50_21
	                   + СКД_50_04
	                   + СКД_51 + СКД_52
	                   + СКД_55_01 + СКД_55_02 + СКД_55_04 + СКД_55_21 + СКД_55_24
	                   + СКД_57;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.01").Код, СКД_50_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.02").Код, СКД_50_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.21").Код, СКД_50_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.04").Код, СКД_50_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("51").Код, СКД_51, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("51")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("52").Код, СКД_52, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("52")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.01").Код, СКД_55_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.02").Код, СКД_55_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.04").Код, СКД_55_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.21").Код, СКД_55_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("55.24").Код, СКД_55_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.24")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("57").Код, СКД_57, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("57")));
	
	НомерВРасшифровке = 12501;
	
	НомерСтроки = "12501";
	НаименованиеСтроки ="Касса организации";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.01").Код, СКД_50_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.01")));
	КонецЕсли;
	
	НомерСтроки = "12502";
	НаименованиеСтроки ="Операционная касса";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.02").Код, СКД_50_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.02")));
	КонецЕсли;
	
	НомерСтроки = "12503";
	НаименованиеСтроки ="Касса организации (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.21").Код, СКД_50_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.21")));
	КонецЕсли;
	
	НомерСтроки = "12512";
	НаименованиеСтроки = "Касса по деятельности платежного агента";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.04").Код, СКД_50_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.04")));
	КонецЕсли;
	
	НомерСтроки = "12504";
	НаименованиеСтроки = "Расчетные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_51;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("51").Код, СКД_51, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("51")));
	КонецЕсли;
	
	НомерСтроки = "12505";
	НаименованиеСтроки = "Валютные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_52;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("52").Код, СКД_52, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("52")));
	КонецЕсли;
	
	НомерСтроки = "12506";
	НаименованиеСтроки = "Аккредитивы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.01").Код, СКД_55_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.01")));
	КонецЕсли;
	
	НомерСтроки = "12507";
	НаименованиеСтроки = "Чековые книжки";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.02").Код, СКД_55_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.02")));
	КонецЕсли;
	
	НомерСтроки = "12508";
	НаименованиеСтроки = "Прочие специальные счета";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("55.04").Код, СКД_55_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.04")));
	КонецЕсли;
	
	НомерСтроки = "12509";
	НаименованиеСтроки = "Аккредитивы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_21;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.21").Код, СКД_55_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.21")));
	КонецЕсли;
	
	НомерСтроки = "12510";
	НаименованиеСтроки = "Прочие специальные счета (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_55_24;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("55.24").Код, СКД_55_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("55.24")));
	КонецЕсли;
	
	НомерСтроки = "12511";
	НаименованиеСтроки = "Переводы в пути";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_57;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД" + Счет("57").Код, СКД_57, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("57")));
	КонецЕсли;
	
	НомерСтроки = "1260";
	НаименованиеСтроки = "Прочие оборотные активы";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка "+ НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_19_06 = СКД("19.06", СальдоИОборотыПоСчетам);
	СКД_50_03 = СКД("50.03", СальдоИОборотыПоСчетам);
	СКД_50_23 = СКД("50.23", СальдоИОборотыПоСчетам);
	СКД_68_22 = СКД("68.22", СальдоИОборотыПоСчетам);
	СКД_76_АВ = СКД("76.АВ", СальдоИОборотыПоСчетам);
	СКД_76_ОТ = СКД("76.ОТ", СальдоИОборотыПоСчетам);
	СКД_94    = СКД("94", СальдоИОборотыПоСчетам);
	
	СКД_76_07_9 = СКД("76.07.9", СальдоИОборотыПоСчетам);
	СКД_76_37_9 = СКД("76.37.9", СальдоИОборотыПоСчетам);
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы;
	СКД_97_ПоВидуАктива      = СтруктураСКД_97[ВидАктиваРБП];
	СКД_76_01_2_ПоВидуАктива = СтруктураСКД_76_01_2[ВидАктиваРБП];
	СКД_76_01_9_ПоВидуАктива = СтруктураСКД_76_01_9[ВидАктиваРБП];
	
	ЗначениеПоказателя = СКД_19_06 + СКД_50_03 + СКД_50_23 + СКД_68_22
	                   + СКД_76_ОТ + СКДР_76_НА_КонтрагентыДоговоры + СКД_94
	                   + СКД_97_ПоВидуАктива
	                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива
	                   + СКД_76_07_9 + СКД_76_37_9;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.06").Код, СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.03").Код, СКД_50_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("50.23").Код, СКД_50_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.23")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("68.22").Код, СКД_68_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.ОТ").Код, СКД_76_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ОТ")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
	
	ОтборПоАналитике = Новый Соответствие;
	ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.07.9").Код, СКД_76_07_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.07.9")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.37.9").Код, СКД_76_37_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.37.9")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("94").Код, СКД_94, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("94")));
	
	НомерВРасшифровке = 12601;
	
	НомерСтроки = "12601";
	НаименованиеСтроки ="Акцизы по оплаченным материальным ценностям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_19_06;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("19.06").Код, СКД_19_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("19.06")));
	КонецЕсли;
	
	НомерСтроки = "12602";
	НаименованиеСтроки ="Денежные документы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.03").Код, СКД_50_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.03")));
	КонецЕсли;
	
	НомерСтроки = "12603";
	НаименованиеСтроки ="Денежные документы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_50_23;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("50.23").Код, СКД_50_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("50.23")));
	КонецЕсли;
	
	НомерСтроки = "12604";
	НаименованиеСтроки ="НДС по экспорту к возмещению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_68_22;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("68.22").Код, СКД_68_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.22")));
	КонецЕсли;
	
	НомерСтроки = "12606";
	НаименованиеСтроки ="НДС, начисленный по отгрузке";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_76_ОТ;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.ОТ").Код, СКД_76_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.ОТ")));
	КонецЕсли;
	
	НомерСтроки = "12607";
	НаименованиеСтроки ="Расчеты по НДС при исполнении обязанностей налогового агента";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКДР_76_НА_КонтрагентыДоговоры;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СКДР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	КонецЕсли;
	
	НомерСтроки = "12608";
	НаименованиеСтроки = "Расходы будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_97_ПоВидуАктива
		                   + СКД_76_01_2_ПоВидуАктива + СКД_76_01_9_ПоВидуАктива;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто1.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по дебету счета 97 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_97_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("97"), ОтборПоАналитике));
		
		ОтборПоАналитике = Новый Соответствие;
		ОтборПоАналитике.Вставить("Субконто2.ВидАктива", ВидАктиваРБП);
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.2 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_2_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.2"), ОтборПоАналитике));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по дебету счета 76.01.9 /объекты со значением реквизита ""Вид актива"" - """ + Строка(ВидАктиваРБП) + """/", СКД_76_01_9_ПоВидуАктива, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.01.9"), ОтборПоАналитике));
	КонецЕсли;
	
	НомерСтроки = "12609";
	НаименованиеСтроки ="Недостачи и потери от порчи ценностей";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_94;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("94").Код, СКД_94, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("94")));
	КонецЕсли;
	
	НомерСтроки = "12610";
	НаименованиеСтроки ="НДС по арендным обязательствам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКД_76_07_9 + СКД_76_37_9;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("76.07.9").Код, СКД_76_07_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.07.9")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКД " + Счет("76.37.9").Код, СКД_76_37_9, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.37.9")));
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел3")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел3(КонтекстВыполнения)
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	
	НомерСтроки = "1310";
	НаименованиеСтроки = "Уставный капитал (складочный капитал, уставный фонд, вклады товарищей)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_80 = СКК("80", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_80;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("80").Код, СКК_80, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("80")));
	
	НомерСтроки = "1320";
	НаименованиеСтроки = "Собственные акции, выкупленные у акционеров";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКД_81 = СКД("81", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКД_81;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, -ЗначениеПоказателя); // вычитаемый
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКД " + Счет("81").Код, СКД_81, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("81")));
	
	НомерСтроки = "1340";
	НаименованиеСтроки = "Переоценка внеоборотных активов";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_83_01 = СКК("83.01", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_83_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01").Код, СКК_83_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01")));
	
	НомерВРасшифровке = 13401;
	
	СКК_83_01_1 = СКК("83.01.1", СальдоИОборотыПоСчетам);
	СКК_83_01_2 = СКК("83.01.2", СальдоИОборотыПоСчетам);
	СКК_83_01_3 = СКК("83.01.3", СальдоИОборотыПоСчетам);
	
	НомерСтроки = "13401";
	НаименованиеСтроки = "Переоценка основных средств";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_1;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.1").Код, СКК_83_01_1, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.1")));
	КонецЕсли;
	
	НомерСтроки = "13402";
	НаименованиеСтроки = "Переоценка НМА";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_2;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.2").Код, СКК_83_01_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.2")));
	КонецЕсли;
	
	НомерСтроки = "13403";
	НаименованиеСтроки = "Переоценка прочих внеоборотных активов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_83_01_3;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("83.01.3").Код, СКК_83_01_3, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01.3")));
	КонецЕсли;
	
	НомерСтроки = "1350";
	НаименованиеСтроки = "Добавочный капитал (без переоценки)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_83    = СКК("83", СальдоИОборотыПоСчетам);
	СКК_83_01 = СКК("83.01", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_83 - СКК_83_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " +  Счет("83").Код, СКК_83, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКК " +  Счет("83.01").Код, -СКК_83_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("83.01")));
	
	НомерСтроки = "1360";
	НаименованиеСтроки = "Резервный капитал";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_82    = СКК("82", СальдоИОборотыПоСчетам);
	СКК_82_01 = СКК("82.01", СальдоИОборотыПоСчетам);
	СКК_82_02 = СКК("82.02", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_82;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("82").Код, СКК_82, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82")));
	
	НомерВРасшифровке = 13601;
	
	НомерСтроки = "13601";
	НаименованиеСтроки = "Резервы, образованные в соответствии с законодательством";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_82_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("82.01").Код, СКК_82_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82.01")));
	КонецЕсли;
	
	НомерСтроки = "13602";
	НаименованиеСтроки = "Резервы, образованные в соответствии с учредительными документами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_82_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " +  Счет("82.02").Код, СКК_82_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("82.02")));
	КонецЕсли;
	
	НомерСтроки = "1370";
	НаименованиеСтроки = "Нераспределенная прибыль (непокрытый убыток)";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_84 = СКК("84", СальдоИОборотыПоСчетам);
	СКД_84 = СКД("84", СальдоИОборотыПоСчетам);
	СКК_99 = СКК("99", СальдоИОборотыПоСчетам);
	СКД_99 = СКД("99", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_84 - СКД_84 + СКК_99 - СКД_99;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("84").Код, СКК_84, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("84")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("84").Код, -СКД_84, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("84")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("99").Код, СКК_99, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("99")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("99").Код, -СКД_99, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("99")));
	
КонецПроцедуры

&Вместо("ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел5")
Процедура Расш1_ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1_БалансПоГрафе_Раздел5(КонтекстВыполнения)
	
	ИмяРаздела = "Баланс";
	
	Организация = КонтекстВыполнения.Организация;
	ТаблицаРасшифровки = КонтекстВыполнения.ТаблицаРасшифровки;
	РассчитанныеПоказатели = КонтекстВыполнения.РассчитанныеПоказатели;
	
	УчетНа70ВедетсяСводно = КонтекстВыполнения.УчетНа70ВедетсяСводно;
	
	Графа = КонтекстВыполнения.КонтекстОтчета.Графа;
	ЗаголовокГрафы = КонтекстВыполнения.КонтекстОтчета.ЗаголовокГрафы;
	НачалоПериодаОтчета = КонтекстВыполнения.КонтекстОтчета.НачалоПериодаОтчета;
	КонецПериодаОтчета  = КонтекстВыполнения.КонтекстОтчета.КонецПериодаОтчета.Дата;
	
	ДеревоНастроекСтрокРасшифровки = КонтекстВыполнения.КонтекстОтчета.СоставДополнительныхСтрокБаланс;
	
	ОбщиеПараметрыРасшифровки = Новый Структура;
	ОбщиеПараметрыРасшифровки.Вставить("Организация",   Организация);
	ОбщиеПараметрыРасшифровки.Вставить("НачалоПериода", НачалоПериодаОтчета);
	ОбщиеПараметрыРасшифровки.Вставить("КонецПериода",  КонецПериодаОтчета);
	
	СальдоИОборотыПоСчетам = КонтекстВыполнения.РассчитанныеПараметры.СальдоИОборотыПоСчетам;
	СальдоИОборотыПоСчетамРазвернутое_9601 = СальдоИОборотыПоСчетамРазвернутое_9601(Организация,НачалоПериодаОтчета,КонецПериодаОтчета); //ЮЦАУ
	СиО_Контрагенты = КонтекстВыполнения.РассчитанныеПараметры.СиО_Контрагенты;
	СиО_КонтрагентыДоговоры = КонтекстВыполнения.РассчитанныеПараметры.СиО_КонтрагентыДоговоры;
	
	СиО_ВидыПлатежей = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежей;
	СиО_ВидыПлатежейУровниБюджетов = КонтекстВыполнения.РассчитанныеПараметры.СиО_ВидыПлатежейУровниБюджетов;
	
	СиО_Работники = КонтекстВыполнения.РассчитанныеПараметры.СиО_Работники;
	СиО_Резервы = КонтекстВыполнения.РассчитанныеПараметры.СиО_Резервы;
	
	ИдентификаторАвтозаполнения = КонтекстВыполнения.СтруктураОтчета.Баланс.ИдентификаторАвтозаполнения;
	ЭтоИП = НЕ РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	
	УчетС2018 = (КонецПериодаОтчета >= '2018-01-01');
	
	НомерСтроки = "1510";
	НаименованиеСтроки = "Заемные средства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_66    = СКК("66", СальдоИОборотыПоСчетам);
	СКК_66_01 = СКК("66.01", СальдоИОборотыПоСчетам);
	СКК_66_02 = СКК("66.02", СальдоИОборотыПоСчетам);
	СКК_66_03 = СКК("66.03", СальдоИОборотыПоСчетам);
	СКК_66_04 = СКК("66.04", СальдоИОборотыПоСчетам);
	СКК_66_05 = СКК("66.05", СальдоИОборотыПоСчетам);
	СКК_66_06 = СКК("66.06", СальдоИОборотыПоСчетам);
	СКК_66_21 = СКК("66.21", СальдоИОборотыПоСчетам);
	СКК_66_22 = СКК("66.22", СальдоИОборотыПоСчетам);
	СКК_66_23 = СКК("66.23", СальдоИОборотыПоСчетам);
	СКК_66_24 = СКК("66.24", СальдоИОборотыПоСчетам);
	СКК_66_25 = СКК("66.25", СальдоИОборотыПоСчетам);
	СКК_66_26 = СКК("66.26", СальдоИОборотыПоСчетам);
	СКК_67_02 = СКК("67.02", СальдоИОборотыПоСчетам);
	СКК_67_04 = СКК("67.04", СальдоИОборотыПоСчетам);
	СКК_67_22 = СКК("67.22", СальдоИОборотыПоСчетам);
	СКК_67_24 = СКК("67.24", СальдоИОборотыПоСчетам);
	СКК_67_06 = СКК("67.06", СальдоИОборотыПоСчетам);
	СКК_67_26 = СКК("67.26", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СКК_66 + СКК_67_02 + СКК_67_04 + СКК_67_22 + СКК_67_24;
	ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_06 + СКК_67_26;
	
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66").Код, СКК_66, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.02").Код, СКК_67_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.04").Код, СКК_67_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.22").Код, СКК_67_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.24").Код, СКК_67_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.24")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.06").Код, СКК_67_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.26").Код, СКК_67_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.26")));
	
	НомерВРасшифровке = 15101;
	
	НомерСтроки = "15101";
	НаименованиеСтроки = "Краткосрочные кредиты";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_01;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.01").Код, СКК_66_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.01")));
		
	КонецЕсли;
	
	НомерСтроки = "15102";
	НаименованиеСтроки = "Краткосрочные займы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_03;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_05;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.03").Код, СКК_66_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.05").Код, СКК_66_05, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.05")));
		
	КонецЕсли;
	
	НомерСтроки = "15103";
	НаименованиеСтроки = "Проценты по краткосрочным кредитам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_02;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.02").Код, СКК_66_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.02")));
		
	КонецЕсли;
	
	НомерСтроки = "15104";
	НаименованиеСтроки = "Проценты по долгосрочным кредитам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_02;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.02").Код, СКК_67_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.02")));
		
	КонецЕсли;
	
	НомерСтроки = "15105";
	НаименованиеСтроки = "Проценты по краткосрочным займам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_04;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_06;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.04").Код, СКК_66_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.06").Код, СКК_66_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.06")));
		
	КонецЕсли;
	
	НомерСтроки = "15106";
	НаименованиеСтроки = "Проценты по долгосрочным займам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_04;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_06;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.04").Код, СКК_67_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.06").Код, СКК_67_06, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.06")));
		
	КонецЕсли;
	
	НомерСтроки = "15107";
	НаименованиеСтроки = "Краткосрочные кредиты (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_21;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.21").Код, СКК_66_21, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.21")));
		
	КонецЕсли;
	
	НомерСтроки = "15108";
	НаименованиеСтроки = "Краткосрочные займы (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_23;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_25;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.23").Код, СКК_66_23, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.23")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.25").Код, СКК_66_25, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.25")));
		
	КонецЕсли;
	
	НомерСтроки = "15109";
	НаименованиеСтроки = "Проценты по краткосрочным кредитам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_22;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.22").Код, СКК_66_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.22")));
		
	КонецЕсли;
	
	НомерСтроки = "15110";
	НаименованиеСтроки = "Проценты по долгосрочным кредитам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_22;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.22").Код, СКК_67_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.22")));
		
	КонецЕсли;
	
	НомерСтроки = "15111";
	НаименованиеСтроки = "Проценты по краткосрочным займам (в валюте)";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_66_24;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_66_26;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("66.24").Код, СКК_66_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.24")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("66.26").Код, СКК_66_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("66.26")));
		
	КонецЕсли;
	
	НомерСтроки = "15112";
	НаименованиеСтроки = "Проценты по долгосрочным займам (в валюте)";
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_67_24;
		ЗначениеПоказателя = ЗначениеПоказателя + СКК_67_26;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("67.24").Код, СКК_67_24, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.24")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("67.26").Код, СКК_67_26, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("67.26")));
		
	КонецЕсли;
	
	НомерСтроки = "1520";
	НаименованиеСтроки = "Кредиторская задолженность";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СККР_60_01_КонтрагентыДоговоры = СККР("60.01", СиО_КонтрагентыДоговоры);
	СККР_60_21_КонтрагентыДоговоры = СККР("60.21", СиО_КонтрагентыДоговоры);
	СККР_60_31_КонтрагентыДоговоры = СККР("60.31", СиО_КонтрагентыДоговоры);
	
	СККР_62_01_КонтрагентыДоговоры = СККР("62.01", СиО_КонтрагентыДоговоры);
	СККР_62_21_КонтрагентыДоговоры = СККР("62.21", СиО_КонтрагентыДоговоры);
	СККР_62_31_КонтрагентыДоговоры = СККР("62.31", СиО_КонтрагентыДоговоры);
	
	Если УчетНа70ВедетсяСводно Тогда
		СККР_70_Работники = СКК("70", СальдоИОборотыПоСчетам);
	Иначе
		СККР_70_Работники = СККР("70", СиО_Работники);
	КонецЕсли;
	
	//СККР_71_Работники = СККР("71", СиО_Работники);
	СККР_71_Работники   = СКК("71", СальдоИОборотыПоСчетам); //ЮЦАУ
	
	//СККР_73_03_Работники = СККР("73.03", СиО_Работники);
	СККР_73_03_Работники = СКК("73.03", СальдоИОборотыПоСчетам);//ЮЦАУ
	
	СККР_76_10_Работники = СККР("76.10", СиО_Работники);
	
	СККР_68_01_ВидыПлатежей = СККР("68.01", СиО_ВидыПлатежей);
	СККР_68_02_ВидыПлатежей = СККР("68.02", СиО_ВидыПлатежей);
	СККР_68_03_ВидыПлатежей = СККР("68.03", СиО_ВидыПлатежей);
	СККР_68_05_ВидыПлатежей = СККР("68.05", СиО_ВидыПлатежей); //ЮЦАУ //ДОбавлено
	СККР_68_06_ВидыПлатежей = СККР("68.06", СиО_ВидыПлатежей);
	СККР_68_07_ВидыПлатежей = СККР("68.07", СиО_ВидыПлатежей);
	СККР_68_08_ВидыПлатежей = СККР("68.08", СиО_ВидыПлатежей);
	СККР_68_09_ВидыПлатежей = СККР("68.09", СиО_ВидыПлатежей);
	СККР_68_11_ВидыПлатежей = СККР("68.11", СиО_ВидыПлатежей);
	СККР_68_12_ВидыПлатежей = СККР("68.12", СиО_ВидыПлатежей);
	СККР_68_13_ВидыПлатежей = СККР("68.13", СиО_ВидыПлатежей);
	СККР_68_14_ВидыПлатежей = СККР("68.14", СиО_ВидыПлатежей);
	СККР_68_34_ВидыПлатежей = СККР("68.34", СиО_ВидыПлатежей);
	СККР_68_52_ВидыПлатежей = СККР("68.52", СиО_ВидыПлатежей);
	СККР_68_21_ВидыПлатежей = СККР("68.21", СиО_ВидыПлатежей);
	
	//СККР_69_01_ВидыПлатежей   = СККР("69.01", СиО_ВидыПлатежей);
	СККР_69_01_ВидыПлатежей   = СКК("69", СальдоИОборотыПоСчетам); //ЮЦАУ 
	
	СККР_69_02_1_ВидыПлатежей = СККР("69.02.1", СиО_ВидыПлатежей);
	СККР_69_02_2_ВидыПлатежей = СККР("69.02.2", СиО_ВидыПлатежей);
	СККР_69_02_3_ВидыПлатежей = СККР("69.02.3", СиО_ВидыПлатежей);
	СККР_69_02_4_ВидыПлатежей = СККР("69.02.4", СиО_ВидыПлатежей);
	СККР_69_02_5_ВидыПлатежей = СККР("69.02.5", СиО_ВидыПлатежей);
	СККР_69_02_6_ВидыПлатежей = СККР("69.02.6", СиО_ВидыПлатежей);
	СККР_69_02_7_ВидыПлатежей = СККР("69.02.7", СиО_ВидыПлатежей);
	
	СККР_69_03_1_ВидыПлатежей = СККР("69.03.1", СиО_ВидыПлатежей);
	СККР_69_03_2_ВидыПлатежей = СККР("69.03.2", СиО_ВидыПлатежей);
	
	СККР_69_04_ВидыПлатежей   = СККР("69.04", СиО_ВидыПлатежей);
	
	СККР_69_05_1_ВидыПлатежей = СККР("69.05.1", СиО_ВидыПлатежей);
	СККР_69_05_2_ВидыПлатежей = СККР("69.05.2", СиО_ВидыПлатежей);
	
	СККР_69_06_1_ВидыПлатежей = СККР("69.06.1", СиО_ВидыПлатежей);
	СККР_69_06_2_ВидыПлатежей = СККР("69.06.2", СиО_ВидыПлатежей);
	СККР_69_06_3_ВидыПлатежей = СККР("69.06.3", СиО_ВидыПлатежей);
	СККР_69_06_4_ВидыПлатежей = СККР("69.06.4", СиО_ВидыПлатежей);
	СККР_69_06_5_ВидыПлатежей = СККР("69.06.5", СиО_ВидыПлатежей);
	
	СККР_69_11_ВидыПлатежей   = СККР("69.11", СиО_ВидыПлатежей);
	СККР_69_12_ВидыПлатежей   = СККР("69.12", СиО_ВидыПлатежей);
	
	//СККР_68_04_1_ВидыПлатежейУровни = СККР("68.04.1", СиО_ВидыПлатежейУровниБюджетов);
	СККР_68_04_1_ВидыПлатежейУровни = СКК("68.04.1", СальдоИОборотыПоСчетам); //ЮЦАУ
	
	СККР_68_10_ВидыПлатежейУровни   = СККР("68.10", СиО_ВидыПлатежейУровниБюджетов);
	
	СККР_76_01_1_КонтрагентыДоговоры = СККР("76.01.1", СиО_КонтрагентыДоговоры);
	СККР_76_03_КонтрагентыДоговоры   = СККР("76.03", СиО_КонтрагентыДоговоры);
	СККР_76_05_КонтрагентыДоговоры   = СККР("76.05", СиО_КонтрагентыДоговоры);
	СККР_76_06_КонтрагентыДоговоры   = СККР("76.06", СиО_КонтрагентыДоговоры);
	
	//СККР_76_09_КонтрагентыДоговоры   = СККР("76.09", СиО_КонтрагентыДоговоры);
	СККР_76_09_КонтрагентыДоговоры   = СКК("76.09", СиО_Контрагенты); //ЮЦАУ
	
	СККР_76_21_КонтрагентыДоговоры   = СККР("76.21", СиО_КонтрагентыДоговоры);
	СККР_76_25_КонтрагентыДоговоры   = СККР("76.25", СиО_КонтрагентыДоговоры);
	СККР_76_26_КонтрагентыДоговоры   = СККР("76.26", СиО_КонтрагентыДоговоры);
	СККР_76_29_КонтрагентыДоговоры   = СККР("76.29", СиО_КонтрагентыДоговоры);
	СККР_76_35_КонтрагентыДоговоры   = СККР("76.35", СиО_КонтрагентыДоговоры);
	СККР_76_36_КонтрагентыДоговоры   = СККР("76.36", СиО_КонтрагентыДоговоры);
	СККР_76_39_КонтрагентыДоговоры   = СККР("76.39", СиО_КонтрагентыДоговоры);
	СККР_76_К_КонтрагентыДоговоры    = СККР("76.К", СиО_КонтрагентыДоговоры);
	СККР_76_НА_КонтрагентыДоговоры   = СККР("76.НА", СиО_КонтрагентыДоговоры);
	
	СККР_76_07_2_КонтрагентыДоговоры = СККР("76.07.2", СиО_КонтрагентыДоговоры);
	СККР_76_27_2_КонтрагентыДоговоры = СККР("76.27.2", СиО_КонтрагентыДоговоры);
	СККР_76_37_2_КонтрагентыДоговоры = СККР("76.37.2", СиО_КонтрагентыДоговоры);
	
	СККР_76_41_Контрагенты = СККР("76.41", СиО_Контрагенты);
	СККР_76_49_Контрагенты = СККР("76.49", СиО_Контрагенты);
	
	СКК_60_03   = СКК("60.03", СальдоИОборотыПоСчетам);
	СКК_62_02   = СКК("62.02", СальдоИОборотыПоСчетам);
	СКК_62_22   = СКК("62.22", СальдоИОборотыПоСчетам);
	СКК_62_32   = СКК("62.32", СальдоИОборотыПоСчетам);
	СКК_62_ОТ   = СКК("62.ОТ", СальдоИОборотыПоСчетам);
	СКК_68_04_2 = СКК("68.04.2", СальдоИОборотыПоСчетам);
	СКК_68_32   = СКК("68.32", СальдоИОборотыПоСчетам);
	СКК_68_42   = СКК("68.42", СальдоИОборотыПоСчетам);
	СККР_69_13  = СККР("69.13", СальдоИОборотыПоСчетам);
	СКК_75_01   = СКК("75.01", СальдоИОборотыПоСчетам);
	СКК_75_02   = СКК("75.02", СальдоИОборотыПоСчетам);
	СКК_76_04   = СКК("76.04", СальдоИОборотыПоСчетам);
	СКК_76_Н    = СКК("76.Н", СальдоИОборотыПоСчетам);
	СКД_76_АВ   = 0; //СКД("76.АВ", СальдоИОборотыПоСчетам); //ЮЦАУ
	
	ЗначениеПоказателя = СККР_60_01_КонтрагентыДоговоры + СККР_60_21_КонтрагентыДоговоры + СККР_60_31_КонтрагентыДоговоры + СКК_60_03
	+ СКК_62_02 + СККР_62_01_КонтрагентыДоговоры + СКК_62_22 + СККР_62_21_КонтрагентыДоговоры + СКК_62_32 + СККР_62_31_КонтрагентыДоговоры + СКК_62_ОТ
	- СКД_76_АВ
	+ СККР_68_01_ВидыПлатежей + СККР_68_02_ВидыПлатежей + СККР_68_03_ВидыПлатежей
	+ СККР_68_04_1_ВидыПлатежейУровни + СКК_68_04_2
	+ СККР_68_06_ВидыПлатежей + СККР_68_07_ВидыПлатежей + СККР_68_08_ВидыПлатежей + СККР_68_09_ВидыПлатежей
	+ СККР_68_10_ВидыПлатежейУровни
	+ СККР_68_11_ВидыПлатежей + СККР_68_12_ВидыПлатежей + СККР_68_13_ВидыПлатежей
	+ ?(ЭтоИП, СККР_68_14_ВидыПлатежей, 0)
	+ ?(УчетС2018, СККР_68_34_ВидыПлатежей, 0)
	+ ?(УчетС2018, СККР_68_52_ВидыПлатежей, 0)
	+ ?(ЭтоИП, СККР_68_21_ВидыПлатежей, 0)
	+ СКК_68_32 + СКК_68_42
	//+ СККР_69_01_ВидыПлатежей
	//+ СККР_69_02_1_ВидыПлатежей + СККР_69_02_2_ВидыПлатежей + СККР_69_02_3_ВидыПлатежей + СККР_69_02_4_ВидыПлатежей + СККР_69_02_5_ВидыПлатежей + СККР_69_02_6_ВидыПлатежей + СККР_69_02_7_ВидыПлатежей
	//+ СККР_69_03_1_ВидыПлатежей + СККР_69_03_2_ВидыПлатежей
	//+ СККР_69_04_ВидыПлатежей
	//+ СККР_69_05_1_ВидыПлатежей + СККР_69_05_2_ВидыПлатежей
	//+ СККР_69_06_1_ВидыПлатежей + СККР_69_06_2_ВидыПлатежей + СККР_69_06_3_ВидыПлатежей + СККР_69_06_4_ВидыПлатежей + СККР_69_06_5_ВидыПлатежей
	//+ СККР_69_11_ВидыПлатежей + СККР_69_12_ВидыПлатежей //ЮЦАУ
	+ СККР_69_13
	+ СККР_70_Работники
	+ СККР_71_Работники
	+ СККР_73_03_Работники
	+ СКК_75_02
	+ СККР_76_05_КонтрагентыДоговоры + СККР_76_25_КонтрагентыДоговоры + СККР_76_35_КонтрагентыДоговоры
	+ СККР_76_06_КонтрагентыДоговоры + СККР_76_26_КонтрагентыДоговоры + СККР_76_36_КонтрагентыДоговоры
	+ СККР_76_01_1_КонтрагентыДоговоры + СККР_76_21_КонтрагентыДоговоры + СККР_76_03_КонтрагентыДоговоры
	+ СКК_76_04
	+ СККР_76_09_КонтрагентыДоговоры + СККР_76_29_КонтрагентыДоговоры + СККР_76_39_КонтрагентыДоговоры
	+ СККР_76_10_Работники
	+ СККР_76_41_Контрагенты + СККР_76_49_Контрагенты
	+ СККР_76_07_2_КонтрагентыДоговоры + СККР_76_27_2_КонтрагентыДоговоры + СККР_76_37_2_КонтрагентыДоговоры
	+ СККР_76_К_КонтрагентыДоговоры + СКК_76_Н + СККР_68_05_ВидыПлатежей; //ЮЦАУ Добавил СККР_68_05_ВидыПлатежей
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Положительное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СККР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СККР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СККР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("60.03").Код, СКК_60_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.02").Код, СКК_62_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СККР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.22").Код, СКК_62_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.22")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СККР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.32").Код, СКК_62_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СККР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.ОТ").Код, СКК_62_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.ОТ")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("76.АВ").Код, -СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.04.2").Код, СКК_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
	Если ЭтоИП Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
	КонецЕсли;
	Если УчетС2018 Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
	КонецЕсли;
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.32").Код, СКК_68_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.32")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.42").Код, СКК_68_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.42")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СККР " + Счет("69.13").Код, СККР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	
	Если УчетНа70ВедетсяСводно Тогда
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("70").Код, СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
	Иначе
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 70, развернутое по субконто ""Работники организации""", СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
	КонецЕсли;
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 71, развернутое по субконто ""Работники организации""", СККР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 73.03, развернутое по субконто ""Работники организации""", СККР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("75.02").Код, СКК_75_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.02")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.04").Код, СКК_76_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.04")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.10, развернутое по субконто ""Работники организации""", СККР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.41, развернутое по субконто ""Контрагенты""", СККР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.49, развернутое по субконто ""Контрагенты""", СККР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.Н").Код, СКК_76_Н, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.Н")));
	
	НомерВРасшифровке = 15201;
	
	НомерСтроки = "15201";
	НаименованиеСтроки = "Расчеты с поставщиками и подрядчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_60_01_КонтрагентыДоговоры + СККР_60_21_КонтрагентыДоговоры + СККР_60_31_КонтрагентыДоговоры + СКК_60_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Положительное сальдо на конец периода по кредиту счета 60.01 по субконто ""Контрагенты"", ""Договоры""", СККР_60_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.21 по субконто ""Контрагенты"", ""Договоры""", СККР_60_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Положительное сальдо на конец периода по кредиту счета 60.31 по субконто ""Контрагенты"", ""Договоры""", СККР_60_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСККПоложительное(ОбщиеПараметрыРасшифровки, Счет("60.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("60.03").Код, СКК_60_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("60.03")));
	КонецЕсли;
	
	НомерСтроки = "15202";
	НаименованиеСтроки = "Расчеты с покупателями и заказчиками";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_62_02 + СККР_62_01_КонтрагентыДоговоры
		+ СКК_62_22 + СККР_62_21_КонтрагентыДоговоры
		+ СКК_62_32 + СККР_62_31_КонтрагентыДоговоры
		+ СКК_62_ОТ
		- СКД_76_АВ;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("62.02").Код, СКК_62_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.01 по субконто ""Контрагенты"", ""Договоры""", СККР_62_01_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.01")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.22").Код, СКК_62_22, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.22")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.21 по субконто ""Контрагенты"", ""Договоры""", СККР_62_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.32").Код, СКК_62_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Отрицательное сальдо на конец периода по дебету счета 62.31 по субконто ""Контрагенты"", ""Договоры""", СККР_62_31_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыСКДОтрицательное(ОбщиеПараметрыРасшифровки, Счет("62.31")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("62.ОТ").Код, СКК_62_ОТ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("62.ОТ")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "-", "!СКД " + Счет("76.АВ").Код, -СКД_76_АВ, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.АВ")));
	КонецЕсли;
	
	НомерСтроки = "15203";
	НаименованиеСтроки = "Расчеты по налогам и сборам";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_68_01_ВидыПлатежей + СККР_68_02_ВидыПлатежей + СККР_68_03_ВидыПлатежей
		+ СККР_68_04_1_ВидыПлатежейУровни + СКК_68_04_2
		+ СККР_68_06_ВидыПлатежей + СККР_68_07_ВидыПлатежей + СККР_68_08_ВидыПлатежей + СККР_68_09_ВидыПлатежей
		+ СККР_68_10_ВидыПлатежейУровни
		+ СККР_68_11_ВидыПлатежей + СККР_68_12_ВидыПлатежей + СККР_68_13_ВидыПлатежей
		+ ?(ЭтоИП, СККР_68_14_ВидыПлатежей, 0)
		+ ?(УчетС2018, СККР_68_34_ВидыПлатежей, 0)
		+ ?(УчетС2018, СККР_68_52_ВидыПлатежей, 0)
		+ ?(ЭтоИП, СККР_68_21_ВидыПлатежей, 0)
		+ СКК_68_32 + СКК_68_42;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 68.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.01")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.21, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_21_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.21")));
		КонецЕсли;
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.02, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_02_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.02")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.03, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_03_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.04.1, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_04_1_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.04.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.04.2").Код, СКК_68_04_2, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.04.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.06, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_06_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.07, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_07_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.07")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.08, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_08_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.08")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.09, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_09_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.10, развернутое по субконто ""Виды платежей в бюджет (фонды)"", ""Уровни бюджетов""", СККР_68_10_ВидыПлатежейУровни, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейУровниБюджетовРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.10")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.12")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.13, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_13_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.13")));
		Если ЭтоИП Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.14, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_14_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.14")));
		КонецЕсли;
		Если УчетС2018 Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.34, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_34_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.34")));
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 68.52, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_68_52_ВидыПлатежей, "Баланс", НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("68.52")));
		КонецЕсли;
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.32").Код, СКК_68_32, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.32")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("68.42").Код, СКК_68_42, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("68.42")));
	КонецЕсли;
	
	НомерСтроки = "15204";
	НаименованиеСтроки = "Расчеты по социальному страхованию и обеспечению";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_69_01_ВидыПлатежей
		+ СККР_69_02_1_ВидыПлатежей + СККР_69_02_2_ВидыПлатежей + СККР_69_02_3_ВидыПлатежей + СККР_69_02_4_ВидыПлатежей + СККР_69_02_5_ВидыПлатежей + СККР_69_02_6_ВидыПлатежей + СККР_69_02_7_ВидыПлатежей
		+ СККР_69_03_1_ВидыПлатежей + СККР_69_03_2_ВидыПлатежей
		+ СККР_69_04_ВидыПлатежей
		+ СККР_69_05_1_ВидыПлатежей + СККР_69_05_2_ВидыПлатежей
		+ СККР_69_06_1_ВидыПлатежей + СККР_69_06_2_ВидыПлатежей + СККР_69_06_3_ВидыПлатежей + СККР_69_06_4_ВидыПлатежей + СККР_69_06_5_ВидыПлатежей
		+ СККР_69_11_ВидыПлатежей + СККР_69_12_ВидыПлатежей
		+ СККР_69_13;
		
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 69.01, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_01_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.01")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.5")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.6, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_6_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.6")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.02.7, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_02_7_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.02.7")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.03.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_03_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.03.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.04, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_04_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.04")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.05.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_05_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.05.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.1, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_1_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.2, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_2_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.3, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_3_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.3")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.4, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_4_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.4")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.06.5, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_06_5_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.06.5")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.11, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_11_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.11")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 69.12, развернутое по субконто ""Виды платежей в бюджет (фонды)""", СККР_69_12_ВидыПлатежей, ИмяРаздела, НастройкиОСВПоСчетуВидыПлатежейРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.12")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СККР " + Счет("69.13").Код, СККР_69_13, ИмяРаздела, НастройкиОСВПоСчетуРазвернуто(ОбщиеПараметрыРасшифровки, Счет("69.13")));
	КонецЕсли;
	
	НомерСтроки = "15205";
	НаименованиеСтроки = "Расчеты с персоналом по оплате труда";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_70_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		Если УчетНа70ВедетсяСводно Тогда
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("70").Код, СККР_70_Работники, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("70")));
		Иначе
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 70, развернутое по субконто ""Работники организации""", СККР_70_Работники,  ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("70")));
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = "15206";
	НаименованиеСтроки = "Расчеты с подотчетными лицами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_71_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 71, развернутое по субконто ""Работники организации""", СККР_71_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("71")));
	КонецЕсли;
	
	НомерСтроки = "15209";
	НаименованиеСтроки = "Расчеты с персоналом по прочим операциям";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_73_03_Работники;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 73.03, развернутое по субконто ""Работники организации""", СККР_73_03_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("73.03")));
	КонецЕсли;
	
	НомерСтроки = "15207";
	НаименованиеСтроки = "Задолженность участникам (учредителям) по выплате доходов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_75_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("75.02").Код, СКК_75_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("75.02")));
	КонецЕсли;
	
	НомерСтроки = "15208";
	НаименованиеСтроки = "Расчеты с разными дебиторами и кредиторами";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_76_05_КонтрагентыДоговоры + СККР_76_25_КонтрагентыДоговоры + СККР_76_35_КонтрагентыДоговоры
		+ СККР_76_06_КонтрагентыДоговоры + СККР_76_26_КонтрагентыДоговоры + СККР_76_36_КонтрагентыДоговоры
		+ СККР_76_01_1_КонтрагентыДоговоры + СККР_76_21_КонтрагентыДоговоры + СККР_76_03_КонтрагентыДоговоры + СКК_76_04
		+ СККР_76_09_КонтрагентыДоговоры + СККР_76_29_КонтрагентыДоговоры + СККР_76_39_КонтрагентыДоговоры
		+ СККР_76_10_Работники
		+ СККР_76_41_Контрагенты + СККР_76_49_Контрагенты
		+ СККР_76_07_2_КонтрагентыДоговоры + СККР_76_27_2_КонтрагентыДоговоры + СККР_76_37_2_КонтрагентыДоговоры
		+ СККР_76_К_КонтрагентыДоговоры + СКК_76_Н;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 76.03, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_03_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.03")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.05, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_05_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.05")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.25, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_25_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.25")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.35, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_35_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.35")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.06, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_06_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.06")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.26, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_26_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.26")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.36, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_36_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.36")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.01.1, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_01_1_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.01.1")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.21, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_21_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.21")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.04").Код, СКК_76_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.04")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.09, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_09_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.09")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.29, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_29_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.29")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.39, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_39_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.39")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.10, развернутое по субконто ""Работники организации""", СККР_76_10_Работники, ИмяРаздела, НастройкиОСВПоСчетуРаботникиРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.10")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.41, развернутое по субконто ""Контрагенты""", СККР_76_41_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.41")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.49, развернутое по субконто ""Контрагенты""", СККР_76_49_Контрагенты, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.49")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.07.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_07_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.07.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.27.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_27_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.27.2")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.37.2, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_37_2_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.37.2")));
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "Сальдо на конец периода по кредиту счета 76.К, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_К_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.К")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("76.Н").Код, СКК_76_Н, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("76.Н")));
		
	КонецЕсли;
	
	НомерСтроки = "1530";
	НаименованиеСтроки = "Доходы будущих периодов";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_86    = СКК("86", СальдоИОборотыПоСчетам);
	СКК_98    = СКК("98", СальдоИОборотыПоСчетам);
	СКК_98_01 = СКК("98.01", СальдоИОборотыПоСчетам);
	СКК_98_02 = СКК("98.02", СальдоИОборотыПоСчетам);
	СКК_98_03 = СКК("98.03", СальдоИОборотыПоСчетам);
	СКК_98_04 = СКК("98.04", СальдоИОборотыПоСчетам);
	
	НомерВРасшифровке = 15301;
	
	Если ИдентификаторАвтозаполнения = "БалансНКО" Тогда
		ЗначениеПоказателя = СКК_98;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98").Код, СКК_98, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98")));
		
	ИначеЕсли ИдентификаторАвтозаполнения = "Баланс" Тогда
		ЗначениеПоказателя = СКК_86 + СКК_98;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("86").Код, СКК_86, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("86")));
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("98").Код, СКК_98, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98")));
		
		НомерСтроки = "15301";
		НаименованиеСтроки = "Целевое финансирование";
		
		Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
			ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
			ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
			
			ЗначениеПоказателя = СКК_86;
			УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
			
			ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("86").Код, СКК_86, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("86")));
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтроки = "15302";
	НаименованиеСтроки = "Доходы, полученные в счет будущих периодов";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.01").Код, СКК_98_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.01")));
	КонецЕсли;
	
	НомерСтроки = "15303";
	НаименованиеСтроки = "Безвозмездные поступления";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_02;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.02").Код, СКК_98_02, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.02")));
	КонецЕсли;
	
	НомерСтроки = "15304";
	НаименованиеСтроки = "Предстоящие поступления по недостачам, выявленным за прошлые годы";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_03;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.03").Код, СКК_98_03, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.03")));
	КонецЕсли;
	
	НомерСтроки = "15305";
	НаименованиеСтроки = "Разница между суммой, подлежащей взысканию с виновных лиц, и балансовой стоимостью по недостачам ценностей";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_98_04;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("98.04").Код, СКК_98_04, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("98.04")));
	КонецЕсли;
	
	НомерСтроки = "1540";
	НаименованиеСтроки = "Оценочные обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СККР_96_09_Резервы = СККР("96.09", СиО_Резервы);
	СКК_96_01 = СККР("96.01", СальдоИОборотыПоСчетамРазвернутое_9601); //ЮЦАУ //СКК("96.01", СальдоИОборотыПоСчетам)
	
	ЗначениеПоказателя = СККР_96_09_Резервы + СКК_96_01;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СККР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, "", "+", "!СКК " + Счет("96.01").Код, СКК_96_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("96.01")));
	
	НомерВРасшифровке = 15401;
	
	НомерСтроки = "15401";
	НаименованиеСтроки = "Оценочные обязательства по вознаграждениям работников";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СКК_96_01;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "!СКК " + Счет("96.01").Код, СКК_96_01, ИмяРаздела, НастройкиОСВПоСчету(ОбщиеПараметрыРасшифровки, Счет("96.01")));
	КонецЕсли;
	
	НомерСтроки = "15402";
	НаименованиеСтроки = "Резервы предстоящих расходов прочие";
	
	Если ВключатьДопстрокуВОтчет(ДеревоНастроекСтрокРасшифровки, "ДопСтрока" + НомерСтроки) Тогда
		ИмяОбластиПоказателя = "П00010" + НомерСтроки + Графа;
		ЗаголовокРасшифровки = ЗаголовокРасшифровкиПоСчетчику(НомерВРасшифровке, НаименованиеСтроки, ЗаголовокГрафы);
		
		ЗначениеПоказателя = СККР_96_09_Резервы;
		УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
		
		ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 96.09, развернутое по субконто ""Оценочные обязательства и резервы""", СККР_96_09_Резервы, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("96.09")));
	КонецЕсли;
	
	НомерСтроки = "1550";
	НаименованиеСтроки = "Прочие обязательства";
	
	ИмяОбластиПоказателя = "П000100" + НомерСтроки + Графа;
	ЗаголовокРасшифровки = "Строка " + НомерСтроки + " """ + НаименованиеСтроки + """, графа """ + ЗаголовокГрафы + """";
	
	СКК_76_ВА = СКК("76.ВА", СальдоИОборотыПоСчетам);
	
	ЗначениеПоказателя = СККР_76_НА_КонтрагентыДоговоры;
	УстановитьЗначениеПоказателя(РассчитанныеПоказатели, ИмяРаздела, ИмяОбластиПоказателя, ЗначениеПоказателя);
	
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки, ИмяОбластиПоказателя, ЗаголовокРасшифровки, "+", "Сальдо на конец периода по кредиту счета 76.НА, развернутое по субконто ""Контрагенты"", ""Договоры""", СККР_76_НА_КонтрагентыДоговоры, ИмяРаздела, НастройкиОСВПоСчетуКонтрагентыДоговорыРазвернуто(ОбщиеПараметрыРасшифровки, Счет("76.НА")));
	
КонецПроцедуры

Функция СальдоИОборотыПоСчетамРазвернутое_9601(Организация,НачалоПериодаОтчета,КонецПериодаОтчета) //ЮЦАУ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	ХозрасчетныйОстаткиИОбороты.Счет.Вид КАК ВидСчета,
		|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт КАК СуммаНачальныйРазвернутыйОстатокДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт КАК СуммаНачальныйРазвернутыйОстатокКт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК СуммаКонечныйРазвернутыйОстатокДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК СуммаКонечныйРазвернутыйОстатокКт
		|ПОМЕСТИТЬ втВыборка
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет В ИЕРАРХИИ (&счет96), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблица.СуммаНачальныйРазвернутыйОстатокДт) КАК СуммаНачальныйРазвернутыйОстатокДт,
		|	СУММА(ВременнаяТаблица.СуммаНачальныйРазвернутыйОстатокКт) КАК СуммаНачальныйРазвернутыйОстатокКт,
		|	СУММА(ВременнаяТаблица.СуммаОборотДт) КАК СуммаОборотДт,
		|	СУММА(ВременнаяТаблица.СуммаОборотКт) КАК СуммаОборотКт,
		|	СУММА(ВременнаяТаблица.СуммаКонечныйРазвернутыйОстатокКт) КАК СуммаКонечныйРазвернутыйОстатокКт,
		|	СУММА(ВременнаяТаблица.СуммаКонечныйРазвернутыйОстатокДт) КАК СуммаКонечныйРазвернутыйОстатокДт,
		|	&счет96 КАК Счет,
		|	ВременнаяТаблица.ВидСчета КАК ВидСчета
		|ПОМЕСТИТЬ втГруппировка
		|ИЗ
		|	втВыборка КАК ВременнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.ВидСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГруппировка.Счет КАК Счет,
		|	втГруппировка.ВидСчета КАК ВидСчета,
		|	втГруппировка.СуммаНачальныйРазвернутыйОстатокДт КАК СуммаНачальныйРазвернутыйОстатокДт,
		|	втГруппировка.СуммаНачальныйРазвернутыйОстатокКт КАК СуммаНачальныйРазвернутыйОстатокКт,
		|	втГруппировка.СуммаОборотДт КАК СуммаОборотДт,
		|	втГруппировка.СуммаОборотКт КАК СуммаОборотКт,
		|	втГруппировка.СуммаКонечныйРазвернутыйОстатокКт КАК СуммаКонечныйРазвернутыйОстатокКт,
		|	втГруппировка.СуммаКонечныйРазвернутыйОстатокДт КАК СуммаКонечныйРазвернутыйОстатокДт
		|ИЗ
		|	втГруппировка КАК втГруппировка";
	

	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонецПериодаОтчета));
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачалоПериодаОтчета));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("счет96", ПланыСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениямРаботникам);
	
	СальдоИОборотыПоСчетамРазвернутое = Запрос.Выполнить().Выгрузить();
	
	Возврат(СальдоИОборотыПоСчетамРазвернутое);
	
КонецФункции	






