
Процедура ОсновныеДействияФормыНастройка(Кнопка)

	//ОбщегоНазначения.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(),Ссылка,ЭтотОбъект);

КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

Функция РазностьДатВДнях(Дата1, Дата2)
	мДлинаСуток = 86400; // в секундах
	Возврат Окр((НачалоДня(Дата1) - НачалоДня(Дата2)) / мДлинаСуток);
КонецФункции

Процедура КоманднаяПанельОчистить(Кнопка)
	//ТабЧасть.Очистить();
	//ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
КонецПроцедуры

Функция ВыручкаЗаПериод()
	
	НачалоПериода = Объект.НачалоПериода;
	КонецПериода = Объект.КонецПериода;
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
	Запрос.УстановитьПараметр("КорСчет",ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	
	Запрос.Текст = "ВЫБРАТЬ
				   |	ХозрасчетныйОбороты.СуммаОборотКт КАК ВыручкаВсего
				   |ИЗ
				   |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , , , ) КАК ХозрасчетныйОбороты
				   |ГДЕ
				   |	ХозрасчетныйОбороты.Организация = &Организация
				   |	И ХозрасчетныйОбороты.Счет      = &Счет
				   |	И ХозрасчетныйОбороты.КорСчет   = &КорСчет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
			ВыручкаВсего = Выборка.ВыручкаВсего;
	Иначе ВыручкаВсего=1;		
	КонецЕсли;
	
	Возврат ВыручкаВсего;	
КонецФункции

Функция ВыборкаЗадолженностиКонтрагентов()
	
	ЮрФизЛицо = Объект.ЮрФизЛицо;
	НачалоПериода = НачалоДня(Объект.НачалоПериода);
	КонецПериода = КонецДня(Объект.КонецПериода);
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",Новый Граница(КонецПериода,ВидГраницы.Включая));
    Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.РасчетыСПокупателями); 
	
	Если ЮрФизЛицо = Перечисления.УдалитьЮрФизЛицо.ФизЛицо Тогда
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо; 
	Иначе
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
	КОнецЕсли;	
	Запрос.УстановитьПараметр("ЮрЛицо",ЮридическоеФизическоеЛицо);
	
	Запрос.Текст = "ВЫБРАТЬ
	        |ХозрасчетныйОбороты.Счет КАК Счет,
			|ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
			|ХозрасчетныйОбороты.Субконто2 КАК Договор,
			|ХозрасчетныйОбороты.Субконто3 КАК ДокументРасчетов,
			|ХозрасчетныйОбороты.Субконто3.Дата КАК ДатаРасчетов,
			|ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаДолга,
			|ХозрасчетныйОбороты1.СуммаОборотДт КАК ВыручкаКонтрагента,
			|ХозрасчетныйОбороты1.СуммаОборотДт - ХозрасчетныйОбороты1.СуммаОборотКт КАК ДолгКонтрагента 
		    |ИЗ
			|РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , Субконто1.ЮридическоеФизическоеЛицо = &ЮрЛицо, , ) КАК ХозрасчетныйОбороты
		    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , Субконто1.ЮридическоеФизическоеЛицо = &ЮрЛицо, , ) КАК ХозрасчетныйОбороты1
		    |ПО  ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты1.Субконто1				
		    |ГДЕ
			|ХозрасчетныйОбороты1.Организация = &Организация
			|И ХозрасчетныйОбороты.Организация = &Организация
			|И ХозрасчетныйОбороты1.Счет = &Счет
			|И ХозрасчетныйОбороты.Счет = &Счет
			|И ХозрасчетныйОбороты1.СуммаОборотДт > ХозрасчетныйОбороты1.СуммаОборотКт
			|И ХозрасчетныйОбороты.СуммаОборотДт > ХозрасчетныйОбороты.СуммаОборотКт
		    |УПОРЯДОЧИТЬ ПО
			|ХозрасчетныйОбороты.Субконто1.Наименование,
			|ДатаРасчетов";
			
    Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЮрФизЛицо = Объект.ЮрФизЛицо;
	КонецПериода = КонецДня(Объект.КонецПериода);
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана организация !");
		Сообщение.Сообщить();
	КонецЕсли;

	Если ЮрФизЛицо = Перечисления.УдалитьЮрФизЛицо.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрано Юр/физ. лицо!");
		Сообщение.Сообщить();
	КонецЕсли; 
	
	ТабЧасть.Очистить();
	ВыручкаВсего = ВыручкаЗаПериод(); 
	КолДней = День(КонецПериода);
	Выборка = ВыборкаЗадолженностиКонтрагентов();	
	Пока Выборка.Следующий() Цикл
		СрокЗадержки = РазностьДатВДнях(КонецПериода,Выборка.ДатаРасчетов);
		Если (СрокЗадержки >= КолДней) И (Выборка.СуммаДолга>=1000) Тогда  
			СтрТабЧасти = ТабЧасть.Добавить();
			СтрТабЧасти.СчетРасчетов         = Выборка.Счет;
			СтрТабЧасти.Контрагент           = Выборка.Контрагент;
			СтрТабЧасти.Договор              = Выборка.Договор;
			СтрТабЧасти.ДокументРасчетов     = Выборка.ДокументРасчетов;					
			СтрТабЧасти.СуммаДолга           = Выборка.СуммаДолга;
			СтрТабЧасти.СрокЗадержки         = СрокЗадержки;
			Если (СрокЗадержки <= 90)Тогда Коэфф = 0.1;
			ИначеЕсли (СрокЗадержки > 90)  И (СрокЗадержки <= 180) Тогда Коэфф = 0.2;
			ИначеЕсли (СрокЗадержки > 180) И (СрокЗадержки <= 270) Тогда Коэфф = 0.3;
			ИначеЕсли (СрокЗадержки > 270) Тогда Коэфф = 0.5;
			КонецЕсли;
			СтрТабЧасти.Коэффициент          = Коэфф;
			СтрТабЧасти.СуммаНачисления      = Коэфф*Выборка.СуммаДолга;					
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
         ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораПериода",ЭтотОбъект);
         ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода",,,,,,ОписаниеОповещения);

КонецПроцедуры                                                                    

&НаКлиенте                                                                         
Процедура РезультатВыбораПериода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Объект.НачалоПериода = НачалоДня(Результат.НачалоПериода);
		Объект.КонецПериода = КонецДня(Результат.КонецПериода); 
	КонецЕсли;

КонецПроцедуры