
&ИзменениеИКонтроль("СформироватьДвиженияНачислениеЗарплаты")
Процедура Расш1_СформироватьДвиженияНачислениеЗарплаты(Движения, Отказ, Организация, Знач ПериодРегистрации, ДанныеДляОтражения)

	Дополнять         = Ложь;
	Реквизиты         = Неопределено;
	Регистратор       = Движения.Хозрасчетный.Отбор.Регистратор.Значение;
	ПериодРегистрации = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);

	Если ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
		Параметры = ПодготовитьПараметрыПоОтражениюЗарплатыВУчете(ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы, Организация, ПериодРегистрации, Регистратор);
		Реквизиты = Параметры.Реквизиты[0];
		ТаблицаЗаработнойПлаты = Параметры.ТаблицаЗаработнойПлаты;
		Если ТаблицаЗаработнойПлаты.Колонки.Найти("РегистрацияВНалоговомОргане") = Неопределено Тогда
			Массив = Новый Массив;
			Массив.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
			ТаблицаЗаработнойПлаты.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов(Массив, , ));
		КонецЕсли;
		РазвернутьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты);
		Дополнять = Истина;
	КонецЕсли;

	Если ДанныеДляОтражения.Свойство("НачисленныйНДФЛ") Тогда
		ПараметрыНДФЛ = ПодготовитьПараметрыПоОтражениюНДФЛВУчете(ДанныеДляОтражения.НачисленныйНДФЛ, Организация, ПериодРегистрации, Регистратор);
		ТаблицаНДФЛ = ПараметрыНДФЛ.ТаблицаНДФЛ;
		Если Реквизиты = Неопределено Тогда
			Реквизиты = ПараметрыНДФЛ.Реквизиты[0];
		КонецЕсли;

		ПроверитьЗаполненностьРегистрацииВНалоговомОргане(ТаблицаНДФЛ, Реквизиты, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		ТаблицаНДФЛ = ДополнитьТаблицуНДФЛАналитикойПоРегистрации(ТаблицаНДФЛ, Организация);
		Если Дополнять Тогда
			ТаблицаЗаработнойПлаты = ДополнитьТаблицуЗаработнойПлатыДаннымиПоНДФЛ(ТаблицаЗаработнойПлаты, ТаблицаНДФЛ, Организация, ПериодРегистрации, Регистратор);
		Иначе
			ТаблицаЗаработнойПлаты = ТаблицаНДФЛ;
			ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
			Дополнять = Истина;
		КонецЕсли;

	КонецЕсли;

	ОчиститьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты);

	СинхронизироватьПодразделенияИРегистрацииВНалоговомОргане(ТаблицаЗаработнойПлаты, Реквизиты);

	ТаблицаЗаработнойПлаты = ДополнитьТаблицуЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты);

	РаспределитьЗарплатуПоВидамДеятельности(ТаблицаЗаработнойПлаты, Организация, ПериодРегистрации);

	ПроверитьЗаполненностьСпособаОтраженияВУчете(ТаблицаЗаработнойПлаты, Реквизиты);
	
	#Вставка
	ЮЦАУ.РаспределитьЗарплату(ТаблицаЗаработнойПлаты, Реквизиты);
    #КонецВставки
	
	СформироватьПроводкиПоОтражениюЗарплатыВУчете(ТаблицаЗаработнойПлаты, Реквизиты, Движения, Отказ);

	// Проведение по подсистеме УСН
	УдержаннаяЗарплата = Неопределено;
	ДанныеДляОтражения.Свойство("УдержаннаяЗарплата", УдержаннаяЗарплата);

	СформироватьДвиженияПоРегистрамУСННачислениеЗарплаты(Параметры, ТаблицаЗаработнойПлаты, УдержаннаяЗарплата, Реквизиты, Движения, Отказ);

	// Учет доходов и расходов ИП
	СформироватьДвиженияПоРегистрамИПНачислениеЗарплаты(Параметры, ТаблицаЗаработнойПлаты, Реквизиты, Движения, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДвиженияНачислениеРезервов")
Процедура Расш1_СформироватьДвиженияНачислениеРезервов(Движения, Отказ, Организация, Знач ПериодРегистрации, ДанныеПоРезервам)

	Регистратор       = Движения.Хозрасчетный.Отбор.Регистратор.Значение;
	ПериодРегистрации = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);

	Если ДанныеПоРезервам.Колонки.Найти("ОблагаетсяЕНВД") = Неопределено Тогда
		ДанныеПоРезервам.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	КонецЕсли;

	Параметры         = ПодготовитьПараметрыПоОтражениюРезервовВУчете(ДанныеПоРезервам, Организация, ПериодРегистрации, Регистратор);
	Реквизиты         = Параметры.Реквизиты[0];
	ТаблицаРезервов   = Параметры.ТаблицаРезервов;

	РазвернутьТаблицуРезервов(ТаблицаРезервов, Реквизиты);

	СкорректироватьТаблицуРезервов(ТаблицаРезервов, Реквизиты);

	ТаблицаРезервов = ДополнитьТаблицуРезервовАналитикойБухУчета(ТаблицаРезервов, Реквизиты);

	ПроверитьЗаполненностьСпособаОтраженияВУчетеРезервов(ТаблицаРезервов, Реквизиты);
	
	#Вставка     
	ЮЦАУ.РаспределитьНачислениеРезервов(ТаблицаРезервов, Реквизиты);
	#КонецВставки
	
	СформироватьПроводкиПоОтражениюРезервовВУчете(ТаблицаРезервов, Реквизиты, Движения, Отказ);

КонецПроцедуры
