Процедура ОбработкаПроведения(Отказ,Режим)
		
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана организация");
		Возврат;
	КонецЕсли;
	
	Если ПрочиеДоходыИРасходы = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана статья расходов");
		Возврат;
	КонецЕсли;
	
	Если НаименованиеРезерва = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Сообщить ("Не выбрано наименование резерва");
		Возврат;
	КонецЕсли;	
	Для Каждого ТекСтрока Из ТабЧасть Цикл
			Движение = Движения.Хозрасчетный.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы] = ПрочиеДоходыИРасходы;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РеализуемыеАктивы] = НаименованиеРезерва;
           	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = ТекСтрока.Контрагент;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры]    = ТекСтрока.Договор;
			Движение.Сумма = ТекСтрока.СуммаНачисления;
			Если УчетНУ Тогда
				Движение.СуммаНУДт = ТекСтрока.СуммаНачисления;
			Иначе 
				Движение.СуммаНУДт = 0;
				Движение.СуммаНУКт = 0;
			КонецЕсли;
			Движение.Содержание = "Начисление резерва по сомнительным долгам"
		КонецЦикла;
		
		Если НЕ УчетНУ Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("СуммыНалоговогоУчетаЗаполнены",Истина);
			Движения.Хозрасчетный.ДополнительныеСвойства.Вставить("СуммыНалоговогоУчетаЗаполнены", Истина);
		КонецЕсли;

КонецПроцедуры
