Процедура ОбработкаПроведения(Отказ,Режим)
	
	Для Каждого ТекСтрока Из ТабЧасть Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = ТекСтрока.СчетЗатрат;
			Движение.ПодразделениеДт = ТекСтрока.ПодразделениеЗатрат;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = ТекСтрока.СтатьяЗатрат;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.ТранспортныйНалог;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет] = ВидыПлатежейВГосБюджет;
			Движение.Сумма = ТекСтрока.СуммаНалога;
			Движение.СуммаНУДт = ТекСтрока.СуммаНалога;
	КонецЦикла;
	
	Движения.НачисленияПоТранспортномуНалогу.Очистить();
	Для Каждого ТекСтрока Из ТабЧасть Цикл
		Движение = Движения.НачисленияПоТранспортномуНалогу.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТранспортноеСредство = ТекСтрока.ТранспортноеСредство;
		Движение.СуммаНалога = ТекСтрока.СуммаНалога;
	КонецЦикла;
  
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
