#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

Процедура ЗаполнитьКраткийСоставДокумента()
	
	МассивПодразделенияКт = Новый Массив;
	Для Каждого СтрокаТаблица Из НастройкаЗакрытия Цикл
		МассивПодразделенияКт.Добавить(СтрокаТаблица.ПодразделениеКт25);
	КонецЦикла;
	
	КраткийСоставДокумента = Неопределено;
	МассивПодразделенияКт = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивПодразделенияКт);
	КраткийСоставДокумента = СтрСоединить(МассивПодразделенияКт,", ");
	
КонецПроцедуры


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКраткийСоставДокумента();	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для Каждого ТекСтрока Из НастройкаЗакрытия Цикл
		
		НовоеДвижение = Движения.ЮЦАУ_НастройкиЗакрытияСчета25_02.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, ТекСтрока);

		НовоеДвижение.Период = Дата;
		НовоеДвижение.ПериодДействия = Дата;
		НовоеДвижение.Организация = Организация;
		НовоеДвижение.ПодразделениеДт20 = ПодразделениеДт20;
		НовоеДвижение.ПодразделениеКт25 = ПодразделениеКт25;
			
	КонецЦикла;	
	
	Движения.ЮЦАУ_НастройкиЗакрытияСчета25_02.Записать(Истина);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли