 
 
&Вместо("ПодготовитьДанныеДляЗаполнения")
Процедура Расш1_ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища)
	               
	УстановитьПривилегированныйРежим(Истина);
	СтруктураДанныхЗаполнения = Новый Структура();
	СтруктураДанныхЗаполнения.Вставить("Успешно", Ложь);
	
	Если НЕ ПроверитьОтложенныеРасчеты(СтруктураПараметров) Тогда
		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	// Подготовим переменные
	СчетаИсключения             = СчетаИсключения();
	ТаблицаПоДаннымОрганизации = НовыйТаблицаДокументов();
	КэшМетаданных              = Новый Соответствие; // Используется для получения представления документов
	Запрос = ПодготовитьЗапрос(СтруктураПараметров, СчетаИсключения);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЭтоЭлектронныйДокумент = Ложь;
	Если СтруктураПараметров.Свойство("ЭтоЭлектронныйДокумент") Тогда
		ЭтоЭлектронныйДокумент = СтруктураПараметров.ЭтоЭлектронныйДокумент;
	КонецЕсли;
	
	// Остаток на начало
	ВыборкаОстатокНаНачало = РезультатЗапроса[1].Выбрать();
	ВыборкаОстатокНаНачало.Следующий();
	СтруктураДанныхЗаполнения.Вставить("ОстатокНаНачало", ВыборкаОстатокНаНачало.ОстатокНаНачало);
	
	// Первоначальное заполнение таблицы по данным организации
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Дебет = 0 И Выборка.Кредит = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоДаннымОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Счет               = Выборка.Счет.Родитель; //ЮЦАУ
		РеквизитыДокумента = РеквизитыДокумента(
			СтруктураПараметров,
			Выборка,
			КэшМетаданных,
			СчетаИсключения);
			
		Если РеквизитыДокумента.НомерДокумента = "" Тогда
			ТекстПередДатой = "";
		Иначе
			ТекстПередДатой = " " + НСтр("ru='от'") + " ";
		КонецЕсли;
		
		ДатаДокументаТекст = ТекстПередДатой + Формат(РеквизитыДокумента.ДатаДокумента, "ДЛФ=D; ДП='  .  .    '");
		
		НоваяСтрока.Представление  = СтрШаблон("%1 (%2%3)",
			РеквизитыДокумента.Представление,
			РеквизитыДокумента.НомерДокумента,
			ДатаДокументаТекст);
			
		Если ЭтоЭлектронныйДокумент Тогда
			Если РеквизитыДокумента.НомерДокумента = "" Тогда
				НоваяСтрока.НомерДокумента = НСтр("ru='б/н'");
			Иначе
				НоваяСтрока.НомерДокумента = РеквизитыДокумента.НомерДокумента;
			КонецЕсли;
			НоваяСтрока.ДатаДокумента  = РеквизитыДокумента.ДатаДокумента;
			НоваяСтрока.НаименованиеДокумента = Строка(ТипЗнч(Выборка.Документ));
			НоваяСтрока.НаименованиеОперации = РеквизитыДокумента.НаименованиеОперации;
		КонецЕсли;
		
	КонецЦикла;
	
	// Дополним таблицу валютной суммой
	ДополнитьТаблицуВалютнойСуммой(ТаблицаПоДаннымОрганизации, СтруктураПараметров);
	
	// Дополним таблицу счетами-фактурами
	ДополнитьТаблицуСчетамиФактурами(ТаблицаПоДаннымОрганизации, СтруктураПараметров);
	
	// Сортируем таблицу
	КолонкиДляСортировки = ?(СтруктураПараметров.РазбитьПоДоговорам, 
		"Договор, Дата, Документ, Представление, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации",
		"Дата, Документ, Представление, Договор, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации");
	ТаблицаПоДаннымОрганизации.Сортировать(КолонкиДляСортировки, Новый СравнениеЗначений);
	
	// Заполним возвращаемую структуру
	СтруктураДанныхЗаполнения.Вставить("ПоДаннымОрганизации", ТаблицаПоДаннымОрганизации);
	Если СтруктураПараметров.ЗаполнятьДанныеКонтрагента Тогда
		СтруктураДанныхЗаполнения.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента(ТаблицаПоДаннымОрганизации));
	КонецЕсли;
	СтруктураДанныхЗаполнения.Успешно = Истина;
	ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
	
КонецПроцедуры


&Вместо("НовыйТаблицаДокументов")
Функция Расш1_НовыйТаблицаДокументов()
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Договор",                     Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДокументов.Колонки.Добавить("Дата",                        ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументов.Колонки.Добавить("Документ",                    Документы.ТипВсеСсылки());
	ТаблицаДокументов.Колонки.Добавить("Представление",               ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаДокументов.Колонки.Добавить("Дебет",                       ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаДокументов.Колонки.Добавить("Кредит",                      ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаДокументов.Колонки.Добавить("Валюта",                      Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДокументов.Колонки.Добавить("ВалютнаяСумма",               ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаДокументов.Колонки.Добавить("ДатаВходящегоДокумента",      ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументов.Колонки.Добавить("ЭтоУниверсальныйДокумент",    Новый ОписаниеТипов("Булево"));
	ТаблицаДокументов.Колонки.Добавить("ЭтоКорректировочныйДокумент", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументов.Колонки.Добавить("ДатаДокумента",               ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументов.Колонки.Добавить("НомерДокумента",              ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаДокументов.Колонки.Добавить("НаименованиеДокумента",       ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДокументов.Колонки.Добавить("НаименованиеОперации",        ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаДокументов.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный")); //ЮЦАУ

	Возврат ТаблицаДокументов;

КонецФункции

&Вместо("ДополнитьТаблицуВалютнойСуммой")
Процедура Расш1_ДополнитьТаблицуВалютнойСуммой(ТаблицаПоДаннымОрганизации, СтруктураПараметров)
	
	Если СтруктураПараметров.ВалютаДокумента = СтруктураПараметров.ВалютаРегламентированногоУчета 
		И НЕ СтруктураПараметров.ВыводитьПолныеНазванияДокументов Тогда
		
		ТаблицаПоДаннымОрганизации.Свернуть(
		"Дата,ДатаВходящегоДокумента,Документ,Представление,Договор,Валюта,ЭтоУниверсальныйДокумент,
		|ЭтоКорректировочныйДокумент,НомерДокумента,ДатаДокумента,НаименованиеДокумента,НаименованиеОперации,Счет", //ЮЦАУ
		"Дебет, Кредит, ВалютнаяСумма");
		
		Для Каждого СтрокаТаблицы Из ТаблицаПоДаннымОрганизации Цикл
			Если СтрокаТаблицы.ВалютнаяСумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ШаблонСтрокиСВалютнойСуммой = "[Представление] ([ВалютнаяСумма] [Валюта])";
			ПараметрыСтроки = Новый Структура;
			ПараметрыСтроки.Вставить("Представление", СтрокаТаблицы.Представление);
			ПараметрыСтроки.Вставить("ВалютнаяСумма", 0);
			ПараметрыСтроки.Вставить("Валюта",        СтрокаТаблицы.Валюта);
			
			Если СтрокаТаблицы.ВалютнаяСумма > 0 Тогда
				ПараметрыСтроки.ВалютнаяСумма = Формат(СтрокаТаблицы.ВалютнаяСумма, "ЧЦ=15; ЧДЦ=2");
			Иначе
				Множитель = ?((СтрокаТаблицы.Дебет + СтрокаТаблицы.Кредит) > 0, -1, 1);
				ПараметрыСтроки.ВалютнаяСумма = Формат(Множитель * СтрокаТаблицы.ВалютнаяСумма, "ЧЦ=15; ЧДЦ=2");
			КонецЕсли;
			СтрокаТаблицы.Представление = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			ШаблонСтрокиСВалютнойСуммой,
			ПараметрыСтроки);
		КонецЦикла;
		
	Иначе
		ТаблицаПоДаннымОрганизации.Свернуть(
		"Дата,ДатаВходящегоДокумента,Документ,Представление,Договор,ЭтоУниверсальныйДокумент,
		|ЭтоКорректировочныйДокумент,НомерДокумента,ДатаДокумента,НаименованиеДокумента,НаименованиеОперации,Счет", //ЮЦАУ
		"Дебет, Кредит");
	КонецЕсли;
	
	ПустыеСтроки = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаПоДаннымОрганизации Цикл
		Если СтрокаТаблицы.Дебет = 0 И СтрокаТаблицы.Кредит = 0 Тогда
			ПустыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		ТаблицаПоДаннымОрганизации.Удалить(ПустаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

