
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ТребованиеНакладная.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// Таблица списанных материалов
	ТаблицаСписанныеМатериалы = УчетТоваров.ПодготовитьТаблицуСписанныеТовары(
	ПараметрыПроведения.ТаблицаМатериалы, ПараметрыПроведения.МатериалыРеквизиты, Отказ);

	// Таблица списанных материалов заказчика
	ТаблицаСписанныеМатериалыЗаказчика = УчетТоваров.ПодготовитьТаблицуСписанныеТовары(
	ПараметрыПроведения.ТаблицаМатериалыЗаказчика, ПараметрыПроведения.МатериалыЗаказчикаРеквизиты, Отказ);

	// Структура таблиц для отражения в налоговом учете УСН
	ТаблицаСписанныеПартииНДС = УчетУСН.ПодготовитьТаблицуСписанныеПартииНДС(
	ПараметрыПроведения.НДСМатериалы, ТаблицаСписанныеМатериалы, ПараметрыПроведения.НДСРеквизиты, Отказ);

	СтруктураТаблицУСН = Новый Структура("ТаблицаТМЦ, ТаблицаСписанныеПартииНДС",
	ТаблицаСписанныеМатериалы, ТаблицаСписанныеПартииНДС);

	// Учет доходов и расходов ИП
	ТаблицыМатериаловПродукцииИП = Документы.ТребованиеНакладная.ПодготовитьТаблицыМатериаловПродукцииИП(
	ТаблицаСписанныеМатериалы, ПараметрыПроведения.ИПРеквизиты);

	ТаблицыСписанияМПЗИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыСписанияМПЗ(
	ТаблицыМатериаловПродукцииИП.ТаблицаМатериалов, ПараметрыПроведения.ИПРеквизиты, Отказ);

	ТаблицаПоступлениеПродукцииИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступлениеПродукции(
	ТаблицыМатериаловПродукцииИП.ПолученоПродукции, ПараметрыПроведения.ИПРеквизиты);

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
    #Вставка
	//ЮЦАУ                 
	Параметры = ПараметрыПроведения.МатериалыРеквизиты[0];
	ЮЦАУ.РаспределитьСписаниеТоваров(ТаблицаСписанныеМатериалы, Параметры);
	//ЮЦАУ
    #КонецВставки
	// Списание материалов
	УчетТоваров.СформироватьДвиженияСписаниеТоваров(
	ТаблицаСписанныеМатериалы, ПараметрыПроведения.МатериалыРеквизиты, Движения, Отказ);
	УчетТоваров.СформироватьДвиженияСписаниеТоваров(
	ТаблицаСписанныеМатериалыЗаказчика, ПараметрыПроведения.МатериалыЗаказчикаРеквизиты, Движения, Отказ);

	УчетМатериаловВЭксплуатации.СформироватьДвиженияПередачаМатериаловСотруднику(
	ПараметрыПроведения.ПередачаМатериаловСотрудникуТаблица,
	ТаблицаСписанныеМатериалы,
	ПараметрыПроведения.ПередачаМатериаловСотрудникуРеквизиты,
	Движения, Отказ);

	УчетТоваров.СформироватьДвиженияПоступлениеТарыВЭксплуатацию(ТаблицаСписанныеМатериалы,
	ПараметрыПроведения.ВозвратнаяТараТаблица,
	ПараметрыПроведения.ВозвратнаяТараРеквизиты, Движения, Отказ);

	// Учет НДС
	УчетНДСБП.СформироватьДвиженияСписаниеТоваровНаРасходы(
	ПараметрыПроведения.НДСМатериалы, ТаблицаСписанныеМатериалы, ПараметрыПроведения.НДСРеквизиты, Движения, Отказ);

	// Учет УСН
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);

	// Учет прослеживаемых товаров
	ТаблицыПрослеживаемости = ПодготовитьТаблицыДляПереносаРНПТНаОС(
	ПараметрыПроведения.ПрослеживаемыеТовары,
	ПараметрыПроведения.МатериалыРеквизиты,
	ПараметрыПроведения.ПрослеживаемыеОперации);

	ПрослеживаемыеОперации = ПрослеживаемостьБП.ПодготовитьТаблицуПоПрослеживаемымОперациям(
	ТаблицыПрослеживаемости.ПрослеживаемыеОперации, ТаблицаСписанныеМатериалы);

	ПрослеживаемостьБП.СформироватьДвиженияРеализацияТоваров(
	ПараметрыПроведения.ПрослеживаемыеТовары,
	ТаблицыПрослеживаемости.ПрослеживаемыеОперации,
	ПараметрыПроведения.МатериалыРеквизиты,
	Движения);

	ПрослеживаемостьБП.СформироватьДвиженияПоступлениеТоваров(
	ПараметрыПроведения.ПрослеживаемыеТоварыВСоставеработ,
	Неопределено,
	Неопределено,
	ПараметрыПроведения.МатериалыРеквизиты,
	Движения);

	ПрослеживаемостьБП.СформироватьДвиженияПоступлениеОС(
	ТаблицыПрослеживаемости.ПрослеживаемыеОС,
	Неопределено,
	Неопределено,
	ПараметрыПроведения.МатериалыРеквизиты,
	Движения);

	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияСписаниеМПЗ(
	ТаблицыСписанияМПЗИП, ПараметрыПроведения.ИПРеквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеПродукции(
	ТаблицаПоступлениеПродукцииИП, ТаблицыСписанияМПЗИП.СтоимостьПродукции, 
	ПараметрыПроведения.ИПРеквизиты, Движения, Отказ);

	// Регистрация в последовательности
	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
	ЭтотОбъект, Отказ, , ТаблицаСписанныеМатериалы);

	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);

КонецПроцедуры

  
//&ИзменениеИКонтроль("ОбработкаПроведения")
//Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)

//	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

//	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
//	Если РучнаяКорректировка Тогда
//		Возврат;
//	КонецЕсли;

//	ПараметрыПроведения = Документы.ТребованиеНакладная.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;

//	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

//	// Таблица списанных материалов
//	ТаблицаСписанныеМатериалы = УчетТоваров.ПодготовитьТаблицуСписанныеТовары(
//	ПараметрыПроведения.ТаблицаМатериалы, ПараметрыПроведения.МатериалыРеквизиты, Отказ);

//	// Таблица списанных материалов заказчика
//	ТаблицаСписанныеМатериалыЗаказчика = УчетТоваров.ПодготовитьТаблицуСписанныеТовары(
//	ПараметрыПроведения.ТаблицаМатериалыЗаказчика, ПараметрыПроведения.МатериалыЗаказчикаРеквизиты, Отказ);

//	// Структура таблиц для отражения в налоговом учете УСН
//	СтруктураТаблицУСН = Новый Структура("ТаблицаТМЦ", ТаблицаСписанныеМатериалы);

//	// Учет доходов и расходов ИП
//	ТаблицыМатериаловПродукцииИП = Документы.ТребованиеНакладная.ПодготовитьТаблицыМатериаловПродукцииИП(
//	ТаблицаСписанныеМатериалы, ПараметрыПроведения.ИПРеквизиты);

//	ТаблицыСписанияМПЗИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыСписанияМПЗ(
//	ТаблицыМатериаловПродукцииИП.ТаблицаМатериалов, ПараметрыПроведения.ИПРеквизиты, Отказ);

//	ТаблицаПоступлениеПродукцииИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступлениеПродукции(
//	ТаблицыМатериаловПродукцииИП.ПолученоПродукции, ПараметрыПроведения.ИПРеквизиты);

//	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

//	// Списание материалов  
//	#Вставка
//	//ЮЦАУ                 
//	Параметры = ПараметрыПроведения.МатериалыРеквизиты[0];
//	ЮЦАУ.РаспределитьСписаниеТоваров(ТаблицаСписанныеМатериалы, Параметры);
//	//ЮЦАУ
//    #КонецВставки

//	УчетТоваров.СформироватьДвиженияСписаниеТоваров(
//	ТаблицаСписанныеМатериалы, ПараметрыПроведения.МатериалыРеквизиты, Движения, Отказ);
//	УчетТоваров.СформироватьДвиженияСписаниеТоваров(
//	ТаблицаСписанныеМатериалыЗаказчика, ПараметрыПроведения.МатериалыЗаказчикаРеквизиты, Движения, Отказ);

//	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);

//	УчетМатериаловВЭксплуатации.СформироватьДвиженияПередачаМатериаловСотруднику(
//	ПараметрыПроведения.ПередачаМатериаловСотрудникуТаблица,
//	ТаблицаСписанныеМатериалы,
//	ПараметрыПроведения.ПередачаМатериаловСотрудникуРеквизиты,
//	Движения, Отказ);

//	УчетТоваров.СформироватьДвиженияПоступлениеТарыВЭксплуатацию(ТаблицаСписанныеМатериалы,
//	ПараметрыПроведения.ВозвратнаяТараТаблица,
//	ПараметрыПроведения.ВозвратнаяТараРеквизиты, Движения, Отказ);

//	// Учет НДС
//	УчетНДСБП.СформироватьДвиженияСписаниеТоваровНаРасходы(
//	ПараметрыПроведения.НДСМатериалы, ТаблицаСписанныеМатериалы, ПараметрыПроведения.НДСРеквизиты, Движения, Отказ);

//	// Учет прослеживаемых товаров
//	ТаблицыПрослеживаемости = ПодготовитьТаблицыДляПереносаРНПТНаОС(
//	ПараметрыПроведения.ПрослеживаемыеТовары,
//	ПараметрыПроведения.МатериалыРеквизиты,
//	ПараметрыПроведения.ПрослеживаемыеОперации);

//	ПрослеживаемыеОперации = ПрослеживаемостьБП.ПодготовитьТаблицуПоПрослеживаемымОперациям(
//	ТаблицыПрослеживаемости.ПрослеживаемыеОперации, ТаблицаСписанныеМатериалы);

//	ПрослеживаемостьБП.СформироватьДвиженияРеализацияТоваров(
//	ПараметрыПроведения.ПрослеживаемыеТовары,
//	ТаблицыПрослеживаемости.ПрослеживаемыеОперации,
//	ПараметрыПроведения.МатериалыРеквизиты,
//	Движения);

//	ПрослеживаемостьБП.СформироватьДвиженияПоступлениеТоваров(
//	ПараметрыПроведения.ПрослеживаемыеТоварыВСоставеработ,
//	Неопределено,
//	Неопределено,
//	ПараметрыПроведения.МатериалыРеквизиты,
//	Движения);

//	ПрослеживаемостьБП.СформироватьДвиженияПоступлениеОС(
//	ТаблицыПрослеживаемости.ПрослеживаемыеОС,
//	Неопределено,
//	Неопределено,
//	ПараметрыПроведения.МатериалыРеквизиты,
//	Движения);

//	// Учет доходов и расходов ИП
//	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияСписаниеМПЗ(
//	ТаблицыСписанияМПЗИП, ПараметрыПроведения.ИПРеквизиты, Движения, Отказ);

//	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеПродукции(
//	ТаблицаПоступлениеПродукцииИП, ТаблицыСписанияМПЗИП.СтоимостьПродукции, 
//	ПараметрыПроведения.ИПРеквизиты, Движения, Отказ);

//	// Регистрация в последовательности
//	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
//	ЭтотОбъект, Отказ, , ТаблицаСписанныеМатериалы);

//	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);

//КонецПроцедуры

