
&ИзменениеИКонтроль("ПодготовитьТаблицыПоступленияПоКурсуАвансов")
Функция Расш1_ПодготовитьТаблицыПоступленияПоКурсуАвансов(СтруктураТаблицДокумента, ТаблицаВзаиморасчеты, Реквизиты)

	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат СтруктураТаблицДокумента;
	КонецЕсли;

	ТаблицыПоступленияПоКурсуАвансов = ПолучитьТаблицыПоступленияПоКурсуАвансов(СтруктураТаблицДокумента,
	ТаблицаВзаиморасчеты, Реквизиты[0].Период);

	Если Реквизиты[0].НДСВключенВСтоимость 
		И (Реквизиты.Колонки.Найти("УчетАгентскогоНДС") = Неопределено Или Не Реквизиты[0].УчетАгентскогоНДС) Тогда
		Возврат ТаблицыПоступленияПоКурсуАвансов;
	КонецЕсли;

	// Исключение НДС из сумм документа (если НДС не включен в стоимость или покупатель исполняет обязанности налогового агента по НДС)	
	Для каждого ЭлементСтруктуры Из ТаблицыПоступленияПоКурсуАвансов Цикл
		Если ЭлементСтруктуры.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для каждого СтрокаТаблицы Из ЭлементСтруктуры.Значение Цикл
			СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.СуммаВзаиморасчетов - СтрокаТаблицы.СуммаНДСВзаиморасчетов;
			СтрокаТаблицы.СуммаРуб            = СтрокаТаблицы.СуммаРуб - СтрокаТаблицы.СуммаНДСРуб;
			СтрокаТаблицы.СуммаБУ             = СтрокаТаблицы.СуммаБУ - СтрокаТаблицы.СуммаНДСРуб;
			СтрокаТаблицы.СуммаНУ             = СтрокаТаблицы.СуммаНУ - СтрокаТаблицы.СуммаНДСРуб;
		КонецЦикла;
	КонецЦикла;
	
	#Вставка   
	Если ТипЗнч(Реквизиты[0].Регистратор) = Тип("ДокументСсылка.ТребованиеНакладная") ИЛИ ТипЗнч(Реквизиты[0].Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ЮЦАУ.РаспределитьПоступлениеУслуг(ТаблицыПоступленияПоКурсуАвансов.ТаблицаУслуги, Реквизиты);
	КонецЕсли;	
	#КонецВставки
	
	Возврат ТаблицыПоступленияПоКурсуАвансов;

КонецФункции
