
&После("УстановитьГибкаяНастройкаПравилРаспределения")
Процедура Расш1_УстановитьГибкаяНастройкаПравилРаспределения(ГибкаяНастройкаПравилРаспределения)
	ГибкаяНастройкаПравилРаспределения = Истина;
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПравилоРаспределитьПоКоэффициентамСчетовУчета")
Процедура Расш1_ДобавитьПравилоРаспределитьПоКоэффициентамСчетовУчета(Процессор, ПараметрыРаспределения, Модификатор, ОтборРасходов)

	Правило = ПравилаРаспределенияРасходов.ДобавитьПравилоРаспределения(
	Процессор, "РаспределениеПропорциональноКоэффициентам", "РаспределитьНаРасходы");

	Правило.Наименование = НСтр("ru = 'Разделить затраты пропорционально коэффициентам по этапам'");

	Если ЗначениеЗаполнено(ОтборРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Правило.ОтборРасходов, ОтборРасходов, Истина);     
		#Вставка     
		//КАА  
		//Подмена таблицы коэффициентов 
		Если Процессор.Счет = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники Тогда //25.02 
			Если ОтборРасходов.Свойство("Подразделение") Тогда
				ТаблицаБазыРаспределенияСчета25_02 = ЮЦАУ.ПолучитьТаблицуБазыРаспределенияСчета25_02(Процессор.Настройки.Контекст.Организация, ОтборРасходов.Подразделение, Процессор.Настройки.Контекст.ПериодДействия);
				Если ТаблицаБазыРаспределенияСчета25_02.Количество() > 0 Тогда //Если есть на что подменять, то подменяем таблицу. Иначе остаются настройки из учетной политики
					Модификатор.ТаблицаБазы = ТаблицаБазыРаспределенияСчета25_02.Скопировать();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		//КАА
		#КонецВставки
	КонецЕсли;

	Правило.ПоляПриемника = Новый Структура;
	Правило.ПоляПриемника.Вставить("ЭтапРаспределения");

	БазаПоСчетам = Модификатор.ТаблицаБазы.Скопировать( , "Счет, Коэффициент");
	БазаПоСчетам.Свернуть("Счет", "Коэффициент");
	БазаПоСчетам.Колонки.Добавить("ЭтапРаспределения", ОбщегоНазначения.ОписаниеТипаСтрока(255));

	Для Каждого СтрокаБазыПоСчетам Из БазаПоСчетам Цикл

		ИмяЭтапаРаспределения = Модификатор.ИдентификаторБазыРаспределения + "_" + XMLСтрока(СтрокаБазыПоСчетам.Счет);

		СтрокаБазыПоСчетам.ЭтапРаспределения = ИмяЭтапаРаспределения;
		ПараметрыРаспределения.ИменаЭтаповРаспределения.Вставить(СтрокаБазыПоСчетам.Счет, ИмяЭтапаРаспределения);
		ПараметрыРаспределения.СчетаУчета.Добавить(СтрокаБазыПоСчетам.Счет);

	КонецЦикла;

	ТекстЗапросаБазыРаспределения = 
	"ВЫБРАТЬ
	|	БазаПоСчетам.Коэффициент КАК База,
	|	БазаПоСчетам.ЭтапРаспределения КАК ЭтапРаспределения
	|ПОМЕСТИТЬ ВТ_БазаРаспределенияПоСчетам
	|ИЗ
	|	&БазаПоСчетам КАК БазаПоСчетам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БазаРаспределенияПоСчетам.База КАК База,
	|	ВТ_БазаРаспределенияПоСчетам.ЭтапРаспределения КАК ЭтапРаспределения
	|ИЗ
	|	ВТ_БазаРаспределенияПоСчетам КАК ВТ_БазаРаспределенияПоСчетам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_БазаРаспределенияПоСчетам";

	Правило.БазаРаспределения.ПараметрыЗапроса.Вставить("БазаПоСчетам", БазаПоСчетам);
	ПравилаРаспределенияРасходов.НастроитьТекстБазыРаспределения(Правило, ТекстЗапросаБазыРаспределения);

	// Таблицу базы будем использовать в правиле для каждого счета собственной базы, применяя отбор.
	ДобавитьОписаниеВременнойТаблицыКоэффициентыРаспределения(ПараметрыРаспределения, Правило, Модификатор);

КонецПроцедуры

