
&Вместо("Счет")
Функция Расш1_Счет(УсловныйКодСчета)
	
	Хозрасчетный = ПланыСчетов.Хозрасчетный;
	
	Результат = Хозрасчетный.ПустаяСсылка();
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ЗаполнитьСчетПоУсловномуКоду(УсловныйКодСчета, Результат);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если УсловныйКодСчета = "01" Тогда
		Результат = Хозрасчетный.ОсновныеСредства;
	ИначеЕсли УсловныйКодСчета = "01.01" Тогда
		Результат = Хозрасчетный.ОСвОрганизации;
	ИначеЕсли УсловныйКодСчета = "01.03" Тогда
		Результат = Хозрасчетный.АрендованноеИмущество;
	ИначеЕсли УсловныйКодСчета = "01.05" Тогда
		Результат = Хозрасчетный.ЗатратыНаРемонтОС;
	ИначеЕсли УсловныйКодСчета = "01.08" Тогда
		Результат = Хозрасчетный.ОСБезГосРегистрации;
	ИначеЕсли УсловныйКодСчета = "01.09" Тогда
		Результат = Хозрасчетный.ВыбытиеОС;
	ИначеЕсли УсловныйКодСчета = "01.11" Тогда
		Результат = Хозрасчетный.ГрупповыеОбъектыОС;
	ИначеЕсли УсловныйКодСчета = "01.К" Тогда
		Результат = Хозрасчетный.КорректировкаСтоимостиАрендованногоИмущества;
	ИначеЕсли УсловныйКодСчета = "02" Тогда
		Результат = Хозрасчетный.АмортизацияОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "02.01" Тогда
		Результат = Хозрасчетный.АмортизацияОС_01;
	ИначеЕсли УсловныйКодСчета = "02.02" Тогда
		Результат = Хозрасчетный.АмортизацияОС_03;
	ИначеЕсли УсловныйКодСчета = "02.03" Тогда
		Результат = Хозрасчетный.АмортизацияАрендованногоИмущества;
	ИначеЕсли УсловныйКодСчета = "02.04" Тогда
		Результат = Хозрасчетный.ОбесценениеОС_01;
	ИначеЕсли УсловныйКодСчета = "02.05" Тогда
		Результат = Хозрасчетный.АмортизацияЗатратНаРемонтОС;
	ИначеЕсли УсловныйКодСчета = "02.11" Тогда
		Результат = Хозрасчетный.АмортизацияГрупповыхОбъектовОС;
	ИначеЕсли УсловныйКодСчета = "03" Тогда
		Результат = Хозрасчетный.ДоходныеВложенияВ_МЦ;
	ИначеЕсли УсловныйКодСчета = "03.01" Тогда
		Результат = Хозрасчетный.МЦвОрганизации;
	ИначеЕсли УсловныйКодСчета = "03.02" Тогда
		Результат = Хозрасчетный.МЦ_ПредоставленныеВоВременноеВладение;
	ИначеЕсли УсловныйКодСчета = "03.03" Тогда
		Результат = Хозрасчетный.МЦ_ПредоставленныеВоВременноеПользование;
	ИначеЕсли УсловныйКодСчета = "03.04" Тогда
		Результат = Хозрасчетный.ПрочиеДоходныеВложения;
	ИначеЕсли УсловныйКодСчета = "03.09" Тогда
		Результат = Хозрасчетный.ВыбытиеМЦ;
	ИначеЕсли УсловныйКодСчета = "04" Тогда
		Результат = Хозрасчетный.НематериальныеАктивы;
	ИначеЕсли УсловныйКодСчета = "04.01" Тогда
		Результат = Хозрасчетный.НематериальныеАктивыОрганизации;
	ИначеЕсли УсловныйКодСчета = "04.02" Тогда
		Результат = Хозрасчетный.РасходыНаНИОКР;
	ИначеЕсли УсловныйКодСчета = "04.09" Тогда
		Результат = Хозрасчетный.ВыбытиеНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "05" Тогда
		Результат = Хозрасчетный.АмортизацияНематериальныхАктивов_;
	ИначеЕсли УсловныйКодСчета = "05.02" Тогда
		Результат = Хозрасчетный.ОбесценениеНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "07" Тогда
		Результат = Хозрасчетный.ОборудованиеКУстановке;
	ИначеЕсли УсловныйКодСчета = "08" Тогда
		Результат = Хозрасчетный.ВложенияВоВнеоборотныеАктивы;
	ИначеЕсли УсловныйКодСчета = "08.01" Тогда
		Результат = Хозрасчетный.ПриобретениеЗемельныхУчастков;
	ИначеЕсли УсловныйКодСчета = "08.01.2" Тогда
		Результат = Хозрасчетный.ПриобретениеЗемельныхУчастковБезДопРасходов;
	ИначеЕсли УсловныйКодСчета = "08.02" Тогда
		Результат = Хозрасчетный.ПриобретениеОбъектовПриродопользования;
	ИначеЕсли УсловныйКодСчета = "08.03" Тогда
		Результат = Хозрасчетный.СтроительствоОбъектовОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.04" Тогда
		Результат = Хозрасчетный.ПриобретениеОбъектовОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.04.2" Тогда
		Результат = Хозрасчетный.ПриобретениеОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.04.5" Тогда
		Результат = Хозрасчетный.ВложенияВРемонтыОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.05" Тогда
		Результат = Хозрасчетный.ПриобретениеНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "08.06" Тогда
		Результат = Хозрасчетный.ПереводМолоднякаЖивотныхВОсновноеСтадо;
	ИначеЕсли УсловныйКодСчета = "08.07" Тогда
		Результат = Хозрасчетный.ПриобретениеВзрослыхЖивотных;
	ИначеЕсли УсловныйКодСчета = "08.08" Тогда
		Результат = Хозрасчетный.ВыполнениеНИОКР;
	ИначеЕсли УсловныйКодСчета = "08.11" Тогда
		Результат = Хозрасчетный.НематериальныеПоисковыеАктивы;
	ИначеЕсли УсловныйКодСчета = "08.12" Тогда
		Результат = Хозрасчетный.МатериальныеПоисковыеАктивы;
	ИначеЕсли УсловныйКодСчета = "09" Тогда
		Результат = Хозрасчетный.ОтложенныеНалоговыеАктивы;
	ИначеЕсли УсловныйКодСчета = "10" Тогда
		Результат = Хозрасчетный.Материалы;
	ИначеЕсли УсловныйКодСчета = "11" Тогда
		Результат = Хозрасчетный.ЖивотныеНаВыращиванииИОткорме;
	ИначеЕсли УсловныйКодСчета = "14" Тогда
		Результат = Хозрасчетный.РезервыПодСнижениеСтоимостиМЦ;
	ИначеЕсли УсловныйКодСчета = "14.01" Тогда
		Результат = Хозрасчетный.РезервыПодСнижениеСтоимостиМатериалов;
	ИначеЕсли УсловныйКодСчета = "14.02" Тогда
		Результат = Хозрасчетный.РезервыПодСнижениеСтоимостиТоваров;
	ИначеЕсли УсловныйКодСчета = "14.03" Тогда
		Результат = Хозрасчетный.РезервыПодСнижениеСтоимостиГотовойПродукции;
	ИначеЕсли УсловныйКодСчета = "14.04" Тогда
		Результат = Хозрасчетный.РезервыПодСнижениеСтоимостиНезавершенногоПроизводства;
	ИначеЕсли УсловныйКодСчета = "15" Тогда
		Результат = Хозрасчетный.ЗаготовлениеИПриобретениеМЦ;
	ИначеЕсли УсловныйКодСчета = "15.01" Тогда
		Результат = Хозрасчетный.ЗаготовлениеИПриобретениеМатериалов;
	ИначеЕсли УсловныйКодСчета = "15.02" Тогда
		Результат = Хозрасчетный.ПриобретениеТоваров;
	ИначеЕсли УсловныйКодСчета = "16" Тогда
		Результат = Хозрасчетный.ОтклонениеВСтоимостиМЦ;
	ИначеЕсли УсловныйКодСчета = "16.01" Тогда
		Результат = Хозрасчетный.ОтклонениеВСтоимостиМатериалов;
	ИначеЕсли УсловныйКодСчета = "16.02" Тогда
		Результат = Хозрасчетный.ОтклонениеВСтоимостиТоваров;
	ИначеЕсли УсловныйКодСчета = "19" Тогда
		Результат = Хозрасчетный.НДСпоПриобретеннымЦенностям;
	ИначеЕсли УсловныйКодСчета = "19.01" Тогда
		Результат = Хозрасчетный.НДСприПриобретенииОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "19.02" Тогда
		Результат = Хозрасчетный.НДСпоПриобретеннымНематериальнымАктивам;
	ИначеЕсли УсловныйКодСчета = "19.03" Тогда
		Результат = Хозрасчетный.НДСпоПриобретеннымМПЗ;
	ИначеЕсли УсловныйКодСчета = "19.04" Тогда
		Результат = Хозрасчетный.НДСпоПриобретеннымУслугам;
	ИначеЕсли УсловныйКодСчета = "19.05" Тогда
		Результат = Хозрасчетный.НДСуплачиваемыйТаможеннымОрганам;
	ИначеЕсли УсловныйКодСчета = "19.06" Тогда
		Результат = Хозрасчетный.АкцизыПоОплаченнымМатериальнымЦенностям;
	ИначеЕсли УсловныйКодСчета = "19.07" Тогда
		Результат = Хозрасчетный.НДСПоТоварамРеализованнымПоСтавке0;
	ИначеЕсли УсловныйКодСчета = "19.09" Тогда
		Результат = Хозрасчетный.НДСПоУменьшениюСтоимостиРеализации;
	ИначеЕсли УсловныйКодСчета = "19.08" Тогда
		Результат = Хозрасчетный.НДСприСтроительствеОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "19.10" Тогда
		Результат = Хозрасчетный.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза;
	ИначеЕсли УсловныйКодСчета = "20" Тогда
		Результат = Хозрасчетный.ОсновноеПроизводство_;
	ИначеЕсли УсловныйКодСчета = "20.01" Тогда
		Результат = Хозрасчетный.ОсновноеПроизводство;
	ИначеЕсли УсловныйКодСчета = "20.02" Тогда
		Результат = Хозрасчетный.ПроизводствоИзДавальческогоСырья;
	ИначеЕсли УсловныйКодСчета = "21" Тогда
		Результат = Хозрасчетный.Полуфабрикаты;
	ИначеЕсли УсловныйКодСчета = "23" Тогда
		Результат = Хозрасчетный.ВспомогательныеПроизводства_;
	ИначеЕсли УсловныйКодСчета = "23.05" Тогда
		Результат = Хозрасчетный.ВыполнениеРемонтовОС;
	ИначеЕсли УсловныйКодСчета = "25" Тогда
		Результат = Хозрасчетный.ОбщепроизводственныеРасходы;
	ИначеЕсли УсловныйКодСчета = "26" Тогда
		Результат = Хозрасчетный.ОбщехозяйственныеРасходы;
	ИначеЕсли УсловныйКодСчета = "28" Тогда
		Результат = Хозрасчетный.БракВПроизводстве;
	ИначеЕсли УсловныйКодСчета = "29" Тогда
		Результат = Хозрасчетный.ОбслуживающиеПроизводства;
	ИначеЕсли УсловныйКодСчета = "40" Тогда
		Результат = Хозрасчетный.ВыпускПродукции;
	ИначеЕсли УсловныйКодСчета = "41" Тогда
		Результат = Хозрасчетный.Товары;
	ИначеЕсли УсловныйКодСчета = "41.01" Тогда
		Результат = Хозрасчетный.ТоварыНаСкладах;
	ИначеЕсли УсловныйКодСчета = "41.02" Тогда
		Результат = Хозрасчетный.ТоварыВРозничнойТорговле;
	ИначеЕсли УсловныйКодСчета = "41.03" Тогда
		Результат = Хозрасчетный.ТараПодТоваромИПорожняя;
	ИначеЕсли УсловныйКодСчета = "41.04" Тогда
		Результат = Хозрасчетный.ПокупныеИзделия;
	ИначеЕсли УсловныйКодСчета = "41.11" Тогда
		Результат = Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
	ИначеЕсли УсловныйКодСчета = "41.12" Тогда
		Результат = Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
	ИначеЕсли УсловныйКодСчета = "42" Тогда
		Результат = Хозрасчетный.ТорговаяНаценка;
	ИначеЕсли УсловныйКодСчета = "43" Тогда
		Результат = Хозрасчетный.ГотоваяПродукция;
	ИначеЕсли УсловныйКодСчета = "44" Тогда
		Результат = Хозрасчетный.РасходыНаПродажу;
	ИначеЕсли УсловныйКодСчета = "45" Тогда
		Результат = Хозрасчетный.ТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "45.01" Тогда
		Результат = Хозрасчетный.ПокупныеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "45.02" Тогда
		Результат = Хозрасчетный.ГотоваяПродукцияОтгруженная;
	ИначеЕсли УсловныйКодСчета = "45.03" Тогда
		Результат = Хозрасчетный.ПрочиеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "46" Тогда
		Результат = Хозрасчетный.ВыполненныеЭтапыПоНезавершеннымРаботам;
	ИначеЕсли УсловныйКодСчета = "50" Тогда
		Результат = Хозрасчетный.Касса;
	ИначеЕсли УсловныйКодСчета = "50.01" Тогда
		Результат = Хозрасчетный.КассаОрганизации;
	ИначеЕсли УсловныйКодСчета = "50.02" Тогда
		Результат = Хозрасчетный.ОперационнаяКасса;
	ИначеЕсли УсловныйКодСчета = "50.03" Тогда
		Результат = Хозрасчетный.ДенежныеДокументы;
	ИначеЕсли УсловныйКодСчета = "50.04" Тогда
		Результат = Хозрасчетный.КассаПлатежногоАгента;
	ИначеЕсли УсловныйКодСчета = "50.21" Тогда
		Результат = Хозрасчетный.КассаОрганизацииВал;
	ИначеЕсли УсловныйКодСчета = "50.23" Тогда
		Результат = Хозрасчетный.ДенежныеДокументыВал;
	ИначеЕсли УсловныйКодСчета = "51" Тогда
		Результат = Хозрасчетный.РасчетныеСчета;
	ИначеЕсли УсловныйКодСчета = "52" Тогда
		Результат = Хозрасчетный.ВалютныеСчета;
	ИначеЕсли УсловныйКодСчета = "53" Тогда
		Результат = Хозрасчетный.ЦифровойРубль;
	ИначеЕсли УсловныйКодСчета = "55" Тогда
		Результат = Хозрасчетный.СпециальныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.01" Тогда
		Результат = Хозрасчетный.Аккредитивы;
	ИначеЕсли УсловныйКодСчета = "55.02" Тогда
		Результат = Хозрасчетный.ЧековыеКнижки;
	ИначеЕсли УсловныйКодСчета = "55.03" Тогда
		Результат = Хозрасчетный.ДепозитныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.04" Тогда
		Результат = Хозрасчетный.ПрочиеСпециальныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.21" Тогда
		Результат = Хозрасчетный.АккредитивыВал;
	ИначеЕсли УсловныйКодСчета = "55.23" Тогда
		Результат = Хозрасчетный.ДепозитныеСчетаВал;
	ИначеЕсли УсловныйКодСчета = "55.24" Тогда
		Результат = Хозрасчетный.ПрочиеСпециальныеСчетаВал;
	ИначеЕсли УсловныйКодСчета = "57" Тогда
		Результат = Хозрасчетный.ПереводыВПути_;
	ИначеЕсли УсловныйКодСчета = "57.01" Тогда
		Результат = Хозрасчетный.ПереводыВПути;
	ИначеЕсли УсловныйКодСчета = "57.21" Тогда
		Результат = Хозрасчетный.ПереводыВПутиВал;
	ИначеЕсли УсловныйКодСчета = "57.02" Тогда
		Результат = Хозрасчетный.ПриобретениеИностраннойВалюты;
	ИначеЕсли УсловныйКодСчета = "57.22" Тогда
		Результат = Хозрасчетный.РеализацияИностраннойВалюты;
	ИначеЕсли УсловныйКодСчета = "57.03" Тогда
		Результат = Хозрасчетный.ПродажиПоПлатежнымКартам;
	ИначеЕсли УсловныйКодСчета = "58" Тогда
		Результат = Хозрасчетный.ФинансовыеВложения;
	ИначеЕсли УсловныйКодСчета = "58.01" Тогда
		Результат = Хозрасчетный.ПаиИАкции;
	ИначеЕсли УсловныйКодСчета = "58.01.1" Тогда
		Результат = Хозрасчетный.Паи;
	ИначеЕсли УсловныйКодСчета = "58.01.2" Тогда
		Результат = Хозрасчетный.Акции;
	ИначеЕсли УсловныйКодСчета = "58.02" Тогда
		Результат = Хозрасчетный.ДолговыеЦенныеБумаги;
	ИначеЕсли УсловныйКодСчета = "58.03" Тогда
		Результат = Хозрасчетный.ПредоставленныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "58.04" Тогда
		Результат = Хозрасчетный.ВкладыПоДоговоруПростогоТоварищества;
	ИначеЕсли УсловныйКодСчета = "58.05" Тогда
		Результат = Хозрасчетный.ПриобретенныеПрава;
	ИначеЕсли УсловныйКодСчета = "59" Тогда
		Результат = Хозрасчетный.РезервыПодОбесценениеФинансовыхВложений;
	ИначеЕсли УсловныйКодСчета = "60" Тогда
		Результат = Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками;
	ИначеЕсли УсловныйКодСчета = "60.01" Тогда
		Результат = Хозрасчетный.РасчетыСПоставщиками;
	ИначеЕсли УсловныйКодСчета = "60.02" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамВыданным;
	ИначеЕсли УсловныйКодСчета = "60.03" Тогда
		Результат = Хозрасчетный.ВекселяВыданные;
	ИначеЕсли УсловныйКодСчета = "60.21" Тогда
		Результат = Хозрасчетный.РасчетыСПоставщикамиВал;
	ИначеЕсли УсловныйКодСчета = "60.22" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамВыданнымВал;
	ИначеЕсли УсловныйКодСчета = "60.31" Тогда
		Результат = Хозрасчетный.РасчетыСПоставщикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "60.32" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамВыданнымУЕ;
	ИначеЕсли УсловныйКодСчета = "62" Тогда
		Результат = Хозрасчетный.РасчетыСПокупателямиИЗаказчиками;
	ИначеЕсли УсловныйКодСчета = "62.01" Тогда
		Результат = Хозрасчетный.РасчетыСПокупателями;
	ИначеЕсли УсловныйКодСчета = "62.02" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученным;
	ИначеЕсли УсловныйКодСчета = "62.03" Тогда
		Результат = Хозрасчетный.ВекселяПолученные;
	ИначеЕсли УсловныйКодСчета = "62.21" Тогда
		Результат = Хозрасчетный.РасчетыСПокупателямиВал;
	ИначеЕсли УсловныйКодСчета = "62.22" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымВал;
	ИначеЕсли УсловныйКодСчета = "62.31" Тогда
		Результат = Хозрасчетный.РасчетыСПокупателямиУЕ;
	ИначеЕсли УсловныйКодСчета = "62.32" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымУЕ;
	ИначеЕсли УсловныйКодСчета = "62.ОТ" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымВСчетОтгрузки;
	ИначеЕсли УсловныйКодСчета = "62.ОТ.1" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымВСчетОтгрузкиРуб;
	ИначеЕсли УсловныйКодСчета = "62.ОТ.2" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымВСчетОтгрузкиВал;
	ИначеЕсли УсловныйКодСчета = "62.ОТ.3" Тогда
		Результат = Хозрасчетный.РасчетыПоАвансамПолученнымВСчетОтгрузкиУЕ;
	ИначеЕсли УсловныйКодСчета = "62.Р" Тогда
		Результат = Хозрасчетный.РасчетыСРозничнымиПокупателями;
	ИначеЕсли УсловныйКодСчета = "63" Тогда
		Результат = Хозрасчетный.РезервыПоСомнительнымДолгам;
	ИначеЕсли УсловныйКодСчета = "66" Тогда
		Результат = Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам;
	ИначеЕсли УсловныйКодСчета = "66.01" Тогда
		Результат = Хозрасчетный.КраткосрочныеКредиты;
	ИначеЕсли УсловныйКодСчета = "66.02" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымКредитам;
	ИначеЕсли УсловныйКодСчета = "66.03" Тогда
		Результат = Хозрасчетный.КраткосрочныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "66.04" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "66.05" Тогда
		Результат = Хозрасчетный.КраткосрочныеДолговыеЦенныеБумаги;
	ИначеЕсли УсловныйКодСчета = "66.06" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымДолговымЦеннымБумагам;
	ИначеЕсли УсловныйКодСчета = "66.21" Тогда
		Результат = Хозрасчетный.КраткосрочныеКредитыВал;
	ИначеЕсли УсловныйКодСчета = "66.22" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымКредитамВал;
	ИначеЕсли УсловныйКодСчета = "66.23" Тогда
		Результат = Хозрасчетный.КраткосрочныеЗаймыВал;
	ИначеЕсли УсловныйКодСчета = "66.24" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымЗаймамВал;
	ИначеЕсли УсловныйКодСчета = "66.25" Тогда
		Результат = Хозрасчетный.КраткосрочныеДолговыеЦенныеБумагиВал;
	ИначеЕсли УсловныйКодСчета = "66.26" Тогда
		Результат = Хозрасчетный.ПроцентыПоКраткосрочнымДолговымЦеннымБумагамВал;
	ИначеЕсли УсловныйКодСчета = "67" Тогда
		Результат = Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам;
	ИначеЕсли УсловныйКодСчета = "67.01" Тогда
		Результат = Хозрасчетный.ДолгосрочныеКредиты;
	ИначеЕсли УсловныйКодСчета = "67.02" Тогда
		Результат = Хозрасчетный.ПроцентыПоДолгосрочнымКредитам;
	ИначеЕсли УсловныйКодСчета = "67.03" Тогда
		Результат = Хозрасчетный.ДолгосрочныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "67.04" Тогда
		Результат = Хозрасчетный.ПроцентыПоДолгосрочнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "67.05" Тогда
		Результат = Хозрасчетный.ДолгосрочныеДолговыеЦенныеБумаги;
	ИначеЕсли УсловныйКодСчета = "67.06" Тогда
		Результат = Хозрасчетный.ПроцентыПроцентыПоДолгосрочнымДолговымЦеннымБумагам;
	ИначеЕсли УсловныйКодСчета = "67.21" Тогда
		Результат = Хозрасчетный.ДолгосрочныеКредитыВал;
	ИначеЕсли УсловныйКодСчета = "67.22" Тогда
		Результат = Хозрасчетный.ПроцентыПоДолгосрочнымКредитамВал;
	ИначеЕсли УсловныйКодСчета = "67.23" Тогда
		Результат = Хозрасчетный.ДолгосрочныеЗаймыВал;
	ИначеЕсли УсловныйКодСчета = "67.24" Тогда
		Результат = Хозрасчетный.ПроцентыПоДолгосрочнымЗаймамВал;
	ИначеЕсли УсловныйКодСчета = "67.25" Тогда
		Результат = Хозрасчетный.ДолгосрочныеДолговыеЦенныеБумагиВал;
	ИначеЕсли УсловныйКодСчета = "67.26" Тогда
		Результат = Хозрасчетный.ПроцентыПоДолгосрочнымДолговымЦеннымБумагамВал;
	ИначеЕсли УсловныйКодСчета = "68" Тогда
		Результат = Хозрасчетный.РасчетыПоНалогам;
	ИначеЕсли УсловныйКодСчета = "68.01" Тогда
		Результат = Хозрасчетный.НДФЛ;
	ИначеЕсли УсловныйКодСчета = "68.01.1" Тогда
		Результат = Хозрасчетный.НДФЛ;  // Ссылка для обслуживания унаследованного кода
	ИначеЕсли УсловныйКодСчета = "68.01.2" Тогда
		Результат = Хозрасчетный.НДФЛ; // Ссылка для обслуживания унаследованного кода
	ИначеЕсли УсловныйКодСчета = "68.02" Тогда
		Результат = Хозрасчетный.НДС;
	ИначеЕсли УсловныйКодСчета = "68.03" Тогда
		Результат = Хозрасчетный.Акцизы;
	ИначеЕсли УсловныйКодСчета = "68.04" Тогда
		Результат = Хозрасчетный.НалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "68.04.1" Тогда
		Результат = Хозрасчетный.РасчетыСБюджетом;
	ИначеЕсли УсловныйКодСчета = "68.04.2" Тогда
		Результат = Хозрасчетный.РасчетНалогаНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "68.06" Тогда
		Результат = Хозрасчетный.ЗемельныйНалог;
	ИначеЕсли УсловныйКодСчета = "68.07" Тогда
		Результат = Хозрасчетный.ТранспортныйНалог;
	ИначеЕсли УсловныйКодСчета = "68.08" Тогда
		Результат = Хозрасчетный.НалогНаИмущество;
	ИначеЕсли УсловныйКодСчета = "68.09" Тогда
		Результат = Хозрасчетный.НалогНаРекламу;
	ИначеЕсли УсловныйКодСчета = "68.10" Тогда
		Результат = Хозрасчетный.ПрочиеНалогиИСборы;
	ИначеЕсли УсловныйКодСчета = "68.11" Тогда
		Результат = Хозрасчетный.ЕНВД;
	ИначеЕсли УсловныйКодСчета = "68.12" Тогда
		Результат = Хозрасчетный.ЕНприУСН;
	ИначеЕсли УсловныйКодСчета = "68.13" Тогда
		Результат = Хозрасчетный.ТорговыйСбор;
	ИначеЕсли УсловныйКодСчета = "68.14" Тогда
		Результат = Хозрасчетный.НалогПриПСН;
	ИначеЕсли УсловныйКодСчета = "68.15" Тогда
		Результат = Хозрасчетный.НалогПриАУСН;
	ИначеЕсли УсловныйКодСчета = "68.16" Тогда
		Результат = Хозрасчетный.НалогНаПрофессиональныйДоход;
	ИначеЕсли УсловныйКодСчета = "68.17" Тогда
		Результат = Хозрасчетный.ТуристическийНалог;
	ИначеЕсли УсловныйКодСчета = "68.21" Тогда
		Результат = Хозрасчетный.НДФЛ_ИП;
	ИначеЕсли УсловныйКодСчета = "68.21.1" Тогда
		Результат = Хозрасчетный.НДФЛ_ИП; // Ссылка для обслуживания унаследованного кода
	ИначеЕсли УсловныйКодСчета = "68.21.2" Тогда
		Результат = Хозрасчетный.НДФЛ_ИП; // Ссылка для обслуживания унаследованного кода
	ИначеЕсли УсловныйКодСчета = "68.22" Тогда
		Результат = Хозрасчетный.НДСпоЭкспортуКВозмещению;
	ИначеЕсли УсловныйКодСчета = "68.32" Тогда
		Результат = Хозрасчетный.НДСНалоговогоАгента;
	ИначеЕсли УсловныйКодСчета = "68.34" Тогда
		Результат = Хозрасчетный.НалогНаПрибыльНалоговогоАгента;
	ИначеЕсли УсловныйКодСчета = "68.42" Тогда
		Результат = Хозрасчетный.НДСТаможенныйСоюзКУплате;
	ИначеЕсли УсловныйКодСчета = "68.52" Тогда
		Результат = Хозрасчетный.НДСНалоговогоАгентаПоОтдельнымВидамТоваров;
	ИначеЕсли УсловныйКодСчета = "68.90" Тогда
		Результат = Хозрасчетный.ЕдиныйНалоговыйСчет;
	ИначеЕсли УсловныйКодСчета = "69" Тогда
		Результат = Хозрасчетный.РасчетыПоСоциальномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "69.01" Тогда
		Результат = Хозрасчетный.ФСС;
	ИначеЕсли УсловныйКодСчета = "69.02" Тогда
		Результат = Хозрасчетный.ПФР;
	ИначеЕсли УсловныйКодСчета = "69.02.1" Тогда
		Результат = Хозрасчетный.ПФР_страх;
	ИначеЕсли УсловныйКодСчета = "69.02.2" Тогда
		Результат = Хозрасчетный.ПФР_нак;
	ИначеЕсли УсловныйКодСчета = "69.02.3" Тогда
		Результат = Хозрасчетный.ПФР_доп;
	ИначеЕсли УсловныйКодСчета = "69.02.4" Тогда
		Результат = Хозрасчетный.ПФР_доп_шахтеры;
	ИначеЕсли УсловныйКодСчета = "69.02.5" Тогда
		Результат = Хозрасчетный.ПФР_доп_ВредныеУсловияТруда;
	ИначеЕсли УсловныйКодСчета = "69.02.6" Тогда
		Результат = Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда;
	ИначеЕсли УсловныйКодСчета = "69.02.7" Тогда
		Результат = Хозрасчетный.ПФР_ОПС;
	ИначеЕсли УсловныйКодСчета = "69.03" Тогда
		Результат = Хозрасчетный.ФОМС;
	ИначеЕсли УсловныйКодСчета = "69.03.1" Тогда
		Результат = Хозрасчетный.ФФОМС;
	ИначеЕсли УсловныйКодСчета = "69.03.2" Тогда
		Результат = Хозрасчетный.ТФОМС;
	ИначеЕсли УсловныйКодСчета = "69.04" Тогда
		Результат = Хозрасчетный.ЕСН_ФБ;
	ИначеЕсли УсловныйКодСчета = "69.05" Тогда
		Результат = Хозрасчетный.ПФР_ДОБР;
	ИначеЕсли УсловныйКодСчета = "69.05.1" Тогда
		Результат = Хозрасчетный.ПФР_ДОБР_орг;
	ИначеЕсли УсловныйКодСчета = "69.05.2" Тогда
		Результат = Хозрасчетный.ПФР_ДОБР_сотр;
	ИначеЕсли УсловныйКодСчета = "69.06.1" Тогда
		Результат = Хозрасчетный.ПФР_Страх_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.2" Тогда
		Результат = Хозрасчетный.ПФР_Нак_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.3" Тогда
		Результат = Хозрасчетный.ФОМС_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.4" Тогда
		Результат = Хозрасчетный.ФСС_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.5" Тогда
		Результат = Хозрасчетный.ПФР_ОПС_ИП;
	ИначеЕсли УсловныйКодСчета = "69.06.6" Тогда
		Результат = Хозрасчетный.СтраховыеВзносыЕдиныйТариф_ИП;
	ИначеЕсли УсловныйКодСчета = "69.09" Тогда
		Результат = Хозрасчетный.СтраховыеВзносыЕдиныйТариф;
	ИначеЕсли УсловныйКодСчета = "69.11" Тогда
		Результат = Хозрасчетный.ФСС_НСиПЗ;
	ИначеЕсли УсловныйКодСчета = "69.12" Тогда
		Результат = Хозрасчетный.ФСС_ДобровольныеВзносы;
	ИначеЕсли УсловныйКодСчета = "69.13" Тогда
		Результат = Хозрасчетный.ФСС_СПЕЦ;
	ИначеЕсли УсловныйКодСчета = "69.13.1" Тогда
		Результат = Хозрасчетный.ФСС_СПЕЦ_ЕНВД;
	ИначеЕсли УсловныйКодСчета = "69.13.2" Тогда
		Результат = Хозрасчетный.ФСС_СПЕЦ_УСН;
	ИначеЕсли УсловныйКодСчета = "70" Тогда
		Результат = Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
	ИначеЕсли УсловныйКодСчета = "71" Тогда
		Результат = Хозрасчетный.РасчетыСПодотчетнымиЛицами_;
	ИначеЕсли УсловныйКодСчета = "71.01" Тогда
		Результат = Хозрасчетный.РасчетыСПодотчетнымиЛицами;
	ИначеЕсли УсловныйКодСчета = "71.21" Тогда
		Результат = Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал;
	ИначеЕсли УсловныйКодСчета = "73" Тогда
		Результат = Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям;
	ИначеЕсли УсловныйКодСчета = "73.01" Тогда
		Результат = Хозрасчетный.РасчетыПоПредоставленнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "73.02" Тогда
		Результат = Хозрасчетный.РасчетыПоВозмещениюМатериальногоУщерба;
	ИначеЕсли УсловныйКодСчета = "73.03" Тогда
		Результат = Хозрасчетный.РасчетыПоПрочимОперациям;
	ИначеЕсли УсловныйКодСчета = "75" Тогда
		Результат = Хозрасчетный.РасчетыСУчредителями;
	ИначеЕсли УсловныйКодСчета = "75.01" Тогда
		Результат = Хозрасчетный.РасчетыПоВкладамВУставныйКапитал;
	ИначеЕсли УсловныйКодСчета = "75.02" Тогда
		Результат = Хозрасчетный.РасчетыПоВыплатеДоходов;
	ИначеЕсли УсловныйКодСчета = "76" Тогда
		Результат = Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	ИначеЕсли УсловныйКодСчета = "76.01" Тогда
		Результат = Хозрасчетный.РасчетыПоИмущественномуЛичномуИДобровольномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "76.01.1" Тогда
		Результат = Хозрасчетный.РасчетыПоИмущественномуИЛичномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "76.01.2" Тогда
		Результат = Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников;
	ИначеЕсли УсловныйКодСчета = "76.01.9" Тогда
		Результат = Хозрасчетный.ПлатежиПоПрочимВидамСтрахования;
	ИначеЕсли УсловныйКодСчета = "76.02" Тогда
		Результат = Хозрасчетный.РасчетыПоПретензиям;
	ИначеЕсли УсловныйКодСчета = "76.03" Тогда
		Результат = Хозрасчетный.РасчетыПоПричитающимсяДивидендам;
	ИначеЕсли УсловныйКодСчета = "76.04" Тогда
		Результат = Хозрасчетный.РасчетыПоДепонированнымСуммам;
	ИначеЕсли УсловныйКодСчета = "76.05" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками;
	ИначеЕсли УсловныйКодСчета = "76.06" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
	ИначеЕсли УсловныйКодСчета = "76.07" Тогда
		Результат = Хозрасчетный.РасчетыПоАренде;
	ИначеЕсли УсловныйКодСчета = "76.07.1" Тогда
		Результат = Хозрасчетный.АрендныеОбязательства;
	ИначеЕсли УсловныйКодСчета = "76.07.2" Тогда
		Результат = Хозрасчетный.АрендныеПлатежи;
	ИначеЕсли УсловныйКодСчета = "76.07.5" Тогда
		Результат = Хозрасчетный.ПроцентыПоАренде;
	ИначеЕсли УсловныйКодСчета = "76.07.9" Тогда
		Результат = Хозрасчетный.НДСпоАренднымОбязательствам;
	ИначеЕсли УсловныйКодСчета = "76.08" Тогда
		Результат = Хозрасчетный.ПроцентыПоРассрочке;
	ИначеЕсли УсловныйКодСчета = "76.27" Тогда
		Результат = Хозрасчетный.РасчетыПоАрендеВал;
	ИначеЕсли УсловныйКодСчета = "76.27.1" Тогда
		Результат = Хозрасчетный.АрендныеОбязательстваВал;
	ИначеЕсли УсловныйКодСчета = "76.27.2" Тогда
		Результат = Хозрасчетный.АрендныеПлатежиВал;
	ИначеЕсли УсловныйКодСчета = "76.27.5" Тогда
		Результат = Хозрасчетный.ПроцентыПоАрендеВал;
	ИначеЕсли УсловныйКодСчета = "76.27.9" Тогда
		Результат = Хозрасчетный.НДСпоАренднымОбязательствамВал;
	ИначеЕсли УсловныйКодСчета = "76.28" Тогда
		Результат = Хозрасчетный.ПроцентыПоРассрочкеВал;
	ИначеЕсли УсловныйКодСчета = "76.37" Тогда
		Результат = Хозрасчетный.РасчетыПоАрендеУЕ;
	ИначеЕсли УсловныйКодСчета = "76.37.1" Тогда
		Результат = Хозрасчетный.АрендныеОбязательстваУЕ;
	ИначеЕсли УсловныйКодСчета = "76.37.2" Тогда
		Результат = Хозрасчетный.АрендныеПлатежиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.37.5" Тогда
		Результат = Хозрасчетный.ПроцентыПоАрендеУЕ;
	ИначеЕсли УсловныйКодСчета = "76.37.9" Тогда
		Результат = Хозрасчетный.НДСпоАренднымОбязательствамУЕ;
	ИначеЕсли УсловныйКодСчета = "76.38" Тогда
		Результат = Хозрасчетный.ПроцентыПоРассрочкеУЕ;
	ИначеЕсли УсловныйКодСчета = "76.09" Тогда
		Результат = Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
	ИначеЕсли УсловныйКодСчета = "76.10" Тогда
		Результат = Хозрасчетный.ПрочиеРасчетыСФизическимиЛицами;
	ИначеЕсли УсловныйКодСчета = "76.13" Тогда
		Результат = Хозрасчетный.РасчетыСФакторинговымиКомпаниями;
	ИначеЕсли УсловныйКодСчета = "76.14" Тогда
		Результат = Хозрасчетный.Билеты;
	ИначеЕсли УсловныйКодСчета = "76.15" Тогда
		Результат = Хозрасчетный.ТопливныеКарты;
	ИначеЕсли УсловныйКодСчета = "76.16" Тогда
		Результат = Хозрасчетный.РасчетыССамозанятыми;
	ИначеЕсли УсловныйКодСчета = "76.17" Тогда
		Результат = Хозрасчетный.РасчетыПоНалогамСТретьимиЛицами;
	ИначеЕсли УсловныйКодСчета = "76.18" Тогда
		Результат = Хозрасчетный.ПриобретениеПравНаИспользованиеРезультатовИнтеллектуальнойДеятельности;
	ИначеЕсли УсловныйКодСчета = "76.21" Тогда
		Результат = Хозрасчетный.РасчетыПоИмущественномуИЛичномуСтрахованиюВал;
	ИначеЕсли УсловныйКодСчета = "76.22" Тогда
		Результат = Хозрасчетный.РасчетыПоПретензиямВал;
	ИначеЕсли УсловныйКодСчета = "76.25" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал;
	ИначеЕсли УсловныйКодСчета = "76.26" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал;
	ИначеЕсли УсловныйКодСчета = "76.29" Тогда
		Результат = Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал;
	ИначеЕсли УсловныйКодСчета = "76.32" Тогда
		Результат = Хозрасчетный.РасчетыПоПретензиямУЕ;
	ИначеЕсли УсловныйКодСчета = "76.35" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.36" Тогда
		Результат = Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.39" Тогда
		Результат = Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.41" Тогда
		Результат = Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников;
	ИначеЕсли УсловныйКодСчета = "76.49" Тогда
		Результат = Хозрасчетный.РасчетыПоПрочимУдержаниямРаботников;
	ИначеЕсли УсловныйКодСчета = "76.ВА" Тогда
		Результат = Хозрасчетный.НДСпоАвансамИПредоплатамВыданным;
	ИначеЕсли УсловныйКодСчета = "76.АВ" Тогда
		Результат = Хозрасчетный.НДСпоАвансамИПредоплатам;
	ИначеЕсли УсловныйКодСчета = "76.К" Тогда
		Результат = Хозрасчетный.КорректировкаРасчетовПрошлогоПериода;
	ИначеЕсли УсловныйКодСчета = "76.Н" Тогда
		Результат = Хозрасчетный.РасчетыПоНДСотложенномуДляУплатыВБюджет;
	ИначеЕсли УсловныйКодСчета = "76.НА" Тогда
		Результат = Хозрасчетный.РасчетыНДСНалоговогоАгента;
	ИначеЕсли УсловныйКодСчета = "76.ОТ" Тогда
		Результат = Хозрасчетный.НДСНачисленныйПоОтгрузке;
	ИначеЕсли УсловныйКодСчета = "77" Тогда
		Результат = Хозрасчетный.ОтложенныеНалоговыеОбязательства;
	ИначеЕсли УсловныйКодСчета = "79" Тогда
		Результат = Хозрасчетный.ВнутрихозяйственныеРасчеты;
	ИначеЕсли УсловныйКодСчета = "80" Тогда
		Результат = Хозрасчетный.УставныйКапитал;
	ИначеЕсли УсловныйКодСчета = "81" Тогда
		Результат = Хозрасчетный.СобственныеАкции;
	ИначеЕсли УсловныйКодСчета = "82" Тогда
		Результат = Хозрасчетный.РезервныйКапитал;
	ИначеЕсли УсловныйКодСчета = "82.01" Тогда
		Результат = Хозрасчетный.РезервыОбразованныеВСоответствииСЗаконодательством;
	ИначеЕсли УсловныйКодСчета = "82.02" Тогда
		Результат = Хозрасчетный.РезервыОбразованныеВСоответствииСУчредительнымиДокументами;
	ИначеЕсли УсловныйКодСчета = "83" Тогда
		Результат = Хозрасчетный.ДобавочныйКапитал;
	ИначеЕсли УсловныйКодСчета = "83.01" Тогда
		Результат = Хозрасчетный.ПриростСтоимостиПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.1" Тогда
		Результат = Хозрасчетный.ПриростСтоимостиИмуществаПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.2" Тогда
		Результат = Хозрасчетный.ПриростСтоимостиНМАПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.3" Тогда
		Результат = Хозрасчетный.ПриростСтоимостиПрочихВнеоборотныхАктивоПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "84" Тогда
		Результат = Хозрасчетный.НераспределеннаяПрибыль;
	ИначеЕсли УсловныйКодСчета = "84.01" Тогда
		Результат = Хозрасчетный.ПрибыльПодлежащаяРаспределению;
	ИначеЕсли УсловныйКодСчета = "84.02" Тогда
		Результат = Хозрасчетный.УбытокПодлежащийПокрытию;
	ИначеЕсли УсловныйКодСчета = "86" Тогда
		Результат = Хозрасчетный.ЦелевоеФинансирование;
	ИначеЕсли УсловныйКодСчета = "90"Тогда
		Результат = Хозрасчетный.Продажи;
	ИначеЕсли УсловныйКодСчета = "90.01" Тогда
		Результат = Хозрасчетный.Выручка;
	ИначеЕсли УсловныйКодСчета = "90.02" Тогда
		Результат = Хозрасчетный.СебестоимостьПродаж;
	ИначеЕсли УсловныйКодСчета = "90.03" Тогда
		Результат = Хозрасчетный.Продажи_НДС;
	ИначеЕсли УсловныйКодСчета = "90.04" Тогда
		Результат = Хозрасчетный.Продажи_Акцизы;
	ИначеЕсли УсловныйКодСчета = "90.05" Тогда
		Результат = Хозрасчетный.Продажи_ЭкспортныеПошлины;
	ИначеЕсли УсловныйКодСчета = "90.08" Тогда
		Результат = Хозрасчетный.Продажи_УправленческиеРасходы;
	ИначеЕсли УсловныйКодСчета = "90.07" Тогда
		Результат = Хозрасчетный.Продажи_РасходыНаПродажу;
	ИначеЕсли УсловныйКодСчета = "90.01.1" Тогда
		Результат = Хозрасчетный.ВыручкаНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.01.2" Тогда
		Результат = Хозрасчетный.ВыручкаЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.02.1" Тогда
		Результат = Хозрасчетный.СебестоимостьПродажНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.02.2" Тогда
		Результат = Хозрасчетный.СебестоимостьПродажЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.07.1" Тогда
		Результат = Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.07.2" Тогда
		Результат = Хозрасчетный.Продажи_РасходыНаПродажуЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.08.1" Тогда
		Результат = Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.08.2" Тогда
		Результат = Хозрасчетный.Продажи_УправленческиеРасходыЕНВД;
	ИначеЕсли УсловныйКодСчета = "91" Тогда
		Результат = Хозрасчетный.ПрочиеДоходыИРасходы;
	ИначеЕсли УсловныйКодСчета = "91.01" Тогда
		Результат = Хозрасчетный.ПрочиеДоходы;
	ИначеЕсли УсловныйКодСчета = "91.02" Тогда
		Результат = Хозрасчетный.ПрочиеРасходы;
	ИначеЕсли УсловныйКодСчета = "99" Тогда
		Результат = Хозрасчетный.ПрибылиИУбытки;
	ИначеЕсли УсловныйКодСчета = "99.01" Тогда
		Результат = Хозрасчетный.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02" Тогда
		Результат = Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02.1" Тогда
		Результат = Хозрасчетный.УсловныйРасходПоНалогуНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02.2" Тогда
		Результат = Хозрасчетный.УсловныйДоходПоНалогуНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02.3" Тогда
		Результат = Хозрасчетный.ПостоянноеНалоговоеОбязательство;
	ИначеЕсли УсловныйКодСчета = "99.02.4" Тогда
		Результат = Хозрасчетный.ПрибылиИУбыткиОтПересчетаОНА_ОНО;
	ИначеЕсли УсловныйКодСчета = "99.02.Т" Тогда
		Результат = Хозрасчетный.ТекущийНалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02.О" Тогда
		Результат = Хозрасчетный.ОтложенныйНалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.01.1" Тогда
		Результат = Хозрасчетный.ПрибылиИУбыткиНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "99.01.2" Тогда
		Результат = Хозрасчетный.ПрибылиИУбыткиЕНВД;
	ИначеЕсли УсловныйКодСчета = "99.09" Тогда
		Результат = Хозрасчетный.ПрочиеПрибылиИУбытки;
	ИначеЕсли УсловныйКодСчета = "94" Тогда
		Результат = Хозрасчетный.НедостачиИПотериОтПорчиЦенностей;
	ИначеЕсли УсловныйКодСчета = "96" Тогда
		Результат = Хозрасчетный.РезервыПредстоящихРасходов;
	ИначеЕсли УсловныйКодСчета = "96.01" Тогда
		Результат = Хозрасчетный.ОценочныеОбязательстваПоВознаграждениямРаботникам;
	ИначеЕсли УсловныйКодСчета = "96.01.1" Тогда
		Результат = Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям;
	ИначеЕсли УсловныйКодСчета = "96.01.2" Тогда
		Результат = Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам;
	ИначеЕсли УсловныйКодСчета = "96.09" Тогда
		Результат = Хозрасчетный.РезервыПредстоящихРасходовПрочие;
	ИначеЕсли УсловныйКодСчета = "97" Тогда
		Результат = Хозрасчетный.РасходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "97.01" Тогда
		Результат = Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "97.02" Тогда
		Результат = Хозрасчетный.РасходыБудущихПериодовНаДобровольноеСтрахованиеРаботников;
	ИначеЕсли УсловныйКодСчета = "97.21" Тогда
		Результат = Хозрасчетный.ПрочиеРасходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98" Тогда
		Результат = Хозрасчетный.ДоходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98.01" Тогда
		Результат = Хозрасчетный.ДоходыПолученныеВСчетБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98.02" Тогда
		Результат = Хозрасчетный.БезвозмездныеПоступления;
	ИначеЕсли УсловныйКодСчета = "98.03" Тогда
		Результат = Хозрасчетный.ПредстоящиеПоступленияПоНедостачамВыявленнымЗаПрошлыеГоды;
	ИначеЕсли УсловныйКодСчета = "98.04" Тогда
		Результат = Хозрасчетный.РазницаМеждуСуммойПодлежащейВзысканиюСВиновныхЛицИБалансовойСтоимостьюПоНедостачамЦенностей;
	ИначеЕсли УсловныйКодСчета = "001" Тогда
		Результат = Хозрасчетный.АрендованныеОсновныеСредства;
	ИначеЕсли УсловныйКодСчета = "002" Тогда
		Результат = Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение;
	ИначеЕсли УсловныйКодСчета = "003" Тогда
		Результат = Хозрасчетный.МатериалыПринятыеВПереработку_;
	ИначеЕсли УсловныйКодСчета = "004" Тогда
		Результат = Хозрасчетный.ТоварыПринятыеНаКомиссию;
	ИначеЕсли УсловныйКодСчета = "005" Тогда
		Результат = Хозрасчетный.ОборудованиеПринятоеДляМонтажа;
	ИначеЕсли УсловныйКодСчета = "007" Тогда
		Результат = Хозрасчетный.СписаннаяВУбытокЗадолженностьДебиторов;
	ИначеЕсли УсловныйКодСчета = "008" Тогда
		Результат = Хозрасчетный.ОбеспеченияОбязательствИПлатежейПолученные;
	ИначеЕсли УсловныйКодСчета = "009" Тогда
		Результат = Хозрасчетный.ОбеспеченияОбязательствИПлатежейВыданные;
	ИначеЕсли УсловныйКодСчета = "010" Тогда
		Результат = Хозрасчетный.ИзносОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "011" Тогда
		Результат = Хозрасчетный.ОсновныеСредстваСданныеВАренду;
	ИначеЕсли УсловныйКодСчета = "012" Тогда
		Результат = Хозрасчетный.ВозвратнаяТара;
	ИначеЕсли УсловныйКодСчета = "68.05" Тогда //ЮЦАУ
		Результат = Хозрасчетный.НайтиПоКоду("68.05"); 
	Иначе
		ИмяФункции = "ЗаполнениеБухгалтерскойОтчетностиИтоги.Счет";
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Функция %1:
		|Не определен счет с условным кодом %2 в соответствии счетов'"), ИмяФункции, УсловныйКодСчета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&Вместо("СчетаСРеквизитами")
Функция Расш1_СчетаСРеквизитами()
	
	Матрикс = Новый ТаблицаЗначений;
	Матрикс.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Матрикс.Колонки.Добавить("УсловныйКод", Новый ОписаниеТипов("Строка"));
	
	ДобавитьПредопределенныйСчет(Матрикс, "01", "ОсновныеСредства");
	ДобавитьПредопределенныйСчет(Матрикс, "01.01", "ОСвОрганизации");
	ДобавитьПредопределенныйСчет(Матрикс, "01.03", "АрендованноеИмущество");
	ДобавитьПредопределенныйСчет(Матрикс, "01.05", "ЗатратыНаРемонтОС");
	ДобавитьПредопределенныйСчет(Матрикс, "01.08", "ОСБезГосРегистрации");
	ДобавитьПредопределенныйСчет(Матрикс, "01.09", "ВыбытиеОС");
	ДобавитьПредопределенныйСчет(Матрикс, "01.11", "ГрупповыеОбъектыОС");
	ДобавитьПредопределенныйСчет(Матрикс, "01.К", "КорректировкаСтоимостиАрендованногоИмущества");
	
	ДобавитьПредопределенныйСчет(Матрикс, "02", "АмортизацияОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "02.01", "АмортизацияОС_01");
	ДобавитьПредопределенныйСчет(Матрикс, "02.02", "АмортизацияОС_03");
	ДобавитьПредопределенныйСчет(Матрикс, "02.03", "АмортизацияАрендованногоИмущества");
	ДобавитьПредопределенныйСчет(Матрикс, "02.04", "ОбесценениеОС_01");
	ДобавитьПредопределенныйСчет(Матрикс, "02.05", "АмортизацияЗатратНаРемонтОС");
	ДобавитьПредопределенныйСчет(Матрикс, "02.11", "АмортизацияГрупповыхОбъектовОС");
	
	ДобавитьПредопределенныйСчет(Матрикс, "03", "ДоходныеВложенияВ_МЦ");
	ДобавитьПредопределенныйСчет(Матрикс, "03.01", "МЦвОрганизации");
	ДобавитьПредопределенныйСчет(Матрикс, "03.02", "МЦ_ПредоставленныеВоВременноеВладение");
	ДобавитьПредопределенныйСчет(Матрикс, "03.03", "МЦ_ПредоставленныеВоВременноеПользование");
	ДобавитьПредопределенныйСчет(Матрикс, "03.04", "ПрочиеДоходныеВложения");
	ДобавитьПредопределенныйСчет(Матрикс, "03.09", "ВыбытиеМЦ");
	
	ДобавитьПредопределенныйСчет(Матрикс, "04", "НематериальныеАктивы");
	ДобавитьПредопределенныйСчет(Матрикс, "04.01", "НематериальныеАктивыОрганизации");
	ДобавитьПредопределенныйСчет(Матрикс, "04.02", "РасходыНаНИОКР");
	ДобавитьПредопределенныйСчет(Матрикс, "04.09", "ВыбытиеНематериальныхАктивов");
	
	ДобавитьПредопределенныйСчет(Матрикс, "05", "АмортизацияНематериальныхАктивов_");
	ДобавитьПредопределенныйСчет(Матрикс, "07", "ОборудованиеКУстановке");
	
	ДобавитьПредопределенныйСчет(Матрикс, "08", "ВложенияВоВнеоборотныеАктивы");
	ДобавитьПредопределенныйСчет(Матрикс, "08.01", "ПриобретениеЗемельныхУчастков");
	ДобавитьПредопределенныйСчет(Матрикс, "08.01.2", "ПриобретениеЗемельныхУчастковБезДопРасходов");
	ДобавитьПредопределенныйСчет(Матрикс, "08.02", "ПриобретениеОбъектовПриродопользования");
	ДобавитьПредопределенныйСчет(Матрикс, "08.03", "СтроительствоОбъектовОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "08.04", "ПриобретениеОбъектовОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "08.04.1", "ПриобретениеКомпонентовОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "08.04.2", "ПриобретениеОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "08.04.5", "ВложенияВРемонтыОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "08.05", "ПриобретениеНематериальныхАктивов");
	ДобавитьПредопределенныйСчет(Матрикс, "08.06", "ПереводМолоднякаЖивотныхВОсновноеСтадо");
	ДобавитьПредопределенныйСчет(Матрикс, "08.07", "ПриобретениеВзрослыхЖивотных");
	ДобавитьПредопределенныйСчет(Матрикс, "08.08", "ВыполнениеНИОКР");
	ДобавитьПредопределенныйСчет(Матрикс, "08.11", "НематериальныеПоисковыеАктивы");
	ДобавитьПредопределенныйСчет(Матрикс, "08.12", "МатериальныеПоисковыеАктивы");
	
	ДобавитьПредопределенныйСчет(Матрикс, "09", "ОтложенныеНалоговыеАктивы");
	ДобавитьПредопределенныйСчет(Матрикс, "10", "Материалы");
	ДобавитьПредопределенныйСчет(Матрикс, "11", "ЖивотныеНаВыращиванииИОткорме");
	
	ДобавитьПредопределенныйСчет(Матрикс, "14", "РезервыПодСнижениеСтоимостиМЦ");
	ДобавитьПредопределенныйСчет(Матрикс, "14.01", "РезервыПодСнижениеСтоимостиМатериалов");
	ДобавитьПредопределенныйСчет(Матрикс, "14.02", "РезервыПодСнижениеСтоимостиТоваров");
	ДобавитьПредопределенныйСчет(Матрикс, "14.03", "РезервыПодСнижениеСтоимостиГотовойПродукции");
	ДобавитьПредопределенныйСчет(Матрикс, "14.04", "РезервыПодСнижениеСтоимостиНезавершенногоПроизводства");
	
	ДобавитьПредопределенныйСчет(Матрикс, "15", "ЗаготовлениеИПриобретениеМЦ");
	ДобавитьПредопределенныйСчет(Матрикс, "15.01", "ЗаготовлениеИПриобретениеМатериалов");
	ДобавитьПредопределенныйСчет(Матрикс, "15.02", "ПриобретениеТоваров");
	
	ДобавитьПредопределенныйСчет(Матрикс, "16", "ОтклонениеВСтоимостиМЦ");
	ДобавитьПредопределенныйСчет(Матрикс, "16.01", "ОтклонениеВСтоимостиМатериалов");
	ДобавитьПредопределенныйСчет(Матрикс, "16.02", "ОтклонениеВСтоимостиТоваров");
	
	ДобавитьПредопределенныйСчет(Матрикс, "19", "НДСпоПриобретеннымЦенностям");
	ДобавитьПредопределенныйСчет(Матрикс, "19.01", "НДСприПриобретенииОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "19.02", "НДСпоПриобретеннымНематериальнымАктивам");
	ДобавитьПредопределенныйСчет(Матрикс, "19.03", "НДСпоПриобретеннымМПЗ");
	ДобавитьПредопределенныйСчет(Матрикс, "19.04", "НДСпоПриобретеннымУслугам");
	ДобавитьПредопределенныйСчет(Матрикс, "19.05", "НДСуплачиваемыйТаможеннымОрганам");
	ДобавитьПредопределенныйСчет(Матрикс, "19.06", "АкцизыПоОплаченнымМатериальнымЦенностям");
	ДобавитьПредопределенныйСчет(Матрикс, "19.07", "НДСПоТоварамРеализованнымПоСтавке0");
	ДобавитьПредопределенныйСчет(Матрикс, "19.08", "НДСприСтроительствеОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "19.09", "НДСПоУменьшениюСтоимостиРеализации");
	ДобавитьПредопределенныйСчет(Матрикс, "19.10", "НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза");
	
	ДобавитьПредопределенныйСчет(Матрикс, "20", "ОсновноеПроизводство_");
	ДобавитьПредопределенныйСчет(Матрикс, "20.01", "ОсновноеПроизводство");
	ДобавитьПредопределенныйСчет(Матрикс, "20.02", "ПроизводствоИзДавальческогоСырья");
	
	ДобавитьПредопределенныйСчет(Матрикс, "21", "Полуфабрикаты");
	
	ДобавитьПредопределенныйСчет(Матрикс, "23", "ВспомогательныеПроизводства_");
	ДобавитьПредопределенныйСчет(Матрикс, "23.01", "ВспомогательныеПроизводства");
	ДобавитьПредопределенныйСчет(Матрикс, "23.05", "ВыполнениеРемонтовОС");
	
	ДобавитьПредопределенныйСчет(Матрикс, "25", "ОбщепроизводственныеРасходы");
	ДобавитьПредопределенныйСчет(Матрикс, "26", "ОбщехозяйственныеРасходы");
	ДобавитьПредопределенныйСчет(Матрикс, "28", "БракВПроизводстве");
	ДобавитьПредопределенныйСчет(Матрикс, "29", "ОбслуживающиеПроизводства");
	ДобавитьПредопределенныйСчет(Матрикс, "40", "ВыпускПродукции");
	
	ДобавитьПредопределенныйСчет(Матрикс, "41", "Товары");
	ДобавитьПредопределенныйСчет(Матрикс, "41.01", "ТоварыНаСкладах");
	ДобавитьПредопределенныйСчет(Матрикс, "41.02", "ТоварыВРозничнойТорговле");
	ДобавитьПредопределенныйСчет(Матрикс, "41.03", "ТараПодТоваромИПорожняя");
	ДобавитьПредопределенныйСчет(Матрикс, "41.04", "ПокупныеИзделия");
	ДобавитьПредопределенныйСчет(Матрикс, "41.11", "ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ");
	ДобавитьПредопределенныйСчет(Матрикс, "41.12", "ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ");
	
	ДобавитьПредопределенныйСчет(Матрикс, "42", "ТорговаяНаценка");
	ДобавитьПредопределенныйСчет(Матрикс, "43", "ГотоваяПродукция");
	ДобавитьПредопределенныйСчет(Матрикс, "44", "РасходыНаПродажу");
	
	ДобавитьПредопределенныйСчет(Матрикс, "45", "ТоварыОтгруженные");
	ДобавитьПредопределенныйСчет(Матрикс, "45.01", "ПокупныеТоварыОтгруженные");
	ДобавитьПредопределенныйСчет(Матрикс, "45.02", "ГотоваяПродукцияОтгруженная");
	ДобавитьПредопределенныйСчет(Матрикс, "45.03", "ПрочиеТоварыОтгруженные");
	
	ДобавитьПредопределенныйСчет(Матрикс, "46", "ВыполненныеЭтапыПоНезавершеннымРаботам");
	
	ДобавитьПредопределенныйСчет(Матрикс, "50", "Касса");
	ДобавитьПредопределенныйСчет(Матрикс, "50.01", "КассаОрганизации");
	ДобавитьПредопределенныйСчет(Матрикс, "50.02", "ОперационнаяКасса");
	ДобавитьПредопределенныйСчет(Матрикс, "50.03", "ДенежныеДокументы");
	ДобавитьПредопределенныйСчет(Матрикс, "50.04", "КассаПлатежногоАгента");
	ДобавитьПредопределенныйСчет(Матрикс, "50.21", "КассаОрганизацииВал");
	ДобавитьПредопределенныйСчет(Матрикс, "50.23", "ДенежныеДокументыВал");
	
	ДобавитьПредопределенныйСчет(Матрикс, "51", "РасчетныеСчета");
	ДобавитьПредопределенныйСчет(Матрикс, "52", "ВалютныеСчета");
	ДобавитьПредопределенныйСчет(Матрикс, "53", "ЦифровойРубль");
	
	ДобавитьПредопределенныйСчет(Матрикс, "55", "СпециальныеСчета");
	ДобавитьПредопределенныйСчет(Матрикс, "55.01", "Аккредитивы");
	ДобавитьПредопределенныйСчет(Матрикс, "55.02", "ЧековыеКнижки");
	ДобавитьПредопределенныйСчет(Матрикс, "55.03", "ДепозитныеСчета");
	ДобавитьПредопределенныйСчет(Матрикс, "55.04", "ПрочиеСпециальныеСчета");
	ДобавитьПредопределенныйСчет(Матрикс, "55.21", "АккредитивыВал");
	ДобавитьПредопределенныйСчет(Матрикс, "55.23", "ДепозитныеСчетаВал");
	ДобавитьПредопределенныйСчет(Матрикс, "55.24", "ПрочиеСпециальныеСчетаВал");
	
	ДобавитьПредопределенныйСчет(Матрикс, "57", "ПереводыВПути_");
	ДобавитьПредопределенныйСчет(Матрикс, "57.01", "ПереводыВПути");
	ДобавитьПредопределенныйСчет(Матрикс, "57.21", "ПереводыВПутиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "57.02", "ПриобретениеИностраннойВалюты");
	ДобавитьПредопределенныйСчет(Матрикс, "57.22", "РеализацияИностраннойВалюты");
	ДобавитьПредопределенныйСчет(Матрикс, "57.03", "ПродажиПоПлатежнымКартам");
	
	ДобавитьПредопределенныйСчет(Матрикс, "58", "ФинансовыеВложения");
	ДобавитьПредопределенныйСчет(Матрикс, "58.01", "ПаиИАкции");
	ДобавитьПредопределенныйСчет(Матрикс, "58.01.1", "Паи");
	ДобавитьПредопределенныйСчет(Матрикс, "58.01.2", "Акции");
	ДобавитьПредопределенныйСчет(Матрикс, "58.02", "ДолговыеЦенныеБумаги");
	ДобавитьПредопределенныйСчет(Матрикс, "58.03", "ПредоставленныеЗаймы");
	ДобавитьПредопределенныйСчет(Матрикс, "58.04", "ВкладыПоДоговоруПростогоТоварищества");
	ДобавитьПредопределенныйСчет(Матрикс, "58.05", "ПриобретенныеПрава");
	
	ДобавитьПредопределенныйСчет(Матрикс, "59", "РезервыПодОбесценениеФинансовыхВложений");
	
	ДобавитьПредопределенныйСчет(Матрикс, "60", "РасчетыСПоставщикамиИПодрядчиками");
	ДобавитьПредопределенныйСчет(Матрикс, "60.01", "РасчетыСПоставщиками");
	ДобавитьПредопределенныйСчет(Матрикс, "60.02", "РасчетыПоАвансамВыданным");
	ДобавитьПредопределенныйСчет(Матрикс, "60.03", "ВекселяВыданные");
	ДобавитьПредопределенныйСчет(Матрикс, "60.21", "РасчетыСПоставщикамиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "60.22", "РасчетыПоАвансамВыданнымВал");
	ДобавитьПредопределенныйСчет(Матрикс, "60.31", "РасчетыСПоставщикамиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "60.32", "РасчетыПоАвансамВыданнымУЕ");
	
	ДобавитьПредопределенныйСчет(Матрикс, "62", "РасчетыСПокупателямиИЗаказчиками");
	ДобавитьПредопределенныйСчет(Матрикс, "62.01", "РасчетыСПокупателями");
	ДобавитьПредопределенныйСчет(Матрикс, "62.02", "РасчетыПоАвансамПолученным");
	ДобавитьПредопределенныйСчет(Матрикс, "62.03", "ВекселяПолученные");
	ДобавитьПредопределенныйСчет(Матрикс, "62.21", "РасчетыСПокупателямиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "62.22", "РасчетыПоАвансамПолученнымВал");
	ДобавитьПредопределенныйСчет(Матрикс, "62.31", "РасчетыСПокупателямиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "62.32", "РасчетыПоАвансамПолученнымУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "62.ОТ", "РасчетыПоАвансамПолученнымВСчетОтгрузки");
	ДобавитьПредопределенныйСчет(Матрикс, "62.ОТ.1", "РасчетыПоАвансамПолученнымВСчетОтгрузкиРуб");
	ДобавитьПредопределенныйСчет(Матрикс, "62.ОТ.2", "РасчетыПоАвансамПолученнымВСчетОтгрузкиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "62.ОТ.3", "РасчетыПоАвансамПолученнымВСчетОтгрузкиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "62.Р", "РасчетыСРозничнымиПокупателями");
	
	ДобавитьПредопределенныйСчет(Матрикс, "63", "РезервыПоСомнительнымДолгам");
	
	ДобавитьПредопределенныйСчет(Матрикс, "66", "РасчетыПоКраткосрочнымКредитамИЗаймам");
	ДобавитьПредопределенныйСчет(Матрикс, "66.01", "КраткосрочныеКредиты");
	ДобавитьПредопределенныйСчет(Матрикс, "66.02", "ПроцентыПоКраткосрочнымКредитам");
	ДобавитьПредопределенныйСчет(Матрикс, "66.03", "КраткосрочныеЗаймы");
	ДобавитьПредопределенныйСчет(Матрикс, "66.04", "ПроцентыПоКраткосрочнымЗаймам");
	ДобавитьПредопределенныйСчет(Матрикс, "66.05", "КраткосрочныеДолговыеЦенныеБумаги");
	ДобавитьПредопределенныйСчет(Матрикс, "66.06", "ПроцентыПоКраткосрочнымДолговымЦеннымБумагам");
	ДобавитьПредопределенныйСчет(Матрикс, "66.21", "КраткосрочныеКредитыВал");
	ДобавитьПредопределенныйСчет(Матрикс, "66.22", "ПроцентыПоКраткосрочнымКредитамВал");
	ДобавитьПредопределенныйСчет(Матрикс, "66.23", "КраткосрочныеЗаймыВал");
	ДобавитьПредопределенныйСчет(Матрикс, "66.24", "ПроцентыПоКраткосрочнымЗаймамВал");
	ДобавитьПредопределенныйСчет(Матрикс, "66.25", "КраткосрочныеДолговыеЦенныеБумагиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "66.26", "ПроцентыПоКраткосрочнымДолговымЦеннымБумагамВал");
	
	ДобавитьПредопределенныйСчет(Матрикс, "67", "РасчетыПоДолгосрочнымКредитамИЗаймам");
	ДобавитьПредопределенныйСчет(Матрикс, "67.01", "ДолгосрочныеКредиты");
	ДобавитьПредопределенныйСчет(Матрикс, "67.02", "ПроцентыПоДолгосрочнымКредитам");
	ДобавитьПредопределенныйСчет(Матрикс, "67.03", "ДолгосрочныеЗаймы");
	ДобавитьПредопределенныйСчет(Матрикс, "67.04", "ПроцентыПоДолгосрочнымЗаймам");
	ДобавитьПредопределенныйСчет(Матрикс, "67.05", "ДолгосрочныеДолговыеЦенныеБумаги");
	ДобавитьПредопределенныйСчет(Матрикс, "67.06", "ПроцентыПроцентыПоДолгосрочнымДолговымЦеннымБумагам");
	ДобавитьПредопределенныйСчет(Матрикс, "67.21", "ДолгосрочныеКредитыВал");
	ДобавитьПредопределенныйСчет(Матрикс, "67.22", "ПроцентыПоДолгосрочнымКредитамВал");
	ДобавитьПредопределенныйСчет(Матрикс, "67.23", "ДолгосрочныеЗаймыВал");
	ДобавитьПредопределенныйСчет(Матрикс, "67.24", "ПроцентыПоДолгосрочнымЗаймамВал");
	ДобавитьПредопределенныйСчет(Матрикс, "67.25", "ДолгосрочныеДолговыеЦенныеБумагиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "67.26", "ПроцентыПоДолгосрочнымДолговымЦеннымБумагамВал");
	
	ДобавитьПредопределенныйСчет(Матрикс, "68", "РасчетыПоНалогам");
	ДобавитьПредопределенныйСчет(Матрикс, "68.01", "НДФЛ");
	ДобавитьПредопределенныйСчет(Матрикс, "68.01.1", "НДФЛ"); // Ссылка для обслуживания унаследованного кода
	ДобавитьПредопределенныйСчет(Матрикс, "68.01.2", "НДФЛ"); // Ссылка для обслуживания унаследованного кода
	ДобавитьПредопределенныйСчет(Матрикс, "68.02", "НДС");
	ДобавитьПредопределенныйСчет(Матрикс, "68.03", "Акцизы");
	ДобавитьПредопределенныйСчет(Матрикс, "68.04", "НалогНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "68.04.1", "РасчетыСБюджетом");
	ДобавитьПредопределенныйСчет(Матрикс, "68.04.2", "РасчетНалогаНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "68.06", "ЗемельныйНалог");
	ДобавитьПредопределенныйСчет(Матрикс, "68.07", "ТранспортныйНалог");
	ДобавитьПредопределенныйСчет(Матрикс, "68.08", "НалогНаИмущество");
	ДобавитьПредопределенныйСчет(Матрикс, "68.09", "НалогНаРекламу");
	ДобавитьПредопределенныйСчет(Матрикс, "68.10", "ПрочиеНалогиИСборы");
	ДобавитьПредопределенныйСчет(Матрикс, "68.11", "ЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "68.12", "ЕНприУСН");
	ДобавитьПредопределенныйСчет(Матрикс, "68.13", "ТорговыйСбор");
	ДобавитьПредопределенныйСчет(Матрикс, "68.14", "НалогПриПСН");
	ДобавитьПредопределенныйСчет(Матрикс, "68.15", "НалогПриАУСН");
	ДобавитьПредопределенныйСчет(Матрикс, "68.16", "НалогНаПрофессиональныйДоход");
	ДобавитьПредопределенныйСчет(Матрикс, "68.17", "ТуристическийНалог");
	ДобавитьПредопределенныйСчет(Матрикс, "68.21", "НДФЛ_ИП");
	ДобавитьПредопределенныйСчет(Матрикс, "68.21.1", "НДФЛ_ИП"); // Ссылка для обслуживания унаследованного кода
	ДобавитьПредопределенныйСчет(Матрикс, "68.21.2", "НДФЛ_ИП"); // Ссылка для обслуживания унаследованного кода
	ДобавитьПредопределенныйСчет(Матрикс, "68.22", "НДСпоЭкспортуКВозмещению");
	ДобавитьПредопределенныйСчет(Матрикс, "68.32", "НДСНалоговогоАгента");
	ДобавитьПредопределенныйСчет(Матрикс, "68.34", "НалогНаПрибыльНалоговогоАгента");
	ДобавитьПредопределенныйСчет(Матрикс, "68.42", "НДСТаможенныйСоюзКУплате");
	ДобавитьПредопределенныйСчет(Матрикс, "68.52", "НДСНалоговогоАгентаПоОтдельнымВидамТоваров");
	ДобавитьПредопределенныйСчет(Матрикс, "68.90", "ЕдиныйНалоговыйСчет");
	
	ДобавитьПредопределенныйСчет(Матрикс, "69", "РасчетыПоСоциальномуСтрахованию");
	ДобавитьПредопределенныйСчет(Матрикс, "69.01", "ФСС");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02", "ПФР");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.1", "ПФР_страх");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.2", "ПФР_нак");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.3", "ПФР_доп");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.4", "ПФР_доп_шахтеры");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.5", "ПФР_доп_ВредныеУсловияТруда");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.6", "ПФР_доп_ТяжелыеУсловияТруда");
	ДобавитьПредопределенныйСчет(Матрикс, "69.02.7", "ПФР_ОПС");
	ДобавитьПредопределенныйСчет(Матрикс, "69.03", "ФОМС");
	ДобавитьПредопределенныйСчет(Матрикс, "69.03.1", "ФФОМС");
	ДобавитьПредопределенныйСчет(Матрикс, "69.03.2", "ТФОМС");
	ДобавитьПредопределенныйСчет(Матрикс, "69.04", "ЕСН_ФБ");
	ДобавитьПредопределенныйСчет(Матрикс, "69.05", "ПФР_ДОБР");
	ДобавитьПредопределенныйСчет(Матрикс, "69.05.1", "ПФР_ДОБР_орг");
	ДобавитьПредопределенныйСчет(Матрикс, "69.05.2", "ПФР_ДОБР_сотр");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.1", "ПФР_Страх_СтраховойГод");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.2", "ПФР_Нак_СтраховойГод");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.3", "ФОМС_СтраховойГод");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.4", "ФСС_СтраховойГод");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.5", "ПФР_ОПС_ИП");
	ДобавитьПредопределенныйСчет(Матрикс, "69.06.6", "СтраховыеВзносыЕдиныйТариф_ИП");
	ДобавитьПредопределенныйСчет(Матрикс, "69.09", "СтраховыеВзносыЕдиныйТариф");
	ДобавитьПредопределенныйСчет(Матрикс, "69.11", "ФСС_НСиПЗ");
	ДобавитьПредопределенныйСчет(Матрикс, "69.12", "ФСС_ДобровольныеВзносы");
	ДобавитьПредопределенныйСчет(Матрикс, "69.13", "ФСС_СПЕЦ");
	ДобавитьПредопределенныйСчет(Матрикс, "69.13.1", "ФСС_СПЕЦ_ЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "69.13.2", "ФСС_СПЕЦ_УСН");
	
	ДобавитьПредопределенныйСчет(Матрикс, "70", "РасчетыСПерсоналомПоОплатеТруда");
	
	ДобавитьПредопределенныйСчет(Матрикс, "71", "РасчетыСПодотчетнымиЛицами_");
	ДобавитьПредопределенныйСчет(Матрикс, "71.01", "РасчетыСПодотчетнымиЛицами");
	ДобавитьПредопределенныйСчет(Матрикс, "71.21", "РасчетыСПодотчетнымиЛицамиВал");
	
	ДобавитьПредопределенныйСчет(Матрикс, "73", "РасчетыСПерсоналомПоПрочимОперациям");
	ДобавитьПредопределенныйСчет(Матрикс, "73.01", "РасчетыПоПредоставленнымЗаймам");
	ДобавитьПредопределенныйСчет(Матрикс, "73.02", "РасчетыПоВозмещениюМатериальногоУщерба");
	ДобавитьПредопределенныйСчет(Матрикс, "73.03", "РасчетыПоПрочимОперациям");
	
	ДобавитьПредопределенныйСчет(Матрикс, "75", "РасчетыСУчредителями");
	ДобавитьПредопределенныйСчет(Матрикс, "75.01", "РасчетыПоВкладамВУставныйКапитал");
	ДобавитьПредопределенныйСчет(Матрикс, "75.02", "РасчетыПоВыплатеДоходов");
	
	ДобавитьПредопределенныйСчет(Матрикс, "76", "РасчетыСРазнымиДебиторамиИКредиторами");
	ДобавитьПредопределенныйСчет(Матрикс, "76.01", "РасчетыПоИмущественномуЛичномуИДобровольномуСтрахованию");
	ДобавитьПредопределенныйСчет(Матрикс, "76.01.1", "РасчетыПоИмущественномуИЛичномуСтрахованию");
	ДобавитьПредопределенныйСчет(Матрикс, "76.01.2", "ПлатежиПоДобровольномуСтрахованиюРаботников");
	ДобавитьПредопределенныйСчет(Матрикс, "76.01.9", "ПлатежиПоПрочимВидамСтрахования");
	ДобавитьПредопределенныйСчет(Матрикс, "76.02", "РасчетыПоПретензиям");
	ДобавитьПредопределенныйСчет(Матрикс, "76.03", "РасчетыПоПричитающимсяДивидендам");
	ДобавитьПредопределенныйСчет(Матрикс, "76.04", "РасчетыПоДепонированнымСуммам");
	ДобавитьПредопределенныйСчет(Матрикс, "76.05", "РасчетыСПрочимиПоставщикамиИПодрядчиками");
	ДобавитьПредопределенныйСчет(Матрикс, "76.06", "РасчетыСПрочимиПокупателямиИЗаказчиками");
	ДобавитьПредопределенныйСчет(Матрикс, "76.07", "РасчетыПоАренде");
	ДобавитьПредопределенныйСчет(Матрикс, "76.07.1", "АрендныеОбязательства");
	ДобавитьПредопределенныйСчет(Матрикс, "76.07.2", "АрендныеПлатежи");
	ДобавитьПредопределенныйСчет(Матрикс, "76.07.5", "ПроцентыПоАренде");
	ДобавитьПредопределенныйСчет(Матрикс, "76.07.9", "НДСпоАренднымОбязательствам");
	ДобавитьПредопределенныйСчет(Матрикс, "76.08", "ПроцентыПоРассрочке");
	ДобавитьПредопределенныйСчет(Матрикс, "76.27", "РасчетыПоАрендеВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.27.1", "АрендныеОбязательстваВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.27.2", "АрендныеПлатежиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.27.5", "ПроцентыПоАрендеВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.27.9", "НДСпоАренднымОбязательствамВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.28", "ПроцентыПоРассрочкеВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.37", "РасчетыПоАрендеУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.37.1", "АрендныеОбязательстваУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.37.2", "АрендныеПлатежиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.37.5", "ПроцентыПоАрендеУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.37.9", "НДСпоАренднымОбязательствамУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.38", "ПроцентыПоРассрочкеУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.09", "ПрочиеРасчетыСРазнымиДебиторамиИКредиторами");
	ДобавитьПредопределенныйСчет(Матрикс, "76.10", "ПрочиеРасчетыСФизическимиЛицами");
	ДобавитьПредопределенныйСчет(Матрикс, "76.13", "РасчетыСФакторинговымиКомпаниями");
	ДобавитьПредопределенныйСчет(Матрикс, "76.14", "Билеты");
	ДобавитьПредопределенныйСчет(Матрикс, "76.15", "ТопливныеКарты");
	ДобавитьПредопределенныйСчет(Матрикс, "76.16", "РасчетыССамозанятыми");
	ДобавитьПредопределенныйСчет(Матрикс, "76.17", "РасчетыПоНалогамСТретьимиЛицами");
	ДобавитьПредопределенныйСчет(Матрикс, "76.18", "ПриобретениеПравНаИспользованиеРезультатовИнтеллектуальнойДеятельности");
	ДобавитьПредопределенныйСчет(Матрикс, "76.21", "РасчетыПоИмущественномуИЛичномуСтрахованиюВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.22", "РасчетыПоПретензиямВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.25", "РасчетыСПрочимиПоставщикамиИПодрядчикамиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.26", "РасчетыСПрочимиПокупателямиИЗаказчикамиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.29", "ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал");
	ДобавитьПредопределенныйСчет(Матрикс, "76.32", "РасчетыПоПретензиямУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.35", "РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.36", "РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.39", "ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ");
	ДобавитьПредопределенныйСчет(Матрикс, "76.41", "РасчетыПоИсполнительнымДокументамРаботников");
	ДобавитьПредопределенныйСчет(Матрикс, "76.49", "РасчетыПоПрочимУдержаниямРаботников");
	ДобавитьПредопределенныйСчет(Матрикс, "76.ВА", "НДСпоАвансамИПредоплатамВыданным");
	ДобавитьПредопределенныйСчет(Матрикс, "76.АВ", "НДСпоАвансамИПредоплатам");
	ДобавитьПредопределенныйСчет(Матрикс, "76.К", "КорректировкаРасчетовПрошлогоПериода");
	ДобавитьПредопределенныйСчет(Матрикс, "76.Н", "РасчетыПоНДСотложенномуДляУплатыВБюджет");
	ДобавитьПредопределенныйСчет(Матрикс, "76.НА", "РасчетыНДСНалоговогоАгента");
	ДобавитьПредопределенныйСчет(Матрикс, "76.ОТ", "НДСНачисленныйПоОтгрузке");
	
	ДобавитьПредопределенныйСчет(Матрикс, "77", "ОтложенныеНалоговыеОбязательства");
	ДобавитьПредопределенныйСчет(Матрикс, "79", "ВнутрихозяйственныеРасчеты");
	ДобавитьПредопределенныйСчет(Матрикс, "80", "УставныйКапитал");
	ДобавитьПредопределенныйСчет(Матрикс, "81", "СобственныеАкции");
	
	ДобавитьПредопределенныйСчет(Матрикс, "82", "РезервныйКапитал");
	ДобавитьПредопределенныйСчет(Матрикс, "82.01", "РезервыОбразованныеВСоответствииСЗаконодательством");
	ДобавитьПредопределенныйСчет(Матрикс, "82.02", "РезервыОбразованныеВСоответствииСУчредительнымиДокументами");
	
	ДобавитьПредопределенныйСчет(Матрикс, "83", "ДобавочныйКапитал");
	ДобавитьПредопределенныйСчет(Матрикс, "83.01", "ПриростСтоимостиПоПереоценке");
	ДобавитьПредопределенныйСчет(Матрикс, "83.01.1", "ПриростСтоимостиИмуществаПоПереоценке");
	ДобавитьПредопределенныйСчет(Матрикс, "83.01.2", "ПриростСтоимостиНМАПоПереоценке");
	ДобавитьПредопределенныйСчет(Матрикс, "83.01.3", "ПриростСтоимостиПрочихВнеоборотныхАктивоПоПереоценке");
	
	ДобавитьПредопределенныйСчет(Матрикс, "84", "НераспределеннаяПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "84.01", "ПрибыльПодлежащаяРаспределению");
	ДобавитьПредопределенныйСчет(Матрикс, "84.02", "УбытокПодлежащийПокрытию");
	
	ДобавитьПредопределенныйСчет(Матрикс, "86", "ЦелевоеФинансирование");
	
	ДобавитьПредопределенныйСчет(Матрикс, "90", "Продажи");
	ДобавитьПредопределенныйСчет(Матрикс, "90.01", "Выручка");
	ДобавитьПредопределенныйСчет(Матрикс, "90.02", "СебестоимостьПродаж");
	ДобавитьПредопределенныйСчет(Матрикс, "90.03", "Продажи_НДС");
	ДобавитьПредопределенныйСчет(Матрикс, "90.04", "Продажи_Акцизы");
	ДобавитьПредопределенныйСчет(Матрикс, "90.05", "Продажи_ЭкспортныеПошлины");
	ДобавитьПредопределенныйСчет(Матрикс, "90.08", "Продажи_УправленческиеРасходы");
	ДобавитьПредопределенныйСчет(Матрикс, "90.07", "Продажи_РасходыНаПродажу");
	ДобавитьПредопределенныйСчет(Матрикс, "90.01.1", "ВыручкаНеЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.01.2", "ВыручкаЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.02.1", "СебестоимостьПродажНеЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.02.2", "СебестоимостьПродажЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.07.1", "Продажи_РасходыНаПродажуНеЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.07.2", "Продажи_РасходыНаПродажуЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.08.1", "Продажи_УправленческиеРасходыНеЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "90.08.2", "Продажи_УправленческиеРасходыЕНВД");
	
	ДобавитьПредопределенныйСчет(Матрикс, "91", "ПрочиеДоходыИРасходы");
	ДобавитьПредопределенныйСчет(Матрикс, "91.01", "ПрочиеДоходы");
	ДобавитьПредопределенныйСчет(Матрикс, "91.02", "ПрочиеРасходы");
	
	ДобавитьПредопределенныйСчет(Матрикс, "99", "ПрибылиИУбытки");
	ДобавитьПредопределенныйСчет(Матрикс, "99.01", "ПрибылиИУбыткиБезНалогаНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02", "ПрибылиИУбытки_НалогНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.1", "УсловныйРасходПоНалогуНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.2", "УсловныйДоходПоНалогуНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.3", "ПостоянноеНалоговоеОбязательство");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.4", "ПрибылиИУбыткиОтПересчетаОНА_ОНО");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.Т", "ТекущийНалогНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.02.О", "ОтложенныйНалогНаПрибыль");
	ДобавитьПредопределенныйСчет(Матрикс, "99.01.1", "ПрибылиИУбыткиНеЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "99.01.2", "ПрибылиИУбыткиЕНВД");
	ДобавитьПредопределенныйСчет(Матрикс, "99.09", "ПрочиеПрибылиИУбытки");
	
	ДобавитьПредопределенныйСчет(Матрикс, "94", "НедостачиИПотериОтПорчиЦенностей");
	
	ДобавитьПредопределенныйСчет(Матрикс, "96", "РезервыПредстоящихРасходов");
	ДобавитьПредопределенныйСчет(Матрикс, "96.01", "ОценочныеОбязательстваПоВознаграждениямРаботникам");
	ДобавитьПредопределенныйСчет(Матрикс, "96.01.1", "ОценочныеОбязательстваПоВознаграждениям");
	ДобавитьПредопределенныйСчет(Матрикс, "96.01.2", "ОценочныеОбязательстваПостраховымВзносам");
	ДобавитьПредопределенныйСчет(Матрикс, "96.09", "РезервыПредстоящихРасходовПрочие");
	
	ДобавитьПредопределенныйСчет(Матрикс, "97", "РасходыБудущихПериодов");
	ДобавитьПредопределенныйСчет(Матрикс, "97.01", "РасходыНаОплатуТрудаБудущихПериодов");
	ДобавитьПредопределенныйСчет(Матрикс, "97.02", "РасходыБудущихПериодовНаДобровольноеСтрахованиеРаботников");
	ДобавитьПредопределенныйСчет(Матрикс, "97.21", "ПрочиеРасходыБудущихПериодов");
	
	ДобавитьПредопределенныйСчет(Матрикс, "98", "ДоходыБудущихПериодов");
	ДобавитьПредопределенныйСчет(Матрикс, "98.01", "ДоходыПолученныеВСчетБудущихПериодов");
	ДобавитьПредопределенныйСчет(Матрикс, "98.02", "БезвозмездныеПоступления");
	ДобавитьПредопределенныйСчет(Матрикс, "98.03", "ПредстоящиеПоступленияПоНедостачамВыявленнымЗаПрошлыеГоды");
	ДобавитьПредопределенныйСчет(Матрикс, "98.04", "РазницаМеждуСуммойПодлежащейВзысканиюСВиновныхЛицИБалансовойСтоимостьюПоНедостачамЦенностей");
	
	ДобавитьПредопределенныйСчет(Матрикс, "001", "АрендованныеОсновныеСредства");
	ДобавитьПредопределенныйСчет(Матрикс, "002", "ТМЦпринятыеНаОтветственноеХранение");
	ДобавитьПредопределенныйСчет(Матрикс, "003", "МатериалыПринятыеВПереработку_");
	ДобавитьПредопределенныйСчет(Матрикс, "004", "ТоварыПринятыеНаКомиссию");
	ДобавитьПредопределенныйСчет(Матрикс, "005", "ОборудованиеПринятоеДляМонтажа");
	ДобавитьПредопределенныйСчет(Матрикс, "007", "СписаннаяВУбытокЗадолженностьДебиторов");
	ДобавитьПредопределенныйСчет(Матрикс, "008", "ОбеспеченияОбязательствИПлатежейПолученные");
	ДобавитьПредопределенныйСчет(Матрикс, "009", "ОбеспеченияОбязательствИПлатежейВыданные");
	ДобавитьПредопределенныйСчет(Матрикс, "010", "ИзносОсновныхСредств");
	ДобавитьПредопределенныйСчет(Матрикс, "011", "ОсновныеСредстваСданныеВАренду");
	ДобавитьПредопределенныйСчет(Матрикс, "012", "ВозвратнаяТара"); 
	//ЮЦАУ
	ДобавитьПредопределенныйСчет(Матрикс, "73.04", "Расчеты с персоналом по сомнительным долгам (уволенные)"); 
	//ЮЦАУ
	
	ЗаполнениеБухгалтерскойОтчетностиПереопределяемый.ДобавитьПредопределенныеСчета(Матрикс);
	
	ЗапросПоРеквизитам = Новый Запрос;
	ЗапросПоРеквизитам.Текст =
		"ВЫБРАТЬ
		|	Матрикс.Счет КАК Счет,
		|	Матрикс.УсловныйКод КАК УсловныйКод
		|ПОМЕСТИТЬ ВТ_Матрикс
		|ИЗ
		|	&Матрикс КАК Матрикс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Матрикс.УсловныйКод КАК УсловныйКод,
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Код КАК Код,
		|	Хозрасчетный.Наименование КАК Наименование
		|ИЗ
		|	ВТ_Матрикс КАК ВТ_Матрикс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|		ПО ВТ_Матрикс.Счет = Хозрасчетный.Ссылка";
	
	ЗапросПоРеквизитам.УстановитьПараметр("Матрикс", Матрикс);
	
	Результат = ЗапросПоРеквизитам.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("УсловныйКод");
	
	Возврат Результат;
	
КонецФункции
//	ДобавитьПредопределенныйСчет(Матрикс, "73.04", "Расчеты с персоналом по сомнительным долгам (уволенные)"); //ЮЦАУ

&Вместо("ДобавитьПредопределенныйСчет")
Процедура Расш1_ДобавитьПредопределенныйСчет(Счета, УсловныйКодСчета, ИмяСчета)
	
	НовыйСчет = Счета.Добавить();
	НовыйСчет.УсловныйКод = УсловныйКодСчета; 
	Предварительно =  ПланыСчетов.Хозрасчетный.НайтиПоКоду(УсловныйКодСчета);  //ЮЦАУ
	Если Предварительно <> Неопределено Тогда
		НовыйСчет.Счет = Предварительно;
	Иначе
		НовыйСчет.Счет = ПланыСчетов.Хозрасчетный[ИмяСчета];
	Конецесли;	
	
	
КонецПроцедуры
