////Метки изменения  //processor, //ЮЦАУ

// //Сервисные процедуры
Функция ПолучитьЗначениеПоИдентификатору(Идентификатор,Организация = Неопределено,ДатаСреза = '00010101000000') Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Период,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Идентификатор,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Значение,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.ЗначенияПоУмолчанию_ЮЦАУ.СрезПоследних(
	|			&ДатаСреза,
	|			Идентификатор = &Идентификатор
	|				И Организация = &Организация) КАК ЗначенияПоУмолчанию_ЮЦАУСрезПоследних";
	
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);
	Запрос.УстановитьПараметр("ДатаСреза",ДатаСреза);
	
	Если Организация <> Справочники.Организации.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("Организация",Организация);
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Организация = &Организация","");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат(Результат.Значение);
	КонецЕсли;
	
КонецФункции	

Процедура ОбработатьТребованиеНакладная(Документ)
	
	ПроводкиДокумента = Документ.Движения.Хозрасчетный.Выгрузить();
	
	Записывать = Ложь;
	
	Для Каждого Стр Из ПроводкиДокумента Цикл
		
		Если Стр.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Материалы) Тогда
			
			Проводка = Документ.Движения.Хозрасчетный.Добавить();
			Проводка.Организация = Документ.Организация;
			Проводка.Содержание  = "Оприходовано ТМЦ (ДЭП)";
			Проводка.Период = Документ.Дата;
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("013");
			Проводка.СубконтоДт.Номенклатура = Стр.СубконтоКт2;
			Проводка.СубконтоДт.Склады = Стр.СубконтоКт3;
			Проводка.КоличествоДт = Стр.КоличествоКт;
			Проводка.Сумма = Стр.Сумма;
			
			Записывать = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Записывать Тогда
		Попытка
			Документ.Движения.Хозрасчетный.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПередачаОС(Источник)
	
	СтруктураШапкиДокумента = Источник.Ссылка;
	
	Записывать = Ложь;
	
	нзБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	нзБУ.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзБУ.Прочитать();
	
	Если СтруктураШапкиДокумента.ПередачаВДепартамент Тогда
		
		ПроводкиДокумента =   Источник.Движения.Хозрасчетный.Выгрузить();
		СодержаниеПроводки = "Передача ОС";
		
		Для Каждого Стр Из ПроводкиДокумента Цикл
			
			Если  Стр.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеДоходы И  Стр.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоВкладамВУставныйКапитал Тогда
				
				//Проводка Дт84.07 Кт75.01 				
				Проводка = нзБУ.Добавить();
				Проводка.Период       = СтруктураШапкиДокумента.Дата;
				Проводка.Активность   = Истина;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание   = СодержаниеПроводки;
				Проводка.Сумма        = Стр.Сумма;
				
				Проводка.СчетДт       = ПланыСчетов.Хозрасчетный.ИмуществоСверхУставногоКапитала;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"НаправленияИспользованияПрибыли", СтруктураШапкиДокумента.НаправленияИспользованияПрибыли);				
				Проводка.СчетКт       = ПланыСчетов.Хозрасчетный.РасчетыПоВкладамВУставныйКапитал;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"Контрагенты", СтруктураШапкиДокумента.Контрагент);
				
				//Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
				//	НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаПроводкиНУ,СуммаПроводкиНУ,СуммаПроводкиПР,СуммаПроводкиПР,СуммаПроводкиВР,СуммаПроводкиВР,Проводка, СтруктураШапкиДокумента.ПрименениеПБУ18);
				//КонецЕсли;
				Записывать = Истина;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	 
	
	Если Записывать Тогда
		нзБУ.ОбменДанными.Загрузка = Истина;
		нзБУ.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОказаниеУслуг(Источник)
	
	СтруктураШапкиДокумента = Источник.Ссылка;
	
	Если НЕ ЮЦАУ.ПолучитьЗначениеПоИдентификатору ("СворачиватьЧастныйСектор",СтруктураШапкиДокумента.Организация,СтруктураШапкиДокумента.Дата) Тогда
		Возврат;
	КонецЕсли;	
	
	Записывать = Ложь;
	
	нзБУ = Источник.Движения.Хозрасчетный.Выгрузить();
	
	ПроводкиДокумента =   Источник.Движения.Хозрасчетный;
	СодержаниеПроводки = "Оказание услуг";
	
	знАбонентскаяПлата = ЮЦАУ.ПолучитьЗначениеПоИдентификатору ("АбонентскаяПлата",СтруктураШапкиДокумента.Организация,СтруктураШапкиДокумента.Дата);
	знКонтрагентЧастныйСектор = ЮЦАУ.ПолучитьЗначениеПоИдентификатору ("КонтрагентЧастныйСектор",СтруктураШапкиДокумента.Организация,СтруктураШапкиДокумента.Дата);
	знДоговорЧастныйСектор = ЮЦАУ.ПолучитьЗначениеПоИдентификатору ("ДоговорЧастныйСектор",СтруктураШапкиДокумента.Организация,СтруктураШапкиДокумента.Дата);
	
	Для Каждого Стр Из нзБУ Цикл
		//	
		Если  Стр.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями Тогда
			Если Стр.СубконтоДт2.ВидВзаиморасчетов = знАбонентскаяПлата Тогда
				
				Проводка = ПроводкиДокумента.Добавить();
				Проводка.Период       = СтруктураШапкиДокумента.Дата;
				Проводка.Активность   = Истина;
				Проводка.Организация  = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание   = СодержаниеПроводки;
				Проводка.Сумма        = Стр.Сумма;
				
				Проводка.СчетДт       = ПланыСчетов.Хозрасчетный.РасчетыСЧастнымСектором;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Контрагенты", Стр.СубконтоДт1);				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"Договоры", Стр.СубконтоДт2);				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"ДокументыРасчетовСКонтрагентами", Стр.СубконтоДт3);				
				
				Записывать = Истина;
				
			КонецЕсли;	
		КонецЕсли;	
		
		текПроводка = ПроводкиДокумента [Стр.НомерСтроки-1];
		//
		ВидыСубконтоСчетаДт = текПроводка.СчетДт.ВидыСубконто;
		ВидыСубконтоСчетаКт = текПроводка.СчетКт.ВидыСубконто;
		
		Если НЕ текПроводка.СчетДт.Забалансовый Тогда
			Если ВидыСубконтоСчетаДт.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты) <> Неопределено Тогда
				текПроводка.СубконтоДт.Контрагенты = знКонтрагентЧастныйСектор; 
				Записывать = Истина;
			КонецЕсли;	
			
			Если ВидыСубконтоСчетаДт.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры) <> Неопределено Тогда
				текПроводка.СубконтоДт.Договоры = знДоговорЧастныйСектор; 
				Записывать = Истина;
			КонецЕсли;	
		КонецЕсли;
		//
		//Если НЕ текПроводка.СчетКт.Забалансовый Тогда
		//	Если ВидыСубконтоСчетаКт.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты) <> Неопределено Тогда
		//		текПроводка.СубконтоКт.Контрагенты = знКонтрагентЧастныйСектор; 
		//		Записывать = Истина;
		//	КонецЕсли;	
		//	
		//	Если ВидыСубконтоСчетаКт.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры) <> Неопределено Тогда
		//		текПроводка.СубконтоКт.Договоры = знДоговорЧастныйСектор; 
		//		Записывать = Истина;
		//	КонецЕсли;	
		//КонецЕсли;
		
	КонецЦикла;	
	
	Если Записывать Тогда
		ПроводкиДокумента.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Функция ВремяВходитВИнтервал(пДатаВыезда,пДатаВозвращения,пНачалоОбеда,пКонецОбеда)
	
	пВремяОбеда = 0;
	
	Если  КонецДня(пДатаВыезда) < КонецДня(пДатаВозвращения) Тогда //Несколько  дней
		
		Пока пДатаВыезда < пДатаВозвращения Цикл
			
			КонецДня = Мин(КонецДня(пДатаВыезда),пДатаВозвращения);
			
			Если пДатаВыезда < Дата(Год(пДатаВыезда),Месяц(пДатаВыезда),День(пДатаВыезда),Час(пНачалоОбеда),Минута(пНачалоОбеда),Секунда(пНачалоОбеда)) И 
				КонецДня > Дата(Год(КонецДня),Месяц(КонецДня),День(КонецДня),Час(пКонецОбеда),Минута(пКонецОбеда),Секунда(пКонецОбеда)) Тогда 
				пВремяОбеда = пВремяОбеда + (пКонецОбеда-пНачалоОбеда);
			КонецЕсли;
			
			пДатаВыезда = КонецДня + 1;
			
		КонецЦикла;
		
		Возврат(пВремяОбеда);
		
	Иначе
		
		КонецДня = Мин(КонецДня(пДатаВыезда),пДатаВозвращения);
		
		Если пДатаВыезда < Дата(Год(пДатаВыезда),Месяц(пДатаВыезда),День(пДатаВыезда),Час(пНачалоОбеда),Минута(пНачалоОбеда),Секунда(пНачалоОбеда)) И 
			КонецДня > Дата(Год(КонецДня),Месяц(КонецДня),День(КонецДня),Час(пКонецОбеда),Минута(пКонецОбеда),Секунда(пКонецОбеда)) Тогда 
			пВремяОбеда = пВремяОбеда + (пКонецОбеда-пНачалоОбеда);
		КонецЕсли;
		
		Возврат(пВремяОбеда);
		
	КонецЕсли;	
	
	Возврат(0);
	
КонецФункции	


Функция ПолучитьДолжностьСотрудникаУАТ(Сотрудник,Организация,КонПериода) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатСведенияОСотрудникахСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(
	|			&КонПериода,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация) КАК уатСведенияОСотрудникахСрезПоследних";
	
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если  РезультатЗапроса.Следующий() Тогда
		Возврат(РезультатЗапроса.Должность);
	Иначе	
		Возврат(Неопределено);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВидОбслуживанияТСсОсобымПорядкомУчета(ВидОбслуживанияТС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОбслуживанияТСсОсобымПорядкомУчета.ВидОбслуживания
	|ИЗ
	|	РегистрСведений.ВидыОбслуживанияТСсОсобымПорядкомУчета КАК ВидыОбслуживанияТСсОсобымПорядкомУчета
	|ГДЕ
	|	ВидыОбслуживанияТСсОсобымПорядкомУчета.ВидОбслуживания = &ВидОбслуживанияТС";
	
	Запрос.УстановитьПараметр("ВидОбслуживанияТС",ВидОбслуживанияТС);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат(Истина);
	Иначе
		Возврат(Ложь);
	КонецЕсли;
	
КонецФункции	

Процедура уатСписаниеТоваров(Источник)
	
	ДокументСсылка = Источник.Ссылка;
	
	ОтборОстатков = Новый ТаблицаЗначений();
	ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТаблицаЗЧ = Источник.Товары.Выгрузить();
	
	Для Каждого СтрНЗ Из ТаблицаЗЧ Цикл
		нСтр = ОтборОстатков.Добавить();
		СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, СтрНЗ.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
		нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
		//нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
		нСтр.Номенклатура = СтрНЗ.Номенклатура;
		нСтр.Склад = ДокументСсылка.Склад;
	КонецЦикла;
	
	
	нзСтоимостьЗЧ = РегистрыНакопления.ЮЦАУ_СтоимостьСписанияЗЧ.СоздатьНаборЗаписей();
	нзСтоимостьЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзСтоимостьЗЧ.Прочитать();
	
	ТаблицаОстаткиСтоимость = УчетТоваров.ПолучитьОстаткиТоваров(
	ДокументСсылка.МоментВремени(),
	ДокументСсылка.Организация,
	Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
	ОтборОстатков);
	ТаблицаОстаткиСтоимость.Свернуть("Номенклатура", "КоличествоПоСкладу, Стоимость");
	
	Для Каждого Стр Из ТаблицаЗЧ Цикл
		
		нЗапись = нзСтоимостьЗЧ.Добавить();
		нЗапись.Период = Источник.Дата;
		нЗапись.Регистратор = Источник;
		нЗапись.Склад = Источник.Склад;
		нЗапись.Номенклатура = Стр.Номенклатура;
		нЗапись.Количество = Стр.Количество;
		нЗапись.Стоимость = ?(ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура) <> Неопределено, Стр.Количество * (ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).Стоимость / ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).КоличествоПоСкладу), 0);	
		
	КонецЦикла;
	
	нзСтоимостьЗЧ.Записать();
	
КонецПроцедуры	

Процедура ОтражениеЗарплатыВБухучете(Источник)
	
	Если ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СворачиватьСотрудниковВОтраженииЗП", Источник.Организация, Источник.Дата) Тогда 
		Записывать = Ложь;
		
		//нзБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		//нзБУ.Отбор.Регистратор.Установить(Источник.Ссылка);
		//нзБУ.Прочитать();
		//ПроводкиДокумента = нзБУ;
		ПроводкиДокумента =   Источник.Движения.Хозрасчетный; //.Выгрузить();
		
		ВсеРаботники = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ВсеРаботники", Источник.Организация, Источник.Дата);
		
		Для Каждого Проводка Из ПроводкиДокумента Цикл
			
			Если Проводка.СчетДт = (ПланыСЧетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)   Тогда 
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,"РаботникиОрганизаций", ВсеРаботники);				
			КонецЕсли;	
			//	Проводка.СчетКт.ПринадлежитЭлементу (ПланыСЧетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_)
			Если Проводка.СчетКт = (ПланыСЧетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)    Тогда 
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,"РаботникиОрганизаций", ВсеРаботники);				
			КонецЕсли;	
			
			//Если Стр.СчетДт.ПринадлежитЭлементу(ПланыСЧетов.Хозрасчетный.РезервыПредстоящихРасходов) 
			//	И Стр.СчетКт.ПринадлежитЭлементу(ПланыСЧетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию) Тогда
			//		
			//	Стр.СчетДт = ПланыСЧетов.Хозрасчетный.НайтиПоКоду("96.01.2");
			//	Записывать = Истина;
			//	
			//КонецЕсли;	
			//
			//Если Стр.СчетДт.ПринадлежитЭлементу(ПланыСЧетов.Хозрасчетный.РезервыПредстоящихРасходов) 
			//	И Стр.СчетКт = ПланыСЧетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда Тогда
			//	
			//	Стр.СчетДт = ПланыСЧетов.Хозрасчетный.НайтиПоКоду("96.01.1");
			//	Записывать = Истина;
			//	
			//КонецЕсли;	
			
		КонецЦикла;	
		
		Если Записывать Тогда
			//ПроводкиДокумента.ОбменДанными.Загрузка = Истина;
			ПроводкиДокумента.Записать();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры	

Процедура уатВыдачаРасходныхМатериалов(Источник)
	
	ДокументСсылка = Источник.Ссылка; 
	
	ЗЧ = Источник.Материалы.Выгрузить();
	
	Если Зч.Количество() > 0 Тогда
		нзРНТС = РегистрыСведений.ЮЦАУ_НоменклатураТС.СоздатьНаборЗаписей();
		нзРНТС.Отбор.Регистратор.Установить(ДокументСсылка);
		нзРНТС.Прочитать();         	
		
		Для Каждого Стр Из ЗЧ Цикл
			нЗапись = нзРНТС.Добавить();
			нЗапись.Период = Источник.Дата;
			нЗапись.Регистратор = Источник;
			нЗапись.ТС = Стр.ТС;
			нЗапись.Номенклатура = Стр.Номенклатура;
			нЗапись.Количество = Стр.Количество;
			нЗапись.ДатаУстановки = Источник.Дата;//?(ЗначениеЗаполнено(Стр.ДатаУстановки), Стр.ДатаУстановки, Источник.ДатаОкончания);
		КонецЦикла;
		
		нзРНТС.Записать();
	КонецЕсли;
	
	нзЗЧ = РегистрыНакопления.уатНоменклатураТС.СоздатьНаборЗаписей();
	нзЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзЗЧ.Прочитать();
	
	Если  нзЗЧ.Количество() > 0 Тогда 
		// Подготовим таблицу, по которой отберем остатки
		ОтборОстатков = Новый ТаблицаЗначений();
		ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Для Каждого СтрНЗ Из нзЗЧ Цикл
			нСтр = ОтборОстатков.Добавить();
			СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, СтрНЗ.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
			нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
			//нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
			нСтр.Номенклатура = СтрНЗ.Номенклатура;
			нСтр.Склад = ДокументСсылка.Склад;
		КонецЦикла;
		
		ТаблицаОстатки = УчетТоваров.ПолучитьОстаткиТоваров(
		ДокументСсылка.МоментВремени(),
		ДокументСсылка.Организация,
		Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		ОтборОстатков);
		
		Для Каждого СтрТО Из ТаблицаОстатки Цикл
			//Если нзЗЧ[СтрТО.НомерСтроки-1].Количество > СтрТО.КоличествоПоСкладу Тогда
			//	СообщениеОбОшибке = "Некорректно заполнена колонка ""Количество"" списка ""Материалы"" по " + СокрЛП(Строка(СтрТО.Номенклатура.Наименование))+ " ("+ СокрЛП(Строка(СтрТО.Номенклатура.Код))+ "). Указанное количество превышает остаток. Остаток:" + Строка(СтрТО.КоличествоПоСкладу) + " ; Не хватает: "+ Строка(нзЗЧ[СтрТО.НомерСтроки-1].Количество - СтрТО.КоличествоПоСкладу);
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			//КонецЕсли;		
		КонецЦикла;	
		
	КонецЕсли;
	
	нзСтоимостьЗЧ = РегистрыНакопления.ЮЦАУ_СтоимостьСписанияЗЧ.СоздатьНаборЗаписей();
	нзСтоимостьЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзСтоимостьЗЧ.Прочитать();
	
	ТаблицаЗЧ = Источник.Материалы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаЗЧ Цикл
		
		ОтборОстатков = Новый ТаблицаЗначений();
		ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		ДатаОстатков = КонецДня(ДокументСсылка.Дата);
		пМоментВремени = Новый МоментВремени(ДатаОстатков, ДокументСсылка.Ссылка);    
		
		нСтр = ОтборОстатков.Добавить();
		СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, Стр.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
		нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
		нСтр.Номенклатура = Стр.Номенклатура;
		нСтр.Склад = ДокументСсылка.Склад;

		ТаблицаОстаткиСтоимость = УчетТоваров.ПолучитьОстаткиТоваров(
		пМоментВремени,
		ДокументСсылка.Организация,
		Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		ОтборОстатков);
		ТаблицаОстаткиСтоимость.Свернуть("Номенклатура", "КоличествоПоСкладу, Стоимость");
		
		нЗапись = нзСтоимостьЗЧ.Добавить();
		нЗапись.Период = Источник.Дата;
		нЗапись.Регистратор = Источник;
		нЗапись.Склад = Источник.Склад;
		нЗапись.Номенклатура = Стр.Номенклатура;
		нЗапись.Количество = Стр.Количество;
		нЗапись.Стоимость = ?(ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура) <> Неопределено, Стр.Количество * (ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).Стоимость / ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).КоличествоПоСкладу), 0);	
		
	КонецЦикла;
	
	нзСтоимостьЗЧ.Записать();
	
КонецПроцедуры	

Процедура РезервыПоОплатеТруда(Источник)
	
	СтруктураШапкиДокумента = Источник.Ссылка;
	
	нзБУ = Источник.Движения.Хозрасчетный.Выгрузить();
	
	ПроводкиДокумента =   Источник.Движения.Хозрасчетный;
	
	Для Каждого Проводка Из ПроводкиДокумента Цикл
		//	
		Если  Проводка.Период <> КонецДня(СтруктураШапкиДокумента.Дата) Тогда
			
			Проводка.Период  = КонецДня(СтруктураШапкиДокумента.Дата);
			Записывать = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Записывать Тогда
		ПроводкиДокумента.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПодпискаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.ТребованиеНакладная") Тогда
		Если Источник.ОприходоватьНаЗаБалансСчет Тогда //условный признак оприходования за баланс
			ОбработатьТребованиеНакладная(Источник);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.ПередачаОС") Тогда
		ПередачаОС(Источник);
	КонецЕсли;	
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.ОтражениеЗарплатыВБухучете") Тогда
		ОтражениеЗарплатыВБухучете(Источник);
	КонецЕсли;
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.РезервыПоОплатеТруда") Тогда
		РезервыПоОплатеТруда(Источник);
	КонецЕсли;

КонецПроцедуры

Процедура РаспределитьСуммуРБПпоНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам)
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.СубконтоЗатрат3); //Отбор по транспортному средству
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, просто копируем строку
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.СубконтоЗатрат2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
	
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
		
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		//Подготовка к распределению сумм проводки по массиву коэффициентов
		СтруктураДляРаспределения 		= Новый Структура("Сумма,СуммаВР,СуммаДоговора,СуммаНУ,СуммаПР", 0,0,0,0,0);
		СтруктураТочностьРаспределения 	= Новый Структура("Сумма,СуммаВР,СуммаДоговора,СуммаНУ,СуммаПР", 2,2,2,2,2);
		ЗаполнитьЗначенияСвойств(СтруктураДляРаспределения, ТекСтрока);
			
		ТаблицаРаспределенныеСуммы = РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(СтруктураДляРаспределения, СтруктураТочностьРаспределения, МассивКоэффициентов);  
		
		//Добавление новых строк в ТаблицаРаспределения     
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТаблицаРаспределенныеСуммы[й]);

			НоваяСтрока.СубконтоЗатрат2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			
		КонецЦикла; 

	КонецЕсли;	
	
КонецПроцедуры	

Функция РаспределитьРасходыБудущихПериодов(РасчетСписанияРБП, ТаблицаРеквизиты) Экспорт
	
	Реквизиты = ТаблицаРеквизиты[0];
	
 	//Получение таблицы оборотов по сотрудникам в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);

	//Пустая таблица для распределения строк
	ТаблицаРаспределения = РасчетСписанияРБП.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.03
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из РасчетСписанияРБП Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.СчетСписания = Счет_25_03 И ЗначениеЗаполнено(ТекСтрока.СубконтоЗатрат3) Тогда 	//Распределяем на номенклатурные группы по Транспортному средству		
			РаспределитьСуммуРБПпоНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам); 	
		Иначе 
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	Возврат ТаблицаРаспределения;	
	
КонецФункции

Функция ПолучитьОборотыПоСотрудникамТСиНоменклатурнымГруппам(Организация, ДатаПериода)
	
	//Получение таблицы оборотов по сотрудникам в разрезе ТС, Подразделений и Номенклатурных групп
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОсновныеТССотрудниковСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|	ЮЦАУ_ОсновныеТССотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЮЦАУ_ОсновныеТССотрудниковСрезПоследних.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОсновныеТССотрудниковСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство
		|ПОМЕСТИТЬ ВТ_ОсновныеТССотрудников
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеТССотрудников.СрезПоследних(&ОкончаниеПериода, ) КАК ЮЦАУ_ОсновныеТССотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ ВТ_ОсновныеМаршрутыТС
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеМаршрутыТС.СрезПоследних(&ОкончаниеПериода, ) КАК ЮЦАУ_ОсновныеМаршрутыТССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.Маршрут КАК Маршрут,
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ПОМЕСТИТЬ ВТ_МаршрутыНоменклатурнойГруппы
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы.СрезПоследних(&ОкончаниеПериода, ) КАК ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеТССотрудников.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ОсновныеТССотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_ОсновныеТССотрудников.Подразделение КАК Подразделение,
		|	ВТ_ОсновныеТССотрудников.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВЗ_ОсновныеМаршрутыТС.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ ВТ_МаршрутыСотрудники
		|ИЗ
		|	ВТ_ОсновныеТССотрудников КАК ВТ_ОсновныеТССотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ОсновныеМаршрутыТС.Подразделение КАК Подразделение,
		|			ВТ_ОсновныеМаршрутыТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|			ВТ_ОсновныеМаршрутыТС.Маршрут КАК Маршрут
		|		ИЗ
		|			ВТ_ОсновныеМаршрутыТС КАК ВТ_ОсновныеМаршрутыТС) КАК ВЗ_ОсновныеМаршрутыТС
		|		ПО ВТ_ОсновныеТССотрудников.ТранспортноеСредство = ВЗ_ОсновныеМаршрутыТС.ТранспортноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаршрутыСотрудники.Сотрудник КАК Сотрудник,
		|	ВТ_МаршрутыСотрудники.Подразделение КАК Подразделение,
		|	ВТ_МаршрутыСотрудники.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВЗ_МаршрутыНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	0 КАК РабочееВремя
		|ИЗ
		|	ВТ_МаршрутыСотрудники КАК ВТ_МаршрутыСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_МаршрутыНоменклатурнойГруппы.Маршрут КАК Маршрут,
		|			ВТ_МаршрутыНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|		ИЗ
		|			ВТ_МаршрутыНоменклатурнойГруппы КАК ВТ_МаршрутыНоменклатурнойГруппы) КАК ВЗ_МаршрутыНоменклатурнойГруппы
		|		ПО ВТ_МаршрутыСотрудники.Маршрут = ВЗ_МаршрутыНоменклатурнойГруппы.Маршрут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник КАК Сотрудник,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат КАК СчетЗатрат,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СУММА(ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот) КАК РабочееВремя
		|ИЗ
		|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&НачалоПериода, &ОкончаниеПериода, Запись, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
		|ГДЕ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	НоменклатурнаяГруппа,
		|	Подразделение,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаПериода));
	
	Граница = Новый Граница(КонецМесяца(ДатаПериода), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ОкончаниеПериода", Граница); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаУмолчаний = МассивРезультатов[4].Выгрузить();
	ТаблицаИтоговая = МассивРезультатов[5].Выгрузить();
	
	// +++ 1 бит Балицкий В.В.
	ЗаполнитьПустуюНоменклатурнуюГруппуПоОсновномуМаршруту(ТаблицаУмолчаний, Организация, ДатаПериода, ТаблицаУмолчаний);
	ЗаполнитьПустуюНоменклатурнуюГруппуПоОсновномуМаршруту(ТаблицаИтоговая, Организация, ДатаПериода, ТаблицаУмолчаний);
	// --- 1 бит Балицкий В.В.
	
	//Проверка необходимости добавления строк с умолчаниями (с нулевыми коэффициентами)
	Для Каждого ТекСтрока Из ТаблицаУмолчаний Цикл

		// +++ 1 бит Балицкий В.В.
		// НайденнаяСтрока = ТаблицаИтоговая.Найти(ТекСтрока.Сотрудник, "Сотрудник"); 		
		// Если НайденнаяСтрока = Неопределено Тогда
		НайденныеСтроки = ТаблицаИтоговая.НайтиСтроки(Новый Структура("Сотрудник, Подразделение", ТекСтрока.Сотрудник, ТекСтрока.Подразделение));
		Если НайденныеСтроки.Количество() = 0 Тогда
		// --- 1 бит Балицкий В.В.
			НоваяСтрока = ТаблицаИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
		
	КонецЦикла;	
	
	// +++ 1 бит Балицкий В.В.
	ЗаполнитьПустуюНоменклатурнуюГруппуПоОсновномуМаршруту(ТаблицаИтоговая, Организация, ДатаПериода, ТаблицаУмолчаний);
	// --- 1 бит Балицкий В.В.
	
	Возврат ТаблицаИтоговая;  

КонецФункции	

// +++ 1 бит Балицкий В.В.
Процедура ЗаполнитьПустуюНоменклатурнуюГруппуПоОсновномуМаршруту(ТаблицаОборотов, Организация, ДатаПериода, ТаблицаУмолчаний = Неопределено)
	
	Если ТаблицаОборотов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Маршрут_Перегон = ПолучитьЗначениеПоИдентификатору("Маршрут_Перегон", Организация, ДатаПериода);
	Маршрут_Резерв = ПолучитьЗначениеПоИдентификатору("Маршрут_Резерв", Организация, ДатаПериода);
	Маршрут_ПеревозкаЛюдейПоГороду = ПолучитьЗначениеПоИдентификатору("Маршрут_ПеревозкаЛюдейПоГороду", Организация, ДатаПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеМаршрутыТС.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_ОсновныеМаршрутыТССрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортноеСредство,
		|	Маршрут
		|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(ДатаПериода));
	тзСоответствиеТСиМаршрута = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(ДатаПериода));
	тзСоответствиеМаршрутаИНоменклатурнойГруппы = Запрос.Выполнить().Выгрузить();
	
	ЕстьКолонкаМаршрут = ТаблицаОборотов.Колонки.Найти("Маршрут") <> Неопределено;
	
	Для Каждого СтрокаОборотов Из ТаблицаОборотов Цикл
		
		Если ЗначениеЗаполнено(СтрокаОборотов.НоменклатурнаяГруппа) Тогда
			Продолжить;
		КонецЕсли;
		
		ТСДляНГ = СтрокаОборотов.ТранспортноеСредство;
		Если ТаблицаУмолчаний <> Неопределено Тогда
			СтрокаУмолчания = ТаблицаУмолчаний.Найти(СтрокаОборотов.Сотрудник, "Сотрудник");
			Если СтрокаУмолчания <> Неопределено Тогда
				Если ЗначениеЗаполнено(СтрокаУмолчания.НоменклатурнаяГруппа) Тогда
					СтрокаОборотов.НоменклатурнаяГруппа = СтрокаУмолчания.НоменклатурнаяГруппа;
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаУмолчания.ТранспортноеСредство) Тогда
					ТСДляНГ = СтрокаУмолчания.ТранспортноеСредство;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МаршрутДляНГ = Неопределено;
		Если ЕстьКолонкаМаршрут Тогда
			МаршрутДляНГ = СтрокаОборотов.Маршрут;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(МаршрутДляНГ)
			ИЛИ МаршрутДляНГ = Маршрут_Перегон
			ИЛИ МаршрутДляНГ = Маршрут_Резерв
			ИЛИ МаршрутДляНГ = Маршрут_ПеревозкаЛюдейПоГороду Тогда
			
			НайденнаяСтрокаТС = тзСоответствиеТСиМаршрута.Найти(ТСДляНГ, "ТранспортноеСредство");
			Если НайденнаяСтрокаТС <> Неопределено Тогда
				МаршрутДляНГ = НайденнаяСтрокаТС.Маршрут;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МаршрутДляНГ) Тогда
			НайденнаяСтрокаНГ = тзСоответствиеМаршрутаИНоменклатурнойГруппы.Найти(МаршрутДляНГ, "Маршрут");
			Если НайденнаяСтрокаНГ <> Неопределено Тогда
				СтрокаОборотов.НоменклатурнаяГруппа = НайденнаяСтрокаНГ.НоменклатурнаяГруппа;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
// --- 1 бит Балицкий В.В.

Функция ПолучитьОборотыПоТСиНоменклатурнымГруппам(Организация, ДатаПериода)
	
	//Получение таблицы оборотов по ТС, Подразделений и Номенклатурных групп и СчетуЗатрат
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ ВТ_ОсновныеМаршрутыТС
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеМаршрутыТС.СрезПоследних(&ОкончаниеПериода, ) КАК ЮЦАУ_ОсновныеМаршрутыТССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.Маршрут КАК Маршрут,
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ПОМЕСТИТЬ ВТ_МаршрутыНоменклатурнойГруппы
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы.СрезПоследних(&ОкончаниеПериода, ) КАК ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеМаршрутыТС.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ОсновныеМаршрутыТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ОсновныеМаршрутыТС.Подразделение КАК Подразделение,
		|	ВЗ_МаршрутыНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	0 КАК РабочееВремя
		|ИЗ
		|	ВТ_ОсновныеМаршрутыТС КАК ВТ_ОсновныеМаршрутыТС
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_МаршрутыНоменклатурнойГруппы.Маршрут КАК Маршрут,
		|			ВТ_МаршрутыНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|		ИЗ
		|			ВТ_МаршрутыНоменклатурнойГруппы КАК ВТ_МаршрутыНоменклатурнойГруппы) КАК ВЗ_МаршрутыНоменклатурнойГруппы
		|		ПО ВТ_ОсновныеМаршрутыТС.Маршрут = ВЗ_МаршрутыНоменклатурнойГруппы.Маршрут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат КАК СчетЗатрат,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СУММА(ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот) КАК РабочееВремя
		|ИЗ
		|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&НачалоПериода, &ОкончаниеПериода, Запись, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
		|ГДЕ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатурнаяГруппа,
		|	Подразделение,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаПериода));
	
	Граница = Новый Граница(КонецМесяца(ДатаПериода), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ОкончаниеПериода", Граница); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаУмолчаний = МассивРезультатов[2].Выгрузить();
	ТаблицаИтоговая = МассивРезультатов[3].Выгрузить();
	
	//Проверка необходимости добавления строк с умолчаниями (с нулевыми коэффициентами)
	Для Каждого ТекСтрока Из ТаблицаУмолчаний Цикл

		НайденнаяСтрока = ТаблицаИтоговая.Найти(ТекСтрока.ТранспортноеСредство, "ТранспортноеСредство"); 		
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = ТаблицаИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТаблицаИтоговая;  

КонецФункции	

Процедура РаспределитьСуммуСписанияТоваровПоНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, Счет_25_03)
	
	//Уточнение субконто "Номенклатурная группа"
	//Если ТипЗнч(ТекСтрока.КорСубконто1) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
	//	СубконтоНоменклатурнаяГруппа = "КорСубконто1";
	//ИначеЕсли ТипЗнч(ТекСтрока.КорСубконто2) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		СубконтоНоменклатурнаяГруппа = "КорСубконто2";
	//ИначеЕсли ТипЗнч(ТекСтрока.КорСубконто3) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
	//	СубконтоНоменклатурнаяГруппа = "КорСубконто3";
	//КонецЕсли;	
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.КорСубконто3); //Отбор по ТС
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, распределяем на все ТС и Ном. группы
		
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока[СубконтоНоменклатурнаяГруппа] = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
	
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		//Подготовка к распределению сумм проводки по массиву коэффициентов
		СтруктураДляРаспределения 		= Новый Структура("Количество,Себестоимость,СуммаКорСписанияВР,СуммаКорСписанияНУ,СуммаКорСписанияПР,СуммаСписания,СуммаСписанияВР,СуммаСписанияНУ,СуммаСписанияПР", 0,0,0,0,0,0,0,0,0);
		СтруктураТочностьРаспределения 	= Новый Структура("Количество,Себестоимость,СуммаКорСписанияВР,СуммаКорСписанияНУ,СуммаКорСписанияПР,СуммаСписания,СуммаСписанияВР,СуммаСписанияНУ,СуммаСписанияПР", 3,2,2,2,2,2,2,2,2);
		ЗаполнитьЗначенияСвойств(СтруктураДляРаспределения, ТекСтрока);
			
		ТаблицаРаспределенныеСуммы = РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(СтруктураДляРаспределения, СтруктураТочностьРаспределения, МассивКоэффициентов);  
			
		//Добавление новых строк в ТаблицаРаспределения     
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТаблицаРаспределенныеСуммы[й]);

			НоваяСтрока[СубконтоНоменклатурнаяГруппа] = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			
		КонецЦикла; 

	КонецЕсли;	

КонецПроцедуры	

Процедура РаспределитьСписаниеТоваров(ТаблицаСписанныеМатериалы, Реквизиты) Экспорт
	
	//Получение таблицы оборотов по сотрудникам в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);
	
	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаСписанныеМатериалы.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.03
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаСписанныеМатериалы Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.КорСчетСписания = Счет_25_03 Тогда 
			Если ЗначениеЗаполнено(ТекСтрока.КорСубконто3) Тогда
				РаспределитьСуммуСписанияТоваровПоНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, Счет_25_03);  
			Иначе
				НоваяСтрока = ТаблицаРаспределения.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЕсли;	
		Иначе
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаСписанныеМатериалы = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

//Распределяет сумму по всем ТС и Номенклатурным группам оборотов
Процедура РаспределитьСуммуЗарплатыНаВсеТСиНоменклатурныеГруппыПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОбщиеОборотыПоТипамТСиНоменклатурнымГруппам, СчетЗатрат, ПодразделениеАвтоколоннаПассажирскиеПеревозки);

	СтруктураПоиска = Новый Структура("Подразделение", ПодразделениеАвтоколоннаПассажирскиеПеревозки); //Отбор по подразделению затрат
	МассивОбщиеОборотыПоТСиНоменклатурнымГруппам = тзОбщиеОборотыПоТипамТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	Если МассивОбщиеОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда // Нечего распределять
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОбщиеОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда

		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если НоваяСтрока.Счет = СчетЗатрат Тогда //Бывают проводки вида (БУ96.01.2,НУ20.01) - 70 (компенсация ежегодного отпуска), в которых не надо менять субконто в Дт. счета
			НоваяСтрока.Субконто1 = МассивОбщиеОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //20.01
		КонецЕсли;	
		
		Если НоваяСтрока.СчетНУ = СчетЗатрат Тогда //Заполнение СубконтоНУ2, СубконтоНУ3                     
			НоваяСтрока.СубконтоНУ1 = МассивОбщиеОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //20.01
		КонецЕсли;	
		
	ИначеЕсли МассивОбщиеОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда
		
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОбщиеОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОбщиеОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТекСтрока.Сумма, МассивКоэффициентов);

		Для й=0 По МассивОбщиеОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			Если НоваяСтрока.Счет = СчетЗатрат Тогда //Бывают проводки вида (БУ96.01.2,НУ20.01) - 70 (компенсация ежегодного отпуска), в которых не надо менять субконто в Дт. счета
				НоваяСтрока.Субконто1 = МассивОбщиеОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //20.01
			КонецЕсли;	
			
			Если НоваяСтрока.СчетНУ = СчетЗатрат Тогда //Заполнение СубконтоНУ2, СубконтоНУ3 
				НоваяСтрока.СубконтоНУ1 = МассивОбщиеОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //20.01
			КонецЕсли;	
			
			НоваяСтрока.Сумма = МассивРаспределенныхСумм[й];

		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьСуммуЗарплатыПоТСиНоменклатурнымГруппамПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, тзОбщиеОборотыПоПодразделениямТСиНоменклатурнымГруппам, СчетЗатрат, ПодразделениеАвтоколоннаПассажирскиеПеревозки)
	
	СтруктураПоиска = Новый Структура("Сотрудник, Подразделение", ТекСтрока.ФизическоеЛицо, ПодразделениеАвтоколоннаПассажирскиеПеревозки); //Отбор по сотруднику и подразделению затрат
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, распределяем на все ТС и Ном. группы
		
		Если ТекСтрока.ВидОперации <> Перечисления.ВидыОперацийПоЗарплате.ДоговорРаботыУслуги Тогда
			Сообщить("20.01 Для сотрудника " + ТекСтрока.ФизическоеЛицо + " не указано ТС (маршрутный автобус!) по умолчанию!");
		КонецЕсли;	
		РаспределитьСуммуЗарплатыНаВсеТСиНоменклатурныеГруппыПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОбщиеОборотыПоПодразделениямТСиНоменклатурнымГруппам, СчетЗатрат, ПодразделениеАвтоколоннаПассажирскиеПеревозки);
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если НоваяСтрока.Счет = СчетЗатрат Тогда //Бывают проводки вида (БУ96.01.2,НУ20.01) - 70 (компенсация ежегодного отпуска), в которых не надо менять субконто в Дт. счета
			НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //Счет 20.01
		КонецЕсли;	

		Если НоваяСтрока.СчетНУ = СчетЗатрат Тогда //Заполнение СубконтоНУ2, СубконтоНУ3 
			НоваяСтрока.СубконтоНУ1 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //20.01
		КонецЕсли;	
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
	
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТекСтрока.Сумма, МассивКоэффициентов);

		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			Если НоваяСтрока.Счет = СчетЗатрат Тогда //Бывают проводки вида (БУ96.01.2,НУ20.01) - 70 (компенсация ежегодного отпуска), в которых не надо менять субконто в Дт. счета
				НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //20.01
			КонецЕсли;	
			
			Если НоваяСтрока.СчетНУ = СчетЗатрат Тогда //Заполнение СубконтоНУ2, СубконтоНУ3 
				НоваяСтрока.СубконтоНУ1 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //Счет 20.01
			КонецЕсли;	
			
			НоваяСтрока.Сумма = МассивРаспределенныхСумм[й];

		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьЗарплату(ТаблицаЗаработнойПлаты, Реквизиты) Экспорт
	
	//Получение таблицы оборотов по сотрудникам в разрезе ТС, ТиповТС и Номенклатурных групп
	тзОборотыПоСотрудникамТСиНоменклатурнымГруппам = ПолучитьОборотыПоСотрудникамТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);
	
	//Получение таблицы оборотов по Подразделениям, ТС и Номенклатурным группам
	тзОбщиеОборотыПоПодразделениямТСиНоменклатурнымГруппам = тзОборотыПоСотрудникамТСиНоменклатурнымГруппам.Скопировать();
	тзОбщиеОборотыПоПодразделениямТСиНоменклатурнымГруппам.Свернуть("СчетЗатрат,Подразделение,ТранспортноеСредство,НоменклатурнаяГруппа", "РабочееВремя");
	
	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаЗаработнойПлаты.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 20.01, 25.02
	Счет_20_01 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Счет_25_02 = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники;
	Счет_26	   = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;

	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки", Реквизиты.Организация, Реквизиты.Период);
	
	СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете = ПолучитьСоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете();
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаЗаработнойПлаты Цикл
		
		Если ТекСтрока.Счет = Счет_20_01 ИЛИ ТекСтрока.СчетНУ = Счет_20_01 Тогда
			
			Подразделение = СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Получить(ТекСтрока.СпособОтраженияЗарплатыВБухучете);
			ТекСтрока.Подразделение = ?(Подразделение=Неопределено, ТекСтрока.Подразделение, Подразделение);

			Если ТекСтрока.Подразделение = ПодразделениеАвтоколоннаПассажирскиеПеревозки Тогда
				РаспределитьСуммуЗарплатыПоТСиНоменклатурнымГруппамПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоСотрудникамТСиНоменклатурнымГруппам, тзОбщиеОборотыПоПодразделениямТСиНоменклатурнымГруппам, Счет_20_01, ПодразделениеАвтоколоннаПассажирскиеПеревозки); 
			Иначе
				
				НоваяСтрока = ТаблицаРаспределения.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				
			КонецЕсли;	
			
		ИначеЕсли ТекСтрока.Счет = Счет_25_02 ИЛИ ТекСтрока.СчетНУ = Счет_25_02 ИЛИ ТекСтрока.Счет = Счет_26 ИЛИ ТекСтрока.СчетНУ = Счет_26 Тогда //Подмена подразделения по способу отражения зарплаты в бухучете

			Подразделение = СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Получить(ТекСтрока.СпособОтраженияЗарплатыВБухучете);
			ТекСтрока.Подразделение = ?(Подразделение=Неопределено, ТекСтрока.Подразделение, Подразделение);

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);

		Иначе
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаЗаработнойПлаты = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

Функция ПолучитьСоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете()
	
	СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
		|	ЮЦАУ_СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете КАК ЮЦАУ_СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Вставить(ВыборкаДетальныеЗаписи.СпособОтраженияЗарплатыВБухУчете, ВыборкаДетальныеЗаписи.Подразделение);
	КонецЦикла;
	
	Возврат СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете; 
	
КонецФункции	

//Распределяет сумму по всем ТС и Номенклатурным группам оборотов
Процедура РаспределитьСуммуНачисленияРезерваНаВсеТСиНоменклатурныеГруппыПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТипамТСиНоменклатурнымГруппам, ПодразделениеАвтоколоннаПассажирскиеПеревозки);

	СтруктураПоиска = Новый Структура("Подразделение", ПодразделениеАвтоколоннаПассажирскиеПеревозки); //Отбор по подразделению затрат
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТипамТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда // Нечего распределять
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда

		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //20.01
		//НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
		//НоваяСтрока.Субконто3 = МассивОборотыПоТСиНоменклатурнымГруппам[0].ТранспортноеСредство;
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда
		
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		//Подготовка к распределению сумм проводки по массиву коэффициентов
		СтруктураДляРаспределения 		= Новый Структура("Сумма,СуммаНУ", 0,0);
		СтруктураТочностьРаспределения 	= Новый Структура("Сумма,СуммаНУ", 2,2);
		ЗаполнитьЗначенияСвойств(СтруктураДляРаспределения, ТекСтрока);
			
		ТаблицаРаспределенныеСуммы = РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(СтруктураДляРаспределения, СтруктураТочностьРаспределения, МассивКоэффициентов);  
		
		//Добавление новых строк в ТаблицаРаспределения     
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТаблицаРаспределенныеСуммы[й]);

			НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //20.01
			//НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			//НоваяСтрока.Субконто3 = МассивОборотыПоТСиНоменклатурнымГруппам[й].ТранспортноеСредство;
			
		КонецЦикла; 

	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьСуммуНачисленияРезерваПоТСиНоменклатурнымГруппамПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, ПодразделениеАвтоколоннаПассажирскиеПеревозки)
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.Субконто3); //Отбор по Транспортному средству
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, распределяем на все ТС и Ном. группы
		
		РаспределитьСуммуНачисленияРезерваНаВсеТСиНоменклатурныеГруппыПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, ПодразделениеАвтоколоннаПассажирскиеПеревозки);
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа; //20.01
		//НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
		//НоваяСтрока.Субконто3 = МассивОборотыПоТСиНоменклатурнымГруппам[0].ТранспортноеСредство;
		
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
	
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТекСтрока.Сумма, МассивКоэффициентов);

		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока); 
			
			НоваяСтрока.Субконто1 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа; //20.01
			//НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			//НоваяСтрока.Субконто3 = МассивОборотыПоТСиНоменклатурнымГруппам[й].ТранспортноеСредство;
			
			НоваяСтрока.Сумма = МассивРаспределенныхСумм[й];

		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьНачислениеРезервов(ТаблицаРезервов, Реквизиты) Экспорт
	
	//Получение таблицы оборотов в разрезе ТС и Номенклатурных групп
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);
	
	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаРезервов.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 20.01, 25.02
	Счет_20_01 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Счет_25_02 = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники;
	Счет_26    = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
	
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки", Реквизиты.Организация, Реквизиты.Период);

	СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете = ПолучитьСоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете();

	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаРезервов Цикл
		
		Если ТекСтрока.Счет = Счет_20_01 Тогда
			
			Подразделение = СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Получить(ТекСтрока.СпособОтраженияЗарплатыВБухучете);
			ТекСтрока.Подразделение = ?(Подразделение=Неопределено, ТекСтрока.Подразделение, Подразделение);
			
			Если ТекСтрока.Подразделение = ПодразделениеАвтоколоннаПассажирскиеПеревозки Тогда
				РаспределитьСуммуНачисленияРезерваПоТСиНоменклатурнымГруппамПассажирскиеАвтобусы(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам, ПодразделениеАвтоколоннаПассажирскиеПеревозки); 
			Иначе	
				НоваяСтрока = ТаблицаРаспределения.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЕсли;	

		ИначеЕсли ТекСтрока.Счет = Счет_25_02 ИЛИ ТекСтрока.Счет = Счет_26 Тогда //Подмена подразделения по способу отражения зарплаты в бухучете

			Подразделение = СоответствиеПодразделенияИСпособаОтраженияЗарплатыВБухУчете.Получить(ТекСтрока.СпособОтраженияЗарплатыВБухучете);
			ТекСтрока.Подразделение = ?(Подразделение=Неопределено, ТекСтрока.Подразделение, Подразделение);

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
		Иначе
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаРезервов = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения по строке таблицы значений.
//
// Параметры:
//  РаспределяемаяСумма - Число  - сумма, которую надо распределить, если сумма равна 0 - то возвращается Неопределено;
//                                 Если передана отрицательная - расчет по модулю и после инверсия знаков результата.
//  Коэффициенты        - Массив - коэффициенты распределения, должны быть положительны или отрицательными одновременно
//  Точность            - Число  - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае, если распределить невозможно (кол-во коэффициентов = 0
//           есть коэффициенты с отрицательным значением или суммарный вес коэффициентов = 0),
//           тогда будет возвращено Неопределено.
//
// Пример:
//
//	Коэффициенты = Новый Массив;
//	Коэффициенты.Добавить(1);
//	Коэффициенты.Добавить(2);
//	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(1, Коэффициенты);
//	// Результат = [0.33, 0.67]
//
Функция РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(Знач СтруктураДляРаспределения, Знач СтруктураТочностьРаспределения, Знач Коэффициенты, Знач Точность=2) Экспорт
	
	ТаблицаРаспределения = Новый ТаблицаЗначений; 
	Для й=1 По Коэффициенты.Количество() Цикл
    	ТаблицаРаспределения.Добавить();
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из СтруктураДляРаспределения Цикл
		
		ТаблицаРаспределения.Колонки.Добавить(ТекЭлемент.Ключ, Новый ОписаниеТипов("Число"));  

		Если ТекЭлемент.Значение <> 0 Тогда //Есть что распределять
			
			РазрядностьЗначения = СтруктураТочностьРаспределения[ТекЭлемент.Ключ];
			МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТекЭлемент.Значение, Коэффициенты, РазрядностьЗначения);
			ТаблицаРаспределения.ЗагрузитьКолонку(МассивРаспределенныхСумм, ТекЭлемент.Ключ);

		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТаблицаРаспределения;
	
КонецФункции

Функция ОкруглитьЧерезСтроку(СуммаДляОкругления) Экспорт
	
	Запятая = Найти(Строка(СуммаДляОкругления),",");
	ЦелыеЧисла = Лев(Строка(СуммаДляОкругления),Запятая);
	Дробь = Прав(Строка(СуммаДляОкругления),СтрДлина(Строка(СуммаДляОкругления))-Запятая);
	
	Если СтрДлина(Дробь) >= 2 Тогда
		Дробь = Лев(Дробь,2);
	Иначе	   
		Дробь = Лев(Дробь + "00000000",2);
	КонецЕсли;	   
	
	фСумма = Число(ЦелыеЧисла+Дробь);
	
	Возврат(фСумма);
	
КонецФункции	

Функция ПолучитьДолжностьФизЛица(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
	|	МАКСИМУМ(ТекущиеКадровыеДанныеСотрудников.ДатаПриема) КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	|	ТекущиеКадровыеДанныеСотрудников.УдалитьТекущаяОрганизация
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	|	ТекущиеКадровыеДанныеСотрудников.УдалитьТекущаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПриема УБЫВ";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Строка(ВыборкаДетальныеЗаписи.ТекущаяДолжность);
	Иначе
		Возврат Строка("");
	КонецЕсли;
	
КонецФункции	

Процедура ОткрытьФормуДопСведенийДоговора(Договор) Экспорт
	
	Форма = Договор.ПолучитьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаДополнительнойИнформации");
	
	Форма.Договор = Договор;
	НаборЗаписей = РегистрыСведений.ЮЦАУ_ДоговорыКонтрагентовДопИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Договор);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		
		Запись = НаборЗаписей[0];
		Форма.ЭлементыФормы.ПредметДоговора.Значение       = Запись.ПредметДоговора;
		Форма.ЭлементыФормы.ЦенаДоговора.Значение          = Запись.ЦенаДоговора;
		Форма.ЭлементыФормы.ПорядокРасчётов.Значение       = Запись.ПорядокРасчётов;
		Форма.ЭлементыФормы.ОтветственностьСторон.Значение = Запись.ОтветственностьСторон;
		Форма.ЭлементыФормы.СрокДействия.Значение          = Запись.СрокДействия;
		Форма.ЭлементыФормы.СсылкаНаСкан.Значение          = Запись.СсылкаНаСкан;
		
		Форма.ЭлементыФормы.ДатаРегистрации.Значение       = Запись.ДатаРегистрации;
		Форма.ЭлементыФормы.СрокИсполненияОрг.Значение     = Запись.СрокИсполненияОбязательствОрганизацией;
		Форма.ЭлементыФормы.СрокИсполненияКонтр.Значение   = Запись.СрокИсполненияОбязательствКонтрагентом;
		Форма.ЭлементыФормы.ОтметкиОбИсполнении.Значение   = Запись.ОтметкиОбИсполненииОбязательств;
		Форма.ЭлементыФормы.ПринятыеМеры.Значение          = Запись.ПринятыеМеры;
		
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

Функция ОпределитьДеньНедели(НомерДняНедели) Экспорт
	
	Если НомерДняНедели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняНедели = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДняНедели = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДняНедели = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДняНедели = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДняНедели = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";
	КонецЕсли;
	
КонецФункции

Процедура ПодпискаНаСобытиеСправочникПередЗаписью(Источник, Отказ) Экспорт
	
	тПользователь = Пользователи.ТекущийПользователь();
	Если НЕ РольДоступна("ЗапретРедактированиеПодразделений_ЮЦАУ") Тогда
		//Отказ = Истина;
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияОрганизаций") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Профиль = &Профиль
		|	И ГруппыДоступа.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		Запрос.УстановитьПараметр("Профиль", ПолучитьЗначениеПоИдентификатору("РедактированиеПодразделений"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаРолиЗапретКопированияПЛ () Экспорт
	Возврат РольДоступна("ЮЦАУ_ЗапретКопированияПЛ");
КонецФункции

Процедура ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если Источник.СчетКасса	= ПланыСчетов.Хозрасчетный.КассаПлатежногоАгента Тогда
		Префикс = "ОК";
	ИначеЕсли Источник.СчетКасса	= ПланыСчетов.Хозрасчетный.ПассажирскиеПеревозки Тогда
		Префикс = "ПП-";
	Иначе
		Префикс = "0";
	КонецЕсли;

КонецПроцедуры

Процедура РаспределитьСуммуАмортизацииОСПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам)
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.Субконто3); //Отбор по транспортному средству
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, просто копируем строку
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
	
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
	
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		//Подготовка к распределению сумм проводки по массиву коэффициентов
		СтруктураДляРаспределения 		= Новый Структура("СуммаБУ,СуммаВР,СуммаМЦВР,СуммаМЦПР,СуммаНУ,СуммаПР", 0,0,0,0,0,0);
		СтруктураТочностьРаспределения 	= Новый Структура("СуммаБУ,СуммаВР,СуммаМЦВР,СуммаМЦПР,СуммаНУ,СуммаПР", 2,2,2,2,2,2);
		ЗаполнитьЗначенияСвойств(СтруктураДляРаспределения, ТекСтрока);
			
		ТаблицаРаспределенныеСуммы = РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(СтруктураДляРаспределения, СтруктураТочностьРаспределения, МассивКоэффициентов);  
		
		//Добавление новых строк в ТаблицаРаспределения     
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТаблицаРаспределенныеСуммы[й]);

			НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			
		КонецЦикла; 

	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьАмортизацию(ТаблицаРаспределенияАмортизации, Параметры) Экспорт
	
    Реквизиты = Параметры[0];
	
	//Получение таблицы оборотов по сотрудникам в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);

	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаРаспределенияАмортизации.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.02
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаРаспределенияАмортизации Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.СчетЗатрат = Счет_25_03 И ЗначениеЗаполнено(ТекСтрока.Субконто3) Тогда 	//Распределяем на номенклатурные группы по Транспортному средству		
			РаспределитьСуммуАмортизацииОСПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам); 	
		Иначе 
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаРаспределенияАмортизации = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

Процедура РаспределитьСуммуТранспортногоНалогаПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам)
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.Субконто3); //Отбор по транспортному средству
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, просто копируем строку
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
	
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
		
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТекСтрока.Сумма, МассивКоэффициентов);

		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			
			НоваяСтрока.Сумма = МассивРаспределенныхСумм[й];

		КонецЦикла; 

	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьТранспортныйНалог(ТаблицаПроводок, Реквизиты) Экспорт
	
 	//Получение таблицы оборотов по сотрудникам в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);

	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаПроводок.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.02
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаПроводок Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.СчетДт = Счет_25_03 И ЗначениеЗаполнено(ТекСтрока.Субконто3) Тогда 	//Распределяем на номенклатурные группы по Транспортному средству		
			РаспределитьСуммуТранспортногоНалогаПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам); 	
		Иначе 
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаПроводок = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

Процедура РаспределитьСуммуПоступленияУслугПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам)
	
	СтруктураПоиска = Новый Структура("ТранспортноеСредство", ТекСтрока.Субконто3); //Отбор по транспортному средству
	МассивОборотыПоТСиНоменклатурнымГруппам = тзОборотыПоТСиНоменклатурнымГруппам.НайтиСтроки(СтруктураПоиска);
	
	Если МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 0 Тогда //Распределять не на что, просто копируем строку
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() = 1 Тогда //Одна строка, просто заполняем реквизиты
	
		НоваяСтрока = ТаблицаРаспределения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[0].НоменклатурнаяГруппа;
	
	ИначеЕсли МассивОборотыПоТСиНоменклатурнымГруппам.Количество() > 1 Тогда //Работает распределение
	
		//Получение массива с коэффициентами для распределения суммы
		МассивКоэффициентов = Новый Массив;
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 
			МассивКоэффициентов.Добавить(МассивОборотыПоТСиНоменклатурнымГруппам[й].РабочееВремя);
		КонецЦикла; 
		
		//Подготовка к распределению сумм проводки по массиву коэффициентов
		СтруктураДляРаспределения 		= Новый Структура("Количество,СуммаТовара,СуммаБУ,СуммаБезНДСРуб,СуммаВзаиморасчетов,СуммаНДСВзаиморасчетов,СуммаНДСПодтвержденнаяРуб,СуммаНДСРуб,СуммаНУ,СуммаПодтвержденнаяРуб,СуммаРуб", 0,0,0,0,0,0,0,0,0,0,0);
		СтруктураТочностьРаспределения 	= Новый Структура("Количество,СуммаТовара,СуммаБУ,СуммаБезНДСРуб,СуммаВзаиморасчетов,СуммаНДСВзаиморасчетов,СуммаНДСПодтвержденнаяРуб,СуммаНДСРуб,СуммаНУ,СуммаПодтвержденнаяРуб,СуммаРуб", 3,2,2,2,2,2,2,2,2,2,2);
		ЗаполнитьЗначенияСвойств(СтруктураДляРаспределения, ТекСтрока);
			
		ТаблицаРаспределенныеСуммы = РаспределитьСуммуПоКолонкамТаблицыПропорциональноКоэффициентам(СтруктураДляРаспределения, СтруктураТочностьРаспределения, МассивКоэффициентов);  
		
		//Добавление новых строк в ТаблицаРаспределения     
		Для й=0 По МассивОборотыПоТСиНоменклатурнымГруппам.ВГраница() Цикл 

			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТаблицаРаспределенныеСуммы[й]);

			НоваяСтрока.Субконто2 = МассивОборотыПоТСиНоменклатурнымГруппам[й].НоменклатурнаяГруппа;
			
		КонецЦикла; 

	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьПоступлениеУслуг(ТаблицаРаспределенияУслуг, Параметры) Экспорт
	
    Реквизиты = Параметры[0];
	
	//Проверка по виду документа
	Если ТипЗнч(Реквизиты.Регистратор) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТаблицаРаспределенияУслуг = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Получение таблицы оборотов в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);

	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ТаблицаРаспределенияУслуг.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.02
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ТаблицаРаспределенияУслуг Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.СчетЗатрат = Счет_25_03 И ЗначениеЗаполнено(ТекСтрока.Субконто3) Тогда 	//Распределяем на номенклатурные группы по Транспортному средству		
			РаспределитьСуммуПоступленияУслугПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам); 	
		Иначе 
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ТаблицаРаспределенияУслуг = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

Процедура РаспределитьПоступлениеДопРасходов(ВремДопРасходыТаблица, Параметры) Экспорт
	
    Реквизиты = Параметры[0];
	
	//Проверка по виду документа
	Если ТипЗнч(Реквизиты.Регистратор) <> Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
		Возврат;
	КонецЕсли;	
	
	Если ВремДопРасходыТаблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Получение таблицы оборотов в разрезе ТС, ТиповТС и Номенклатурных групп   
	тзОборотыПоТСиНоменклатурнымГруппам = ПолучитьОборотыПоТСиНоменклатурнымГруппам(Реквизиты.Организация, Реквизиты.Период);

	//Пустая таблица для распределения строк
	ТаблицаРаспределения = ВремДопРасходыТаблица.СкопироватьКолонки(); 
	
	//Обработка строк со счетом 25.02
	Счет_25_03 = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов;
	
	//Цикл по исходной таблице для получения таблицы с распределением
	Для Каждого ТекСтрока Из ВремДопРасходыТаблица Цикл
		
		//Распределяются только строки счета затрат 25.03
		Если ТекСтрока.СчетЗатрат = Счет_25_03 И ЗначениеЗаполнено(ТекСтрока.Субконто3) Тогда 	//Распределяем на номенклатурные группы по Транспортному средству		
			РаспределитьСуммуПоступленияУслугПоТСиНоменклатурнымГруппам(ТекСтрока, ТаблицаРаспределения, тзОборотыПоТСиНоменклатурнымГруппам); 	
		Иначе 
			НоваяСтрока = ТаблицаРаспределения.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;	
			
	КонецЦикла;	
	
	//Подмена исходной таблицы на таблицу с распределенными суммами
	ВремДопРасходыТаблица = ТаблицаРаспределения.Скопировать();	
	
КонецПроцедуры	

Функция ПолучитьДокументЗакрытияСчетовЗатрат(ДатаПериода, Организация, ПодразделениеОрганизации=Неопределено, СчетЗатрат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ЗакрытиеСчетовЗатрат.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЮЦАУ_ЗакрытиеСчетовЗатрат КАК ЮЦАУ_ЗакрытиеСчетовЗатрат
		|ГДЕ
		|	ЮЦАУ_ЗакрытиеСчетовЗатрат.Организация = &Организация
		|	И ЮЦАУ_ЗакрытиеСчетовЗатрат.Счет = &СчетЗатрат
		|	И НАЧАЛОПЕРИОДА(ЮЦАУ_ЗакрытиеСчетовЗатрат.Дата, ДЕНЬ) = &ДатаПериода
		|	И ЮЦАУ_ЗакрытиеСчетовЗатрат.ПометкаУдаления = ЛОЖЬ
		|	И ЮЦАУ_ЗакрытиеСчетовЗатрат.ПодразделениеОрганизации = &ПодразделениеОрганизации";
	
	Запрос.УстановитьПараметр("ДатаПериода", НачалоДня(ДатаПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетЗатрат", СчетЗатрат);

	Если ПодразделениеОрганизации=Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЮЦАУ_ЗакрытиеСчетовЗатрат.ПодразделениеОрганизации = &ПодразделениеОрганизации", "");		
	Иначе	
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	ДокОбъект = Документы.ЮЦАУ_ЗакрытиеСчетовЗатрат.СоздатьДокумент();
	ДокОбъект.Дата = КонецДня(ДатаПериода);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.Организация = Организация;  
	ДокОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
	ДокОбъект.Счет = СчетЗатрат;
	
	Возврат ДокОбъект;
	
КонецФункции	

Процедура ПеренестиОборотыСчета25_03наСчет20_01(ДатаПериода, Организация, ПодразделениеОрганизации, СчетЗатрат) Экспорт
	
	ДокументОбъект = ПолучитьДокументЗакрытияСчетовЗатрат(ДатаПериода, Организация, ПодразделениеОрганизации, СчетЗатрат);   
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	

Процедура ОграничитьРаспределениеНаДругиеПодразделения(Процессор) Экспорт // для обхода проверки конфигурации
	
	// Пример модификации правила, позволяющего ограничить распределение косвенных затрат на другие подразделения.
	
	// В типовом решении косвенные затраты распределяются по указанной базе
	// - прежде всего в рамках одного подразделения
	// - если это невозможно - в рамках всех подразделений, для которых расчитана эта база.
	//
	// Например, если база распределения - "объем выпуска" и выпуск есть в подразделениях "Цех 1" и "Цех 2",
	// то затраты Цеха 1 будут распределены только на выпуск Цеха 1, а затраты Лаборатории - на оба цеха.
	//
	// На предприятиях, результаты работы которого оплачиваются заказчиком в виде компенсации затрат,
	// могут быть ограничения такого распределения:
	// - с одной стороны, следует использовать единую базу распределения для всех затрат
	// - с другой, некоторые затраты нельзя включать в себестоимость результата деятельности, оплачиваемого заказчиком.
	//
	// В описанном выше примере может появиться подразделение "Цех специальных изделий", в себестоимость продукции которого
	// не следует включать затраты лаборатории.
	//
	// Для настройки такого ограничения используем иерархию и последовательность подразделений в списке:
	// Косвенные затраты подразделений не могут быть распределены на первое в списке.
	//
	// Например, список подразделений может выглядеть так:
	// - Цех специальных изделий
	// - Цех 1
	// - Цех 2
	// - Лаборатория
	// Косвенные затраты Лаборатории распределяются на Цех 1 и Цех 2
	//
	// Такой способ настройки приведен в демонстрационных целях.
	// На проектах рекомендуется с помощью расширения добавлять в прикладное решение объекты метаданных,
	// описывающие специфику взаимосвязей подразделений, видов деятельности, видов выпуска конкретного предприятия.
	
	Если Процессор.Закрытие.Роль <> Перечисления.РолиСчетовЗатрат.КосвенныеЗатраты Тогда
		Возврат;
	КонецЕсли;
	
	ПравилаДляМодификации = Новый Массив;
	Для Каждого Правило Из Процессор.Правила Цикл
		
		Если Правило.Действие <> "РаспределитьНаСубконто" И Не Правило.ПоляПриемника.Свойство("Подразделение") Тогда
			// Распределение между подразделениями не может быть выполнено таким правилом
			Продолжить;
		КонецЕсли;
		
		Если Правило.ПоляИсточника.Свойство("Подразделение") Тогда
			// Распределение уже ограничено одним или несколькими подразделениями
			Продолжить;
		КонецЕсли;
		
		//ЮЦАУ
		Если Правило.ОтборРасходов.Счет <> ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходыОсновноеПроизводство Тогда //Обрабатывается только счет 25.01.1
			Продолжить;
		КонецЕсли;
		//ЮЦАУ
		
		ПравилаДляМодификации.Добавить(Правило);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПравилаДляМодификации) Тогда
		Возврат;
	КонецЕсли;
	
	// Определим запрещенное подразделение.
	// На проектах может оказаться уместным читать такие настройки заранее и помещать в коллекцию Настройки
	
	//ЮЦАУ
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Организация", Процессор.Настройки.Контекст.Организация);
	//Запрос.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Подразделения.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.ПодразделенияОрганизаций КАК Подразделения
	//|ГДЕ
	//|	Подразделения.Владелец = &Организация
	//|	И Подразделения.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Подразделения.РеквизитДопУпорядочивания,
	//|	Подразделения.Ссылка";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Не Выборка.Следующий() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ЗапрещенноеПодразделение = Выборка.Ссылка;
	//ЮЦАУ
	
	//ЮЦАУ
	Организация = Процессор.Настройки.Контекст.Организация;
	ПериодДействия = Процессор.Настройки.Контекст.ПериодДействия;
	ЗапрещенноеПодразделение = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки",Организация,ПериодДействия);
	//ЮЦАУ
	
	// Модифицируем запросы базы распределения, добавив условие, ограничивающее данные базы.
	// На проектах связи могут быть сложнее:
	// одни "косвенные" подразделения могут быть ограничены в распределении одним набором подразделений или наименований продукции,
	// а другие - другим.
	// В этом случае следует использовать ПоляИсточника правила, дополняя текст запроса соединением с таблицей таких связей.
	
	Для Каждого Правило Из ПравилаДляМодификации Цикл
		
		ЗапросБазыРаспределения = СхемыЗапросов.НайтиЗапросСозданияТаблицы(
			Правило.БазаРаспределения.ТекстЗапроса,
			Правило.БазаРаспределения.Имя);
			
		КолонкаПодразделение = ЗапросБазыРаспределения.Запрос.Колонки.Найти("Подразделение");
			
		Для Каждого Оператор Из ЗапросБазыРаспределения.Запрос.Операторы Цикл
			ИндексОператора = ЗапросБазыРаспределения.Запрос.Операторы.Индекс(Оператор);
			ВыражениеПодразделение = КолонкаПодразделение.Поля[ИндексОператора];
			Оператор.Отбор.Добавить(СтрШаблон("%1 <> &ЗапрещенноеПодразделение", ВыражениеПодразделение));
		КонецЦикла;
			
		Правило.БазаРаспределения.ПараметрыЗапроса.Вставить("ЗапрещенноеПодразделение", ЗапрещенноеПодразделение);
		
		// Изменение текста или параметров запроса требует изменить имя временной таблицы - так, чтобы не оказалось,
		// что различные правила предусматривают создание разных таблиц с одинаковым именем.
		ЗапросБазыРаспределения.Запрос.ТаблицаДляПомещения = "";
		Правило.БазаРаспределения.Имя                      = "";
		ПравилаРаспределенияРасходов.НастроитьТекстБазыРаспределения(Правило, ЗапросБазыРаспределения);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуБазыРаспределенияСчета25_02(Организация, Подразделение, ПериодДействия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство) КАК Счет,
		|	ЮЦАУ_НастройкиЗакрытияСчета25_02.Коэффициент КАК Коэффициент,
		|	ЮЦАУ_НастройкиЗакрытияСчета25_02.ПодразделениеДт20 КАК Подразделение,
		|	ЮЦАУ_НастройкиЗакрытияСчета25_02.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	РегистрСведений.ЮЦАУ_НастройкиЗакрытияСчета25_02 КАК ЮЦАУ_НастройкиЗакрытияСчета25_02
		|ГДЕ
		|	ЮЦАУ_НастройкиЗакрытияСчета25_02.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(ЮЦАУ_НастройкиЗакрытияСчета25_02.ПериодДействия, МЕСЯЦ) = &ПериодДействия
		|	И ЮЦАУ_НастройкиЗакрытияСчета25_02.ПодразделениеКт25 = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	Подразделение,
		|	НоменклатурнаяГруппа
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПериодДействия", НачалоМесяца(ПериодДействия));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции	

Функция ПолучитьПараметрыПодключения_УАТ(Организация) Экспорт

	СтруктураПараметров = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_НастройкиОбменаУАТ.АдресСервера КАК АдресСервера,
		|	ЮЦАУ_НастройкиОбменаУАТ.Порт КАК Порт,
		|	ЮЦАУ_НастройкиОбменаУАТ.Пользователь КАК Пользователь,
		|	ЮЦАУ_НастройкиОбменаУАТ.Пароль КАК Пароль
		|ИЗ
		|	РегистрСведений.ЮЦАУ_НастройкиОбменаУАТ КАК ЮЦАУ_НастройкиОбменаУАТ
		|ГДЕ
		|	ЮЦАУ_НастройкиОбменаУАТ.Организация = &Организация
		|	И ЮЦАУ_НастройкиОбменаУАТ.ИспользоватьОбмен = Истина";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		СтруктураПараметров = Новый Структура("Порт,АдресСервера,Пользователь,Пароль",0,"","","","");
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи); 
		
	КонецЦикла;
	
	Возврат СтруктураПараметров;

КонецФункции	

// Выводит сообщение об ошибке заполнения поля.
//
Процедура СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, ИмяТабличнойЧасти = Неопределено, НомерСтроки = Неопределено, 
		Поле = Неопределено, Отказ = Ложь) Экспорт
		
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;

	Если ИмяТабличнойЧасти <> Неопределено Тогда
		Сообщение.Поле = ИмяТабличнойЧасти + "[" + (НомерСтроки - 1) + "]." + Поле;
	ИначеЕсли ЗначениеЗаполнено(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;

	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();

	Отказ = Истина;
	
КонецПроцедуры // СообщитьОбОшибке()

// Проверяет правильность заполнения строк табличной части документа.
// Если какой-то из реквизитов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
//
// Параметры:
//  ДокументОбъект             - объект проводимого документа, 
//  ИмяТабличнойЧасти          - табличная часть документа,
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура уатПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, 
	Отказ, Заголовок) Экспорт
	
	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	ТабличнаяЧасть = ДокументОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	// Цикл по строкам табличной части.
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		""" табличной части """ + ПредставлениеТабличнойЧасти + """: ";
		
		// Цикл по проверяемым полям
		Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
			
			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если НЕ ЗначениеЗаполнено(Значение) Тогда
				
				Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;
				ЮЦАУ.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧасти()

