
&Вместо("ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел2")
Процедура Расш1_ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел2(Алгоритмы, ПараметрыЗаполнения)
	
	УчетНа70ВедетсяСводно = ПараметрыЗаполнения.УчетНа70ВедетсяСводно;
	
	#Область Строка1210
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1210",
		"Запасы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 15"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 14"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 43"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 41"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 42"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 44"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 45"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 28"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 20"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 23.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 29"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.Запасы;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.Запасы;
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Строка1215
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1215",
		"Долгосрочные активы к продаже");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 01.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 03.09"));
	
	#КонецОбласти
	
	#Область Строка1220
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1220",
		"Налог на добавленную стоимость по приобретенным ценностям");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 19"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 19.06"));
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1220",
		"НДС, начисленный по отгрузке");
	АлгоритмСтроки.Вписываемый = Истина;
	АлгоритмСтроки.ГрафаНаименования = "02";
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.ОТ"));
	
	#КонецОбласти
	
	#Область Строка1230
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1230",
		"Дебиторская задолженность");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.31"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 62.Р"));
	
	// Пустая ссылка используется для извлечения результатов разделения данных из соответствия.
	ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПустаяСсылка();
	Если ПараметрыЗаполнения.РазделятьАвансыПоВидамАктивов Тогда
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.02", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.02", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.22", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.22", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_АвансыДебЗад 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 63, 60.32", ВидАктиваАвансы));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_АвансыДебЗад 76.ВА, 60.32", ВидАктиваАвансы));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 63"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_СВычетами 76.ВА"));
		
	Иначе
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.02"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.22"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 60.32"));
		
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 63"));
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 76.ВА"));
		
	КонецЕсли;
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.04.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.04.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.07"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.08"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.11"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.12"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.13"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.14"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.15"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.17"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.34"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 68.52"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.90"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.3"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.4"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.5"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.6"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.02.7"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.03.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.03.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.05.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.3"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.4"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.5"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.06.6"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.11"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_ВидыПлатежей 69.12"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР 69.13"));
	
	Если УчетНа70ВедетсяСводно Тогда
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 70"));
	Иначе
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 70"));
	КонецЕсли;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 71.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 73.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 73.03"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 75.01"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.01.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.05"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.08"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Работники 76.10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.13"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.14"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.17"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.18"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.22"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.25"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.26"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.29"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.35"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.36"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.39"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_Контрагенты 76.49"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКДР_КонтрагентыДоговоры 76.К"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 76.НА"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК 76.НА"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ДебиторскаяЗадолженность;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 46"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде НДСсПлатежей"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Авансы"));
	
	#КонецОбласти
	
	#Область Строка1240
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1240",
		"Финансовые вложения (за исключением денежных эквивалентов)");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.23"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 58.05"));
	
	#КонецОбласти
	
	#Область Строка1250
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1250",
		"Денежные средства и денежные эквиваленты");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 50"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 51"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 52"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 53"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 55.24"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 57"));
	
	#КонецОбласти
	
	#Область Строка1260
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1260",
		"Прочие оборотные активы");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 19.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД 68.22"));
	
	ВидАктиваРБП = Перечисления.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 97", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.2", ВидАктиваРБП));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 76.01.9", ВидАктиваРБП));
	
	ВидАктиваАвансы = Перечисления.ВидыАктивовДляАвансов.ПрочиеОборотные;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.02", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.02", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.02", ВидАктиваАвансы));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.22", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.22", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.22", ВидАктиваАвансы));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКД_ПоВидуАктива 60.32", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 63, 60.32", ВидАктиваАвансы));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКК_ПоВидуАктива 76.ВА, 60.32", ВидАктиваАвансы));
	
	#КонецОбласти
	
КонецПроцедуры

&Вместо("ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел5")
Процедура Расш1_ЗаполнитьАлгоритмыБО2025Кв1_Баланс_Раздел5(Алгоритмы, ПараметрыЗаполнения)
	
	УчетНа70ВедетсяСводно = ПараметрыЗаполнения.УчетНа70ВедетсяСводно;
	
	#Область Строка1510
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1510",
		"Заемные средства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 66"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.22"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.24"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 67.26"));
	
	#КонецОбласти
	
	#Область Строка1520
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1520",
		"Кредиторская задолженность");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 60.31"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.08"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.28"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.38"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.22"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.32"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 62.ОТ"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.АВ"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.02"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.04.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.04.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.07"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.08"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.11"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.12"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.13"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.14"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.15"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.17"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.32"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.34"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.42"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 68.52"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 68.90"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.3"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.4"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.5"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.6"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.02.7"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.03.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.03.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.05.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.2"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.3"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.4"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.5"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.06.6"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.11"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_ВидыПлатежей 69.12"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР 69.13"));
	
	Если УчетНа70ВедетсяСводно Тогда
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 70"));
	Иначе
		АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 70"));
	КонецЕсли;
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.01"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 71.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 73.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 73.04")); //ЮЦАУ
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 75.02"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.01.1"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.03"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.04"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.05"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.06"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.09"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Работники 76.10"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.15"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.16"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.17"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.21"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.25"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.26"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.29"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.35"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.36"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.39"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.41"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.41"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_Контрагенты 76.49"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СККР_КонтрагентыДоговоры 76.К"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.Н"));
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 98.01"));
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1520",
		"Обязательство по аренде");
	АлгоритмСтроки.Вписываемый = Истина;
	АлгоритмСтроки.ГрафаНаименования = "02";
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.07", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.27", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 76.37", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.07", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.27", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СКД 76.37", "НастройкиОтчетаКонтрагентыДоговоры"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде НДСсПлатежей"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СК_РасчетыПоАренде Авансы"));
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("- СК_РасчетыПоАренде Долгосрочное"));
	
	#КонецОбласти
	
	#Область Строка1540
	
	АлгоритмСтроки = ЗаполнениеБухгалтерскойОтчетностиОсновная.ДобавитьНовыйАлгоритмСтроки(Алгоритмы, "1540",
		"Оценочные обязательства");
	
	АлгоритмСтроки.Составляющие.Добавить(Составляющая("+ СКК 96.01"));
	
	#КонецОбласти
	
КонецПроцедуры
