
&Вместо("Отбор")
Функция Расш1_Отбор(Параметры)
	
	ОтборЛисты = Новый Структура;
	ОтборЛисты.Вставить("Организация",    Параметры.Организация);
	ОтборЛисты.Вставить("ПлатежныйАгент", Параметры.ПлатежныйАгент);
	ОтборЛисты.Вставить("ПассажирскиеПеревозки", Параметры.ПассажирскиеПеревозки);
	Если БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям() Тогда
		ОтборЛисты.Вставить("ПодразделениеОрганизации", Параметры.ПодразделениеОрганизации);
	Иначе
		ОтборЛисты.Вставить("ПодразделениеОрганизации", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	КонецЕсли;
	
	Возврат ОтборЛисты;
	
	
КонецФункции

&Вместо("ПолучитьНомерЛистаНачало")
Функция Расш1_ПолучитьНомерЛистаНачало(Знач ПараметрыОтчета)
	
	НомерЛистаНачало = 1;
	Если ПараметрыОтчета.НачалоПериода > НачалоГода(ПараметрыОтчета.НачалоПериода) Тогда
		Запрос = Новый Запрос;
		ТекстЗапросаНомерЛиста =
		"ВЫБРАТЬ
		|	1 КАК НомерЛиста,
		|	&ПредыдущийПериод КАК КлючСвязи
		|ПОМЕСТИТЬ ВТ_НомерЛистаНезадан
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомераЛистовКассовойКнигиСрезПоследних.НомерЛиста КАК НомерЛиста,
		|	&ПредыдущийПериод КАК КлючСвязи
		|ПОМЕСТИТЬ ВТ_НомерЛистаДоЭтойДаты
		|ИЗ
		|	РегистрСведений.НомераЛистовКассовойКниги.СрезПоследних(
		|			&ПредыдущийПериод,
		|			Организация = &Организация
		|				И ПодразделениеОрганизации = &Подразделение
		|				И ПлатежныйАгент = &ПлатежныйАгент
		|				И ПассажирскиеПеревозки = &ПассажирскиеПеревозки) КАК НомераЛистовКассовойКнигиСрезПоследних
		|ГДЕ
		|	НомераЛистовКассовойКнигиСрезПоследних.Период >= &НачалоГода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_НомерЛистаДоЭтойДаты.НомерЛиста, 0) > 0
		|			ТОГДА ВТ_НомерЛистаДоЭтойДаты.НомерЛиста + 1
		|		ИНАЧЕ ВТ_НомерЛистаНезадан.НомерЛиста
		|	КОНЕЦ КАК НомерЛиста
		|ИЗ
		|	ВТ_НомерЛистаНезадан КАК ВТ_НомерЛистаНезадан
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомерЛистаДоЭтойДаты КАК ВТ_НомерЛистаДоЭтойДаты
		|		ПО ВТ_НомерЛистаНезадан.КлючСвязи = ВТ_НомерЛистаДоЭтойДаты.КлючСвязи";
		
		Запрос.УстановитьПараметр("Организация",       ПараметрыОтчета.Организация);
		Запрос.УстановитьПараметр("НачалоГода",        НачалоГода(ПараметрыОтчета.НачалоПериода));
		Запрос.УстановитьПараметр("ПредыдущийПериод",  ПараметрыОтчета.НачалоПериода - 86400);
		Запрос.УстановитьПараметр("ПлатежныйАгент",    ПараметрыОтчета.ПлатежныйАгент);
		Запрос.УстановитьПараметр("ПассажирскиеПеревозки",    ПараметрыОтчета.ПассажирскиеПеревозки); //ЮЦАУ
		Если БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям() Тогда
			Запрос.УстановитьПараметр("Подразделение", ПараметрыОтчета.ПодразделениеОрганизации);
		Иначе
			ТекстЗапросаНомерЛиста = СтрЗаменить(ТекстЗапросаНомерЛиста,
			"И НомераЛистовКассовойКниги.ПодразделениеОрганизации = &Подразделение", "");
			ТекстЗапросаНомерЛиста = СтрЗаменить(ТекстЗапросаНомерЛиста,
			"И ПодразделениеОрганизации = &Подразделение", "");
		КонецЕсли;
		
		Запрос.Текст     = ТекстЗапросаНомерЛиста;
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НомерЛистаНачало = Выборка.НомерЛиста;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НомерЛистаНачало;
	
КонецФункции

&Вместо("ПолучитьНомераЛистовЗаВесьПериод")
Функция Расш1_ПолучитьНомераЛистовЗаВесьПериод(ДатаПоследнегоЛиста, Знач ПараметрыОтчета, Знач СписокПодразделений)
	
	ЗапросЛисты = Новый Запрос;
	ТекстЗапросаЛисты =
	"ВЫБРАТЬ
	|	НомераЛистовКассовойКниги.Период КАК ДатаЛиста,
	|	НомераЛистовКассовойКниги.НомерЛиста КАК НомерЛиста
	|ИЗ
	|	РегистрСведений.НомераЛистовКассовойКниги КАК НомераЛистовКассовойКниги
	|ГДЕ
	|	НомераЛистовКассовойКниги.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НомераЛистовКассовойКниги.Организация = &Организация
	|	И НомераЛистовКассовойКниги.ПодразделениеОрганизации В(&СписокПодразделений)
	|	И НомераЛистовКассовойКниги.ПлатежныйАгент = &ПлатежныйАгент
	|	И НомераЛистовКассовойКниги.ПассажирскиеПеревозки = &ПассажирскиеПеревозки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЛиста";
	
	ЗапросЛисты.УстановитьПараметр("Организация",    ПараметрыОтчета.Организация);
	ЗапросЛисты.УстановитьПараметр("НачалоПериода",  НачалоГода(ПараметрыОтчета.НачалоПериода));
	ЗапросЛисты.УстановитьПараметр("КонецПериода",   КонецГода(ПараметрыОтчета.КонецПериода));
	ЗапросЛисты.УстановитьПараметр("ПлатежныйАгент", ПараметрыОтчета.ПлатежныйАгент);
	ЗапросЛисты.УстановитьПараметр("ПассажирскиеПеревозки", ПараметрыОтчета.ПассажирскиеПеревозки);
	
	Если СписокПодразделений <> Неопределено Тогда
		ЗапросЛисты.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	Иначе
		ТекстЗапросаЛисты = СтрЗаменить(ТекстЗапросаЛисты,
			"И НомераЛистовКассовойКниги.ПодразделениеОрганизации В(&СписокПодразделений)", "");
	КонецЕсли;
	
	ЗапросЛисты.Текст     = ТекстЗапросаЛисты;
	РезультатЗапросаЛисты = ЗапросЛисты.Выполнить();
	
	СоответствиеЛистыПред = Новый Соответствие;
	ВыборкаЛисты = РезультатЗапросаЛисты.Выбрать();
	Пока ВыборкаЛисты.Следующий() Цикл
		СоответствиеЛистыПред.Вставить(ВыборкаЛисты.ДатаЛиста, ВыборкаЛисты.НомерЛиста);
		ДатаПоследнегоЛиста = ВыборкаЛисты.ДатаЛиста;
	КонецЦикла;
	
	Возврат СоответствиеЛистыПред;
	
КонецФункции
