// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьПараметрыФормы();
	ЗапуститьДлительнуюОперациюПолученияИдентификаторов();
	ОбновитьОтображениеФормыПриСозданииНаСервере();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьОжиданиеПолученияИдентификаторовЭПД();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторОрганизацииАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторОрганизацииСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКонтрагентаАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторКонтрагентаСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеревозчикаАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторПеревозчикаСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОрганизацияУказатьВручную(Команда)
	ОжидаетсяПолучениеИдентификатораОрганизации = Ложь;
	ВыполнитьКонтрольДлительнойОперации();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентУказатьВручную(Команда)
	ОжидаетсяПолучениеИдентификатораКонтрагента = Ложь;
	ВыполнитьКонтрольДлительнойОперации();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикУказатьВручную(Команда)
	ОжидаетсяПолучениеИдентификатораПеревозчика = Ложь;
	ВыполнитьКонтрольДлительнойОперации();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиОбмена

// Параметры:
//  НастройкиОбмена - См. НастройкиОтправкиЭДО.НастройкиОтправки
// 
// Возвращаемое значение:
//  Булево
&НаСервереБезКонтекста
Функция УстановленыИдентификаторыНастроекОбмена(Знач НастройкиОбмена)
	
	Если НастройкиОбмена = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Не ПустаяСтрока(НастройкиОбмена.ИдентификаторОтправителя)
		И Не ПустаяСтрока(НастройкиОбмена.ИдентификаторПолучателя);
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиОбмена()
	
	ИдентификаторыОрганизации = Новый Массив; // Массив Из Строка
	
	НастройкиОбменаКонтрагент = СервисEDIСлужебный.НастройкиОбмена(Организация, Контрагент, ВидДокумента);
	НастройкиОбменаПеревозчик = СервисEDIСлужебный.НастройкиОбмена(Организация, Перевозчик, ВидДокумента);
	
	Если УстановленыИдентификаторыНастроекОбмена(НастройкиОбменаКонтрагент) Тогда
		
		ИдентификаторыОрганизации.Добавить(НастройкиОбменаКонтрагент.ИдентификаторОтправителя);
		ИдентификаторКонтрагента = НастройкиОбменаКонтрагент.ИдентификаторПолучателя;
		УстановленИдентификаторКонтрагента = Истина;
		
	КонецЕсли;
	
	Если УстановленыИдентификаторыНастроекОбмена(НастройкиОбменаПеревозчик) Тогда
		
		ИдентификаторыОрганизации.Добавить(НастройкиОбменаПеревозчик.ИдентификаторОтправителя);
		ИдентификаторПеревозчика = НастройкиОбменаПеревозчик.ИдентификаторПолучателя;
		УстановленИдентификаторПеревозчика = Истина;
		
	КонецЕсли;
	
	ИдентификаторыОрганизации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИдентификаторыОрганизации);
	
	Если ИдентификаторыОрганизации.Количество() = 1 Тогда
		ИдентификаторОрганизации = ИдентификаторыОрганизации[0];
		УстановленИдентификаторОрганизации = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыФормы

// Параметры:
//  Контекст          - Строка
//  ИмяПараметра      - Строка
//  ЗначениеПараметра - ЛюбаяСсылка
&НаСервере
Процедура ПроверитьЗаполненность(Знач Контекст, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ЗначениеПараметра),
		СтрШаблон(
			НСтр(
				"ru = 'Значение обязательного параметра формы %1 не заполнено'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяПараметра),
		Контекст);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПараметрыФормы()
	
	ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Организация" , Организация);
	ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Контрагент"  , Контрагент);
	ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Перевозчик"  , Перевозчик);
	
КонецПроцедуры

// Параметры:
//  ДанныеУчастников - См. СервисEDIСлужебный.НовыеДанныеУчастников
//  Участник         - ЛюбаяСсылка
//  Представление    - Строка
&НаСервере
Процедура ПрочитатьДанныеУчастника(
	Знач ДанныеУчастников, 
	Знач Участник,
	Представление)
	
	ДанныеУчастника = СервисEDIСлужебный.ДанныеУчастника(ДанныеУчастников, Участник);
	
	Представление = ДанныеУчастника.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеУчастников()
	
	ТаблицаУчастников = СервисEDIСлужебный.НоваяТаблицаУчастников();
	
	СервисEDIСлужебный.ДобавитьОрганизацию(ТаблицаУчастников, Организация);
	СервисEDIСлужебный.ДобавитьКонтрагента(ТаблицаУчастников, Контрагент);
	СервисEDIСлужебный.ДобавитьКонтрагента(ТаблицаУчастников, Перевозчик);
	
	ДанныеУчастников = СервисEDIСлужебный.ДанныеУчастников(ТаблицаУчастников);
	
	ПрочитатьДанныеУчастника(
		ДанныеУчастников,
		Организация,
		ОрганизацияПредставление);
	ПрочитатьДанныеУчастника(
		ДанныеУчастников,
		Контрагент,
		КонтрагентПредставление);
	ПрочитатьДанныеУчастника(
		ДанныеУчастников,
		Перевозчик,
		ПеревозчикПредставление);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыФормы()
	
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Организация  = Параметры.Организация;
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Контрагент   = Параметры.Контрагент;
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Перевозчик   = Параметры.Перевозчик;
	ВидДокумента = Параметры.ВидДокумента;
	
	ПроверитьПараметрыФормы();
	ПрочитатьНастройкиОбмена();
	ПрочитатьДанныеУчастников();
	
КонецПроцедуры

#КонецОбласти

#Область Отображение

// Параметры:
//  Форма     - ФормаКлиентскогоПриложения
//  Элемент   - ГруппаФормы
//  Видимость - Булево
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма, Знач Элемент, Знач Видимость)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		Элемент.Имя,
		"Видимость",
		Видимость);
КонецПроцедуры

// Параметры:
//  Форма                                                - ФормаКлиентскогоПриложения
//  ЭтоДлительнаяОперация                                - Булево
//  ЭлементФормыСтраницы                                 - ГруппаФормы
//  ЭлементФормыСтраницаИспользоватьДлительнуюОперацию   - ГруппаФормы
//  ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию - ГруппаФормы
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницуДлительнойОперации(
	Форма,
	Знач ЭтоДлительнаяОперация,
	Знач ЭлементФормыСтраницы,
	Знач ЭлементФормыСтраницаИспользоватьДлительнуюОперацию,
	Знач ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию)
	
	ТекущаяСтраница = 
		?(ЭтоДлительнаяОперация,
			ЭлементФормыСтраницаИспользоватьДлительнуюОперацию,
			ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		ЭлементФормыСтраницы.Имя,
		"ТекущаяСтраница",
		ТекущаяСтраница);
	
КонецПроцедуры

// Параметры:
//  Форма        - ФормаКлиентскогоПриложения
//  ЭлементФормы - ПолеФормы
//  СписокВыбора - СписокЗначений Из Строка
&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьКнопкуВыбора(Форма, ЭлементФормы, СписокВыбора)
	
	//@skip-check property-return-type - Особенность строгой типизации
	//@skip-check dynamic-access-method-not-found - Особенность строгой типизации
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		ЭлементФормы.Имя,
		"КнопкаВыпадающегоСписка",
		СписокВыбора.Количество() > 0);
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображениеФормы(Форма)
	
	// Скрываем данные по известным идентификаторам
	УстановитьВидимость(Форма, Форма.Элементы.Организация , Не Форма.УстановленИдентификаторОрганизации);
	УстановитьВидимость(Форма, Форма.Элементы.Контрагент  , Не Форма.УстановленИдентификаторКонтрагента);
	УстановитьВидимость(Форма, Форма.Элементы.Перевозчик  , Не Форма.УстановленИдентификаторПеревозчика);
	
	// Устанавливаем страницу ввода идентификатора / длительной операции 
	УстановитьСтраницуДлительнойОперации(
		Форма,
		Форма.ФоновоеЗаданиеЗапущено И Форма.ОжидаетсяПолучениеИдентификатораОрганизации,
		Форма.Элементы.ОрганизацияСтраницы,
		Форма.Элементы.ОрганизацияСтраницаДлительнаяОперация,
		Форма.Элементы.ОрганизацияСтраницаВводаИдентификатора);
	УстановитьСтраницуДлительнойОперации(
		Форма,
		Форма.ФоновоеЗаданиеЗапущено И Форма.ОжидаетсяПолучениеИдентификатораКонтрагента,
		Форма.Элементы.КонтрагентСтраницы,
		Форма.Элементы.КонтрагентСтраницаДлительнаяОперация,
		Форма.Элементы.КонтрагентСтраницаВводаИдентификатора);
	УстановитьСтраницуДлительнойОперации(
		Форма,
		Форма.ФоновоеЗаданиеЗапущено И Форма.ОжидаетсяПолучениеИдентификатораПеревозчика,
		Форма.Элементы.ПеревозчикСтраницы,
		Форма.Элементы.ПеревозчикСтраницаДлительнаяОперация,
		Форма.Элементы.ПеревозчикСтраницаВводаИдентификатора);
	
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторОрганизации, Форма.ИдентификаторОрганизацииСписокВыбора);
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторКонтрагента, Форма.ИдентификаторКонтрагентаСписокВыбора);
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторПеревозчика, Форма.ИдентификаторПеревозчикаСписокВыбора);
	
	// Видимость подсказки длительной операции
	УстановитьВидимость(Форма, Форма.Элементы.ИнформацияДлительнаяОперация, Форма.ФоновоеЗаданиеЗапущено);
	
КонецПроцедуры

// Параметры:
//  Элемент       - ГруппаФормы
//  Роль          - Строка
//  Представление - Строка
&НаСервере
Процедура УстановитьЗаголовокУчастника(Элемент, Знач Роль, Знач Представление)
	
	ТекстЗаголовка =
		СтрШаблон(
			НСтр(
				"ru = '%1 (%2)'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Роль,
			Представление);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элемент.Имя,
		"Заголовок",
		ТекстЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеФормыПриСозданииНаСервере()
	
	УстановитьЗаголовокУчастника(
		Элементы.Организация, 
		НСтр("ru = 'Грузоотправитель'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		ОрганизацияПредставление);
	УстановитьЗаголовокУчастника(
		Элементы.Контрагент, 
		НСтр("ru = 'Грузополучатель'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		КонтрагентПредставление);
	УстановитьЗаголовокУчастника(
		Элементы.Перевозчик, 
		НСтр("ru = 'Перевозчик'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		ПеревозчикПредставление);
	
КонецПроцедуры

#КонецОбласти

#Область ДлительнаяОперация

&НаСервере
Процедура ЗапуститьДлительнуюОперациюПолученияИдентификаторов()
	
	НаборУчастников = СервисEDIСлужебный.НовыеУчастникиЭТрН();
	НаборУчастников.Организация = Организация;
	НаборУчастников.Контрагент = Контрагент;
	НаборУчастников.Перевозчик = Перевозчик;
	
	Если Не УстановленИдентификаторОрганизации Тогда
		ОжидаетсяПолучениеИдентификатораОрганизации = Истина;
	КонецЕсли;
	
	Если Не УстановленИдентификаторКонтрагента Тогда
		ОжидаетсяПолучениеИдентификатораКонтрагента = Истина;
	КонецЕсли;
	
	Если Не УстановленИдентификаторПеревозчика Тогда
		ОжидаетсяПолучениеИдентификатораПеревозчика = Истина;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр(
			"ru = 'Получение идентификаторов ЭПД из сервиса 1С:EDI'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.УточнениеОшибки = 
		НСтр(
			"ru = 'Не удалось получить идентификаторы ЭПД из сервиса 1С:EDI по причине:'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"СервисEDIСлужебный.СвязьИдентификаторыУчастниковЭТрН",
		НаборУчастников);
	
	ФоновоеЗаданиеЗапущено = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОжиданиеПолученияИдентификаторовЭПД()
	
	Оповещение = Новый ОписаниеОповещения("ПриПолученииИдентификаторовЭПД", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	СервисEDIСлужебныйКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Оповещение,
		ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  СведенияОбУчастникеСвязи         - См. СервисEDIСлужебный.НовыеСведенияОбУчастникеСвязи
//  ОжидаетсяПолучениеИдентификатора - Булево
//  Участник                         - ЛюбаяСсылка
//  ИдентификаторУчастника           - Строка
//  СписокВыбора                     - СписокЗначений Из Строка
&НаСервере
Процедура ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
	Знач СведенияОбУчастникеСвязи,
	Знач ОжидаетсяПолучениеИдентификатора,
	Знач Участник,
	ИдентификаторУчастника,
	СписокВыбора)

	Если Не ОжидаетсяПолучениеИдентификатора Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаетсяПолучениеИдентификатора = Ложь;
	
	ИдентификаторУчастника = СведенияОбУчастникеСвязи.Идентификатор;
	
	СписокВыбора.Очистить();
	
	Если СведенияОбУчастникеСвязи.Идентификаторы.Количество() > 0 Тогда
		//@skip-check property-return-type - Свойства расширения элемента формы
		СписокВыбора.Очистить();; // СписокЗначений Из Строка
		
		Для Каждого Идентификатор Из СведенияОбУчастникеСвязи.Идентификаторы Цикл
			ИдентификаторЭПД = Идентификатор.Идентификатор;
			Наименование     = Идентификатор.Наименование;
			Комментарий      = Идентификатор.Комментарий;
			
			ЧастиПредставления = Новый Массив; // Массив Из Строка
			
			Если Не ПустаяСтрока(ИдентификаторЭПД) Тогда
				ЧастиПредставления.Добавить(ИдентификаторЭПД);
			КонецЕсли;
			Если Не ПустаяСтрока(Наименование) Тогда
				ЧастиПредставления.Добавить(Наименование);
			КонецЕсли;
			Если Не ПустаяСтрока(Комментарий) Тогда
				ЧастиПредставления.Добавить(Комментарий);
			КонецЕсли;
			
			Представление = СтрСоединить(ЧастиПредставления, " - ");
			
			СписокВыбора.Добавить(ИдентификаторЭПД, Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  АдресРезультата - Строка
&НаСервере
Процедура ПриПолученииИдентификаторовЭПДНаСервере(АдресРезультата)
	
	Связь = ПолучитьИзВременногоХранилища(
		АдресРезультата); // См. СервисEDIСлужебный.НоваяСвязьИдентификаторовУчастниковЭТрН
	
	ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
		Связь.Организация, 
		ОжидаетсяПолучениеИдентификатораОрганизации,
		Организация,
		ИдентификаторОрганизации, 
		ИдентификаторОрганизацииСписокВыбора);
	ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
		Связь.Контрагент, 
		ОжидаетсяПолучениеИдентификатораКонтрагента,
		Контрагент,
		ИдентификаторКонтрагента, 
		ИдентификаторКонтрагентаСписокВыбора);
	ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
		Связь.Перевозчик, 
		ОжидаетсяПолучениеИдентификатораПеревозчика,
		Перевозчик,
		ИдентификаторПеревозчика, 
		ИдентификаторПеревозчикаСписокВыбора);
	
	ОбновитьОтображениеФормы(ЭтотОбъект);
	
КонецПроцедуры

// Параметры:
//  АдресРезультата         - Строка
//                          - Неопределено
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ПриПолученииИдентификаторовЭПД(Знач АдресРезультата, Знач ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = Неопределено;
	ФоновоеЗаданиеЗапущено = Ложь;
	
	Если АдресРезультата = Неопределено Тогда
		ОбновитьОтображениеФормы(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ПриПолученииИдентификаторовЭПДНаСервере(АдресРезультата);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор
&НаСервереБезКонтекста
Процедура ПрерватьДлительнуюОперациюНаСервере(Знач ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьДлительнуюОперацию()
	
	ФоновоеЗаданиеЗапущено = Ложь;
	
	Если ДлительнаяОперация <> Неопределено Тогда
		//@skip-check property-return-type
		//@skip-check invocation-parameter-type-intersect
		ПрерватьДлительнуюОперациюНаСервере(ДлительнаяОперация.ИдентификаторЗадания);
		ДлительнаяОперация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтрольДлительнойОперации()
	
	Если Не ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяФоновоеЗадание = 
		ОжидаетсяПолучениеИдентификатораОрганизации
			Или ОжидаетсяПолучениеИдентификатораКонтрагента
			Или ОжидаетсяПолучениеИдентификатораПеревозчика;
	
	Если ТребуетсяФоновоеЗадание Тогда
		Возврат;
	КонецЕсли;
	
	ПрерватьДлительнуюОперацию();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДанных

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Настройки = СервисEDIСлужебный.НовыеНастройкиЭТрН();
	
	Настройки.Организация               = Организация;
	Настройки.Контрагент                = Контрагент;
	Настройки.Перевозчик                = Перевозчик;
	Настройки.ИдентификаторОрганизации  = ИдентификаторОрганизации;
	Настройки.ИдентификаторКонтрагента  = ИдентификаторКонтрагента;
	Настройки.ИдентификаторПеревозчика  = ИдентификаторПеревозчика;
	Настройки.Сертификат                = Сертификат;
	Настройки.Доверенность              = Доверенность;
	
	СервисEDIСлужебный.ЗаписатьНастройкиЭТрН(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область АвтоПодбор

// Параметры:
//  СписокПриемник - СписокЗначений Из Строка
//  СписокИсточник - СписокЗначений Из Строка
&НаКлиентеНаСервереБезКонтекста
Процедура СкопироватьСписок(СписокПриемник, Знач СписокИсточник)
	
	СписокПриемник.Очистить();
	
	Для каждого ЭлементСписка Из СписокИсточник Цикл
		СписокПриемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Текст                - Строка
//  ДанныеВыбора         - СписокЗначений Из Строка
//  СписокВыбора         - СписокЗначений Из Строка
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура ИдентификаторАвтоПодбор(Знач Текст, ДанныеВыбора, Знач СписокВыбора, СтандартнаяОбработка)
	
	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(Текст) Тогда
		ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из Строка
		СтандартнаяОбработка = Ложь;
		СкопироватьСписок(ДанныеВыбора, СписокВыбора);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из Строка
	ПодстрокаПоиска = ВРег(Текст);
	
	ЦветВыделения  = WebЦвета.ТемноЗеленый;
	//@skip-check new-font - Шрифт Авто
	ШрифтВыделения = Новый Шрифт(, , Истина);
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		Позиция = СтрНайти(ВРег(ЭлементСписка.Представление), ПодстрокаПоиска);
		
		Если Позиция = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстВхождения = Сред(ЭлементСписка.Представление, Позиция, СтрДлина(Текст));
		
		Начало    = Лев(ЭлементСписка.Представление, Позиция - 1);
		Вхождение = Новый ФорматированнаяСтрока(ТекстВхождения, ШрифтВыделения, ЦветВыделения);
		Конец     = Сред(ЭлементСписка.Представление, Позиция + СтрДлина(Текст));
		
		Представление = Новый ФорматированнаяСтрока(Начало, Вхождение, Конец);
		
		ДанныеВыбора.Добавить(
			ЭлементСписка.Значение,
			Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
