
&ИзменениеИКонтроль("ПодготовитьТаблицыРасчетНалога")
Функция Расш1_ПодготовитьТаблицыРасчетНалога(ТаблицаРеквизиты, Отказ, ДополнительныеПараметры)

	ТаблицыСправокРасчетов = Новый Структура;

	СтруктураТаблиц = Новый Структура();
	СтруктураТаблиц.Вставить("ТаблицаПроводок", Неопределено);
	СтруктураТаблиц.Вставить("ТаблицаПроводокПлатон", Неопределено);
	СтруктураТаблиц.Вставить("ТаблицаДвиженийПлатон", Неопределено);
	СтруктураТаблиц.Вставить("ТаблицыСправокРасчетов", ТаблицыСправокРасчетов);

	Если Не ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;

	Параметры = ПодготовитьПараметрыРасчетНалога(ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];

	Если Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество 
		И Реквизиты.Период < РасчетИмущественныхНалогов.НачалоПримененияНовогоРасчетаНалогаНаИмущество() Тогда
		ТаблицыСправокРасчетов.Вставить("РасчетНалогаНаИмущество",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетНалогаНаИмущество"));	
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		ТаблицыСправокРасчетов.Вставить("РасчетНалогаНаИмуществоПоСреднегодовойСтоимости",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетНалогаНаИмуществоПоСреднегодовойСтоимости"));	
		ТаблицыСправокРасчетов.Вставить("РасчетНалогаНаИмуществоПоКадастровойСтоимости",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетНалогаНаИмуществоПоКадастровойСтоимости"));	
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог
		И Реквизиты.Период < РасчетИмущественныхНалоговКлиентСервер.НачалоПримененияНовогоРасчетаТранспортногоНалога() Тогда
		// Устаревший расчет оставлен для совместимости с периодами до 2020 года
		ТаблицыСправокРасчетов.Вставить("РасчетТранспортногоНалогаДо2020",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетТранспортногоНалогаДо2020"));	
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		ТаблицыСправокРасчетов.Вставить("РасчетТранспортногоНалога",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетТранспортногоНалога"));	
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог
		И Реквизиты.Период < РасчетИмущественныхНалоговКлиентСервер.НачалоПримененияНовогоРасчетаЗемельногоНалога() Тогда
		// Устаревший расчет оставлен для совместимости с периодами до 2020 года
		ТаблицыСправокРасчетов.Вставить("РасчетЗемельногоНалогаДо2020",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетЗемельногоНалогаДо2020"));	
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		ТаблицыСправокРасчетов.Вставить("РасчетЗемельногоНалога",
		УправлениеВнеоборотнымиАктивами.ПустаяСправкаРасчет("РасчетЗемельногоНалога"));	
	КонецЕсли;

	ТаблицаПроводок = ПустаяТаблицаПроводок();
	ТаблицыПлатон = ПустыеТаблицыДвиженийПлатон();	
	Ошибки = Новый Массив;

	РассчитатьНалог(Реквизиты, ТаблицаПроводок, ТаблицыСправокРасчетов, ТаблицыПлатон, ДополнительныеПараметры, Ошибки, Отказ);
	#Вставка
	Если Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		ЮЦАУ.РаспределитьТранспортныйНалог(ТаблицаПроводок, Реквизиты);
	КонецЕсли;	
	#КонецВставки
	Если Отказ Тогда

		СтруктураТаблиц.Вставить("Ошибки", Ошибки);

	Иначе

		СтруктураТаблиц.Вставить("ТаблицаПроводок", ТаблицаПроводок);
		СтруктураТаблиц.Вставить("ТаблицаПроводокПлатон", ТаблицыПлатон.Хозрасчетный);
		СтруктураТаблиц.Вставить("ТаблицаДвиженийПлатон", ТаблицыПлатон.РасходыНаПлатон);
		СтруктураТаблиц.Вставить("ТаблицыСправокРасчетов", ТаблицыСправокРасчетов);

	КонецЕсли;

	Возврат СтруктураТаблиц;

КонецФункции
