
&После("ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения")
Процедура Расш1_ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных)

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЮЦАУ_ДанныеПоМаршрутам", 								 "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЮЦАУ_НастройкаЗакрытияСчета25_02",						 "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЮЦАУ_УстановкаОсновныхМаршрутовТС",						 "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЮЦАУ_УстановкаОсновныхТССотрудников", 					 "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЮЦАУ_УстановкаСоответствияМаршрутовИНоменклатурныхГрупп", "Дата" , "БухгалтерскийУчет", "Организация");

КонецПроцедуры
