
&ИзменениеИКонтроль("НовыйМодификаторБазыРаспределения")
Функция Расш1_НовыйМодификаторБазыРаспределения(БазаРаспределения)

	Модификатор = Неопределено;

	Если БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда

		Модификатор = Новый Структура;
		Модификатор.Вставить("СтатьиЗатрат", Новый Массив);
		// В информационной базе отбор может храниться, в том числе,
		// в виде именованного списка (в отдельном справочнике списков)
		Модификатор.Вставить(
		"Ссылка",
		Справочники.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка());

	ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.Выручка
		Или БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ВыручкаОтРеализацииУслуг Тогда

		Модификатор = Новый Структура;
		// Аналитика, на которую относятся расходы в результате распределения
		Модификатор.Вставить("Счет",             ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		Модификатор.Вставить("Подразделение",    Справочники.ПодразделенияОрганизаций.ПустаяСсылка());

	ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.СобственнаяБазаРаспределения Тогда

		Модификатор = Новый Структура;
		Модификатор.Вставить("НаименованиеБазы",            "");
		Модификатор.Вставить("ЕдиницаИзмеренияПоказателя",  "");
		// Содержит колонки "Счет", "Коэффициент", а также колонки, соответствующие видам субконто счетов, на которые распределяются
		// затраты собственной базы распределения.
		Модификатор.Вставить("ТаблицаБазы",                    Новый ТаблицаЗначений);
		Модификатор.Вставить("НастройкаАналитикиБазы",         НовыйНастройкаАналитикиБазы());
		#Удаление
		Модификатор.Вставить("Счет",                           ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		#КонецУдаления
		#Вставка     
		Модификатор.Вставить("Счет",                           ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники);     //25.02
		#КонецВставки
		Модификатор.Вставить("ИдентификаторБазыРаспределения", "");

	КонецЕсли;

	Возврат Модификатор;

КонецФункции
