
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.ДатаПериода = НачалоМесяца(ТекущаяДата());
	Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	//Объект.ПодразделениеДт20 = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеОсновноеПодразделение", Объект.Организация, Объект.ДатаПериода);
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	//Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
	//	ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеСоСклада;
	//КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой");
	
	//УстановитьСвойстваФормыДляОперацииСписаниеСоСклада();
	
	//УстановитьСостояниеДокумента();
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой", Модифицированность);
	//ОбработатьИзменениеПериодаЗаполненияНаСервере();
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.ДатаПериода), КонецМесяца(Объект.ДатаПериода));
	ОписаниеОповещения     = Новый ОписаниеОповещения("ПериодЗаполненияСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбораПериода, Элементы.ПериодЗаполненияСтрокой, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаПериода = РезультатВыбора.НачалоПериода;
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой", Направление, Модифицированность);
//	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцНачисленияПриИзменении", 0.3, Истина);
	УправлениеФормойНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);   
	//УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	//УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойНаСервере()

	//Зачистка отбора по дате
	//ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Дата");
	
	//Установка отбора по дате
	//ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата", КонецМесяца(Объект.ДатаПериода), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	//ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата", НачалоМесяца(Объект.ДатаПериода), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);

КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьПотреблениеТопливаНаСервере()
	
	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация);

	Если ПараметрыПодключения = Неопределено Тогда
		Сообщить("Не определены параметры подключения к УАТ!");
		Возврат;
	КонецЕсли;	
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
		Сообщить("Не удалось подключиться по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ДатаНачала = НачалоМесяца(Объект.ДатаПериода);
	ДатаКонца = КонецМесяца(Объект.ДатаПериода);
	//http://localhost/UAT/hs/api_uat/FuelConsumption?StartDate=01.03.2023&EndDate=31.03.2023
	РесурсНаСервере = "/UAT/hs/api_uat/FuelConsumption?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д");
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
			
	//Получаем ответный текст или текст ошибки  
	Если HTTPОтвет.КодСостояния = 401 Тогда
		Сообщить("Не удалось авторизоваться в программе УАТ. Неверный логин или пароль. HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		Сообщить("HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	Иначе	

		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ПолучитьСтруктуруИзJSON(СтрокаJSON);
		ДесериализоватьJSON_ПотреблениеТоплива(СтрокаJSON);  

	КонецЕсли;		
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотреблениеТоплива(Команда)
	ЗагрузитьПотреблениеТопливаНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта, НаименованиеОбъекта="", ТипОбъекта="", ДополнительныйРеквизит=Неопределено, СоздаватьОбъекты=Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		|ГДЕ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор = &Идентификатор
		|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//Если СоздаватьОбъекты Тогда     
	//	
	//	ОбъектСсылка = ПолучитьСсылкуОбъекта(НаименованиеОбъекта, ДополнительныйРеквизит, ТипОбъекта); 
	//	Если ОбъектСсылка <> Неопределено Тогда
	//	
	//		НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

	//		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторОбъекта); 
	//		НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

	//		НоваяЗапись = НаборЗаписей.Добавить(); 
	//		НоваяЗапись.Идентификатор = ИдентификаторОбъекта; 
	//		НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
	//		НоваяЗапись.Ссылка = ОбъектСсылка; 

	//		НаборЗаписей.Записать(); 
	//		
	//	КонецЕсли;			
	//	
	//	Возврат ОбъектСсылка;
	//	
	//Иначе	
	//	Сообщить("Не удалось определить объект с типом: " + ТипОбъекта + " для УИН: " + ИдентификаторОбъекта + " с наименованием: " + НаименованиеОбъекта);
		Возврат Неопределено;
	//КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПолучитьПодразделение(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИДСсылки);
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Попытка поиска подразделения по идентификатору
		ПодразделениеСсылка = ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);
		Если ПодразделениеСсылка <> Неопределено Тогда   
			Возврат ПодразделениеСсылка;
		КонецЕсли;	
		
		Сообщить("Не найдено подразделение: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
		Возврат Неопределено; 
		
	Иначе     

		Если СтруктураОбъекта.Код <> СсылкаВИБ.Код Тогда
			Сообщить("Отличается код для подразделения: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
		КонецЕсли;	
		
		Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
			Сообщить("Отличается наименование для подразделения: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		КонецЕсли;	

		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

// Функция для десериализации в JSON
&НаСервере
Функция ПолучитьСтруктуруИзJSON(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат СтруктураИзJSON;
	
КонецФункции	

&НаСервере
Процедура ДесериализоватьJSON_ПотреблениеТоплива(СтрокаJSON)
	
	СоздаватьОбъекты = Истина;
	
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Период");
	МассивПолейДат.Добавить("ДатаПериода");
	МассивПолейДат.Добавить("ФизлицоДатаРождения");
	СписокСтрок = ДесериализоватьJSON(СтрокаJSON, МассивПолейДат);	
	
	ТаблицаПотреблениеТоплива.Очистить();

	Для Каждого СтруктураСтроки Из СписокСтрок.ДанныеПотреблениеТоплива Цикл
		
		Склад = Неопределено;
		ТранспортноеСредство = Неопределено;
		Номенклатура = Неопределено;
		Подразделение = Неопределено;

		Если СтруктураСтроки.Свойство("ТранспортноеСредство") Тогда
			ТранспортноеСредство = ПолучитьТранспортноеСредство(СтруктураСтроки.ТранспортноеСредство);
		КонецЕсли;	
		
		Если СтруктураСтроки.Свойство("Номенклатура") Тогда                                 
			Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("Подразделение") Тогда                                 
			Подразделение = ПолучитьПодразделение(СтруктураСтроки.Подразделение);
		КонецЕсли;	

		НоваяСтрока = ТаблицаПотреблениеТоплива.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		НоваяСтрока.ТранспортноеСредство = ТранспортноеСредство;
		НоваяСтрока.ПодразделениеЗатрат = Подразделение;
		НоваяСтрока.Номенклатура = Номенклатура;    
			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзАналогиНоменклатуры.Склад КАК Склад,
		|	тзАналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	тзАналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|ПОМЕСТИТЬ ВТ_АналогиНоменклатуры
		|ИЗ
		|	&тзАналогиНоменклатуры КАК тзАналогиНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзПотреблениеТоплива.ТранспортноеСредство КАК ТранспортноеСредство,
		|	тзПотреблениеТоплива.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзПотреблениеТоплива.Номенклатура КАК Номенклатура,
		|	тзПотреблениеТоплива.РасходПоФакту КАК РасходПоФакту
		|ПОМЕСТИТЬ ВТ_ПотреблениеТоплива
		|ИЗ
		|	&тзПотреблениеТоплива КАК тзПотреблениеТоплива
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТоплива.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ПотреблениеТоплива.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТоплива.Номенклатура КАК Номенклатура,
		|	ВТ_ПотреблениеТоплива.РасходПоФакту КАК РасходПоФакту,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СкладТопливо КАК Склад,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетУчетаГСМ КАК СчетУчетаГСМ
		|ПОМЕСТИТЬ ВТ_ПотреблениеТопливаИтог
		|ИЗ
		|	ВТ_ПотреблениеТоплива КАК ВТ_ПотреблениеТоплива
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение КАК Подразделение,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СкладТопливо КАК СкладТопливо,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетУчетаГСМ КАК СчетУчетаГСМ
		|		ИЗ
		|			РегистрСведений.ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТ.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних) КАК ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних
		|		ПО ВТ_ПотреблениеТоплива.ПодразделениеЗатрат = ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТопливаИтог.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ПотреблениеТопливаИтог.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТопливаИтог.РасходПоФакту КАК РасходПоФакту,
		|	ВТ_ПотреблениеТопливаИтог.Склад КАК Склад,
		|	ВТ_ПотреблениеТопливаИтог.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ПотреблениеТопливаИтог.СчетУчетаГСМ КАК СчетУчетаГСМ,
		|	ЕСТЬNULL(ВЗ_АналогиНоменклатуры.АналогНоменклатуры, ВТ_ПотреблениеТопливаИтог.Номенклатура) КАК Номенклатура
		|ИЗ
		|	ВТ_ПотреблениеТопливаИтог КАК ВТ_ПотреблениеТопливаИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_АналогиНоменклатуры.Склад КАК Склад,
		|			ВТ_АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|			ВТ_АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|		ИЗ
		|			ВТ_АналогиНоменклатуры КАК ВТ_АналогиНоменклатуры) КАК ВЗ_АналогиНоменклатуры
		|		ПО ВТ_ПотреблениеТопливаИтог.Склад = ВЗ_АналогиНоменклатуры.Склад
		|			И ВТ_ПотреблениеТопливаИтог.Номенклатура = ВЗ_АналогиНоменклатуры.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	ПодразделениеЗатрат,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	тзПотреблениеТоплива = ТаблицаПотреблениеТоплива.Выгрузить();
	тзАналогиНоменклатуры = ТаблицаАналогиНоменклатуры.Выгрузить();
	
	Запрос.УстановитьПараметр("тзПотреблениеТоплива", тзПотреблениеТоплива);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", тзАналогиНоменклатуры);
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(Объект.ДатаПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ТаблицаПотреблениеТоплива.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДесериализоватьJSON(СтрокаJSON, ПоляДат = "")

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Объект = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Объект;
	
КонецФункции

&НаСервере
Функция ПолучитьТранспортноеСредство(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ТранспортныеСредства.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			//ОбъектКакОбъект = Справочники.ТранспортныеСредства.СоздатьГруппу();   
			//ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		Иначе   

			ОбъектКакОбъект = Справочники.ТранспортныеСредства.СоздатьЭлемент();
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			ОбъектКакОбъект.РегистрационныйЗнак = СтруктураОбъекта.ГосударственныйНомер;  
			
			ОбъектКакОбъект.Модель = ПолучитьМодель(СтруктураОбъекта.Модель);
			ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);

		КонецЕсли;

		//Если СтруктураОбъекта.Свойство("Родитель") Тогда 
		//	ОбъектКакОбъект.Родитель = ПолучитьТранспортноеСредство(СтруктураОбъекта.Родитель);	
		//КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();
		
		Возврат ОбъектКакОбъект.Ссылка;	
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьМодель(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.уатМоделиТС.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.уатМоделиТС.СоздатьГруппу();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		Иначе
			
			ОбъектКакОбъект = Справочники.уатМоделиТС.СоздатьЭлемент();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			ОбъектКакОбъект.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт;	
			
			ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);
			
		КонецЕсли;		
		
		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьМодель(СтруктураОбъекта.Родитель);	
		КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	

		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьТипТС(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.уатТипыТС.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.уатТипыТС.СоздатьГруппу();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		Иначе
			ОбъектКакОбъект = Справочники.уатТипыТС.СоздатьЭлемент();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			//ОбъектКакОбъект.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт;	
			
			//ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);
		КонецЕсли;
		
		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьТипТС(СтруктураОбъекта.Родитель);	
		КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	

		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьНоменклатуру(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Номенклатура.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Если СтруктураОбъекта.ЭтоГруппа Тогда
		//	ОбъектКакОбъект = Справочники.Номенклатура.СоздатьГруппу();
		//Иначе	
		//	ОбъектКакОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		//КонецЕсли;

		//ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		//ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		//ОбъектКакОбъект.ВидНоменклатуры = ПолучитьВидНоменклатуры(СтруктураОбъекта.ВидНоменклатуры);

		//Если СтруктураОбъекта.Свойство("Родитель") Тогда 
		//	ОбъектКакОбъект.Родитель = ПолучитьНоменклатуру(СтруктураОбъекта.Родитель);
		//КонецЕсли;
		//
		//Если СтруктураОбъекта.ЭтоГруппа = Ложь Тогда
		//	
		//	ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное; 
		//	ОбъектКакОбъект.Артикул = СтруктураОбъекта.Артикул;
		//	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;                                                
		//	
		//	//Единица измерения подбирается по наименованию                                                            
		//	Идентификатор = СтруктураОбъекта.ЕдиницаИзмерения.Идентификатор;                                                         
		//	Наименование = СтруктураОбъекта.ЕдиницаИзмерения.Наименование;
		//	ОбъектКакОбъект.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Идентификатор, Наименование);
		//	
		//	ОбъектКакОбъект.Услуга = СтруктураОбъекта.Услуга;
		//	
		//	//СтруктураОбъекта.Вставить("КодГруза", Номенклатура.КодГруза);
		//	
		//КонецЕсли;	
		//
		//ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		//ОбъектКакОбъект.Записать();	
		//
		//Возврат ОбъектКакОбъект.Ссылка;
		
		//Попытка поиска номенклатуры по коду и наименованию
		НоменклатураСсылка = ПолучитьНоменклатуруПоКодуИНаименованию(СтруктураОбъекта.Код, СтруктураОбъекта.Наименование);
		Если НоменклатураСсылка = Неопределено Тогда
			Сообщить("Не найдена номенклатура: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
			Возврат Неопределено; 
		Иначе
			Возврат НоменклатураСсылка;
		КонецЕсли;	
		
	Иначе         
		
		Если СтруктураОбъекта.Код <> СсылкаВИБ.Код Тогда
			Сообщить("Отличается код для номенклатуры: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
		КонецЕсли;	
		
		Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
			Сообщить("Отличается наименование для номенклатуры: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		КонецЕсли;	

		Возврат СсылкаВИБ; 

	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьНоменклатуруПоКодуИНаименованию(Код, Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.Код = &Код
		|	И Номенклатура.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСклад(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Склады.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Если СтруктураОбъекта.ЭтоГруппа Тогда
		//	ОбъектКакОбъект = Справочники.Номенклатура.СоздатьГруппу();
		//Иначе	
		//	ОбъектКакОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		//КонецЕсли;

		//ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		//ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		//ОбъектКакОбъект.ВидНоменклатуры = ПолучитьВидНоменклатуры(СтруктураОбъекта.ВидНоменклатуры);

		//Если СтруктураОбъекта.Свойство("Родитель") Тогда 
		//	ОбъектКакОбъект.Родитель = ПолучитьНоменклатуру(СтруктураОбъекта.Родитель);
		//КонецЕсли;
		//
		//Если СтруктураОбъекта.ЭтоГруппа = Ложь Тогда
		//	
		//	ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное; 
		//	ОбъектКакОбъект.Артикул = СтруктураОбъекта.Артикул;
		//	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;                                                
		//	
		//	//Единица измерения подбирается по наименованию                                                            
		//	Идентификатор = СтруктураОбъекта.ЕдиницаИзмерения.Идентификатор;                                                         
		//	Наименование = СтруктураОбъекта.ЕдиницаИзмерения.Наименование;
		//	ОбъектКакОбъект.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Идентификатор, Наименование);
		//	
		//	ОбъектКакОбъект.Услуга = СтруктураОбъекта.Услуга;
		//	
		//	//СтруктураОбъекта.Вставить("КодГруза", Номенклатура.КодГруза);
		//	
		//КонецЕсли;	
		//
		//ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		//ОбъектКакОбъект.Записать();	
		//
		//Возврат ОбъектКакОбъект.Ссылка;
		
		Сообщить("Не найден склад: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
		Возврат Неопределено; 
		
	Иначе     

		Если СтруктураОбъекта.Код <> СсылкаВИБ.Код Тогда
			Сообщить("Отличается код для склада: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
		КонецЕсли;	
		
		Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
			Сообщить("Отличается наименование для склада: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		КонецЕсли;	

		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьТекстЗапросаПотребленияТопливаИТехническихЖидкостей(ПодразделениеЗатрат=Неопределено)

	Если ПодразделениеЗатрат = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки") Тогда 
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	тзАналогиНоменклатуры.Склад КАК Склад,
		|	тзАналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	тзАналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|ПОМЕСТИТЬ ВТ_АналогиНоменклатуры
		|ИЗ
		|	&тзАналогиНоменклатуры КАК тзАналогиНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.Склад КАК Склад,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.ТранспортноеСредство КАК ТранспортноеСредство,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура КАК Номенклатура,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат КАК СчетЗатрат,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ КАК СчетУчетаГСМ,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.РасходПоФакту КАК РасходПоФакту
		|ПОМЕСТИТЬ ВТ_ПотреблениеТопливаИлиТехническихЖидкостей
		|ИЗ
		|	&тзПотреблениеТопливаИлиТехническихЖидкостей КАК тзПотреблениеТопливаИлиТехническихЖидкостей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад КАК Склад,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ЕСТЬNULL(ВЗ_АналогиНоменклатуры.АналогНоменклатуры, ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура) КАК Номенклатура,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ КАК Счет,
		|	СУММА(ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.РасходПоФакту) КАК РасходПоФакту
		|ИЗ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей КАК ВТ_ПотреблениеТопливаИлиТехническихЖидкостей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_АналогиНоменклатуры.Склад КАК Склад,
		|			ВТ_АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|			ВТ_АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|		ИЗ
		|			ВТ_АналогиНоменклатуры КАК ВТ_АналогиНоменклатуры) КАК ВЗ_АналогиНоменклатуры
		|		ПО ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад = ВЗ_АналогиНоменклатуры.Склад
		|			И ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура = ВЗ_АналогиНоменклатуры.Номенклатура
		|ГДЕ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат = &ПодразделениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ТранспортноеСредство,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад,
		|	ВЗ_АналогиНоменклатуры.АналогНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	ТранспортноеСредство
		|ИТОГИ
		|	СУММА(РасходПоФакту)
		|ПО
		|	ОБЩИЕ,
		|	Склад,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Иначе
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	тзАналогиНоменклатуры.Склад КАК Склад,
		|	тзАналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	тзАналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|ПОМЕСТИТЬ ВТ_АналогиНоменклатуры
		|ИЗ
		|	&тзАналогиНоменклатуры КАК тзАналогиНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.Склад КАК Склад,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура КАК Номенклатура,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат КАК СчетЗатрат,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ КАК СчетУчетаГСМ,
		|	тзПотреблениеТопливаИлиТехническихЖидкостей.РасходПоФакту КАК РасходПоФакту
		|ПОМЕСТИТЬ ВТ_ПотреблениеТопливаИлиТехническихЖидкостей
		|ИЗ
		|	&тзПотреблениеТопливаИлиТехническихЖидкостей КАК тзПотреблениеТопливаИлиТехническихЖидкостей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад КАК Склад,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ЕСТЬNULL(ВЗ_АналогиНоменклатуры.АналогНоменклатуры, ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура) КАК Номенклатура,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ КАК Счет,
		|	СУММА(ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.РасходПоФакту) КАК РасходПоФакту
		|ИЗ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей КАК ВТ_ПотреблениеТопливаИлиТехническихЖидкостей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_АналогиНоменклатуры.Склад КАК Склад,
		|			ВТ_АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|			ВТ_АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|		ИЗ
		|			ВТ_АналогиНоменклатуры КАК ВТ_АналогиНоменклатуры) КАК ВЗ_АналогиНоменклатуры
		|		ПО ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад = ВЗ_АналогиНоменклатуры.Склад
		|			И ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура = ВЗ_АналогиНоменклатуры.Номенклатура
		|ГДЕ
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат <> &ПодразделениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетУчетаГСМ,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.СчетЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Номенклатура,
		|	ВТ_ПотреблениеТопливаИлиТехническихЖидкостей.Склад,
		|	ВЗ_АналогиНоменклатуры.АналогНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад
		|ИТОГИ
		|	СУММА(РасходПоФакту)
		|ПО
		|	ОБЩИЕ,
		|	Склад
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;	
	
КонецФункции		

&НаСервере
Процедура СоздатьДокументыПотребленияТопливаИТехническихЖидкостейНаСервере(ТаблицаПотребления, Комментарий)

	СтатьяЗатратСтоимостьГСМ = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СтатьяЗатратСтоимостьГСМ", Объект.Организация, Объект.ДатаПериода);
	
	//Обработка подразделения "Автобусная колонна (пассажирские перевозки)"
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПотребленияТопливаИТехническихЖидкостей(ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	Запрос.УстановитьПараметр("тзПотреблениеТопливаИлиТехническихЖидкостей", ТаблицаПотребления);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", ТаблицаАналогиНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
		СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
		СтруктураПараметров.Вставить("Комментарий", Комментарий + " " + ПодразделениеАвтоколоннаПассажирскиеПеревозки);
		СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Истина);

		ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров);		 
		
		Если ДокументТребованиеНакладная.Проведен Тогда //Проведенные документы не перезаписываются!
			Продолжить;
		КонецЕсли;
		
		ДокументТребованиеНакладная.Материалы.Очистить();
		
		ВыборкаПоНоменклатуре = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
			
			ВыборкаПоТранспортномуСредству = ВыборкаПоНоменклатуре.Выбрать(); 
			Пока ВыборкаПоТранспортномуСредству.Следующий() Цикл 

				НоваяСтрока = ДокументТребованиеНакладная.Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТранспортномуСредству); 
				НоваяСтрока.Количество = ВыборкаПоТранспортномуСредству.РасходПоФакту;
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = 1;
				НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
				НоваяСтрока.Субконто1 = СтатьяЗатратСтоимостьГСМ; 
				НоваяСтрока.Субконто3 = ВыборкаПоТранспортномуСредству.ТранспортноеСредство; 
				НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		ДокументТребованиеНакладная.Записать(РежимЗаписиДокумента.Запись);

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Записан документ: " + ДокументТребованиеНакладная;
		Сообщение.Сообщить();

	КонецЦикла; 
	
	//Обработка остальных категорий транспорта

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПотребленияТопливаИТехническихЖидкостей();
	
	Запрос.УстановитьПараметр("тзПотреблениеТопливаИлиТехническихЖидкостей", ТаблицаПотребления);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", ТаблицаАналогиНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
		СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
		СтруктураПараметров.Вставить("Комментарий", Комментарий);
		СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Истина);

		ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров);		
		
		Если ДокументТребованиеНакладная.Проведен Тогда //Проведенные документы не перезаписываются!
			Продолжить;
		КонецЕсли;
		
		ДокументТребованиеНакладная.Материалы.Очистить();
		
		ВыборкаПоНоменклатуре = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
			
			НоваяСтрока = ДокументТребованиеНакладная.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре); 
			НоваяСтрока.Количество = ВыборкаПоНоменклатуре.РасходПоФакту;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
			НоваяСтрока.Субконто1 = СтатьяЗатратСтоимостьГСМ; 
			НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
				
		КонецЦикла; 
		
		ДокументТребованиеНакладная.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Записан документ: " + ДокументТребованиеНакладная;
		Сообщение.Сообщить();
		
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПотребленияТопливаНаСервере()
	
	СоздатьДокументыПотребленияТопливаИТехническихЖидкостейНаСервере(ТаблицаПотреблениеТоплива.Выгрузить(), "#Потребление топлива");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПотребленияТоплива(Команда)    
	
	СуществуютДокументыВПериоде = СуществуютДокументыПотребленияТопливаИТехническихЖидкостейВПериоде("#Потребление топлива");
	
	Если СуществуютДокументыВПериоде Тогда
		
		ТекстВопроса = НСтр("ru = 'Существующие документы будут перезаполнены. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередФормированиемДокументовПотребленияТопливаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Формирование документов'"));
	
	Иначе	
		СоздатьДокументыПотребленияТопливаНаСервере();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВопросПередФормированиемДокументовПотребленияТопливаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьДокументыПотребленияТопливаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СуществуютДокументыПотребленияТопливаИТехническихЖидкостейВПериоде(Комментарий)  
	
	Если Комментарий = "#Потребление тех. жидкостей" Тогда
		ТаблицаПотребления = ТаблицаПотреблениеТехническихЖидкостей.Выгрузить();
    Иначе
		ТаблицаПотребления = ТаблицаПотреблениеТоплива.Выгрузить();
	КонецЕсли;	
	
	//Обработка подразделения "Автобусная колонна (пассажирские перевозки)"
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПотребленияТопливаИТехническихЖидкостей(ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	Запрос.УстановитьПараметр("тзПотреблениеТопливаИлиТехническихЖидкостей", ТаблицаПотребления);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", ТаблицаАналогиНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
		СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
		СтруктураПараметров.Вставить("Комментарий", Комментарий + " " + ПодразделениеАвтоколоннаПассажирскиеПеревозки);
		СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Истина);

		СоздаватьДокумент = Ложь;
		ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров, СоздаватьДокумент);		
					
		Если ДокументТребованиеНакладная <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;	

	КонецЦикла; 
	
	//Обработка остальных категорий транспорта

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПотребленияТопливаИтехническихЖидкостей();
	
	Запрос.УстановитьПараметр("тзПотреблениеТопливаИлиТехническихЖидкостей", ТаблицаПотребления);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", ТаблицаАналогиНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
		СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
		СтруктураПараметров.Вставить("Комментарий", Комментарий);
		СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Истина);

		СоздаватьДокумент = Ложь;
		ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров, СоздаватьДокумент);		
					
		Если ДокументТребованиеНакладная <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции	

&НаСервере
Функция СуществуютДокументыСписанияМатериаловВПериоде(Комментарий)
	
	//Проверка существования документов в периоде
	СтатьяЗатратСтоимостьЗапчастей = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СтатьяЗатратСтоимостьЗапчастей", Объект.Организация, Объект.ДатаПериода);

	//Обработка подразделения "Автобусная колонна (пассажирские перевозки)"
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСписанияМатериалов(ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	тзСписаниеМатериалов = ТаблицаСписаниеМатериалов.Выгрузить();
	Запрос.УстановитьПараметр("тзСписаниеМатериалов", тзСписаниеМатериалов);
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	
		
		ВыборкаПоСчетуЗатрат = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоСчетуЗатрат.Следующий() Цикл 
		
			ВыборкаПоПодразделениюЗатрат = ВыборкаПоСчетуЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаПоПодразделениюЗатрат.Следующий() Цикл 
		
				ВыборкаПоТранспортномуСредству = ВыборкаПоПодразделениюЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				Пока ВыборкаПоТранспортномуСредству.Следующий() Цикл 

					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Организация", Объект.Организация);
					СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
					СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
					СтруктураПараметров.Вставить("СчетЗатрат", ВыборкаПоСчетуЗатрат.СчетЗатрат);
					СтруктураПараметров.Вставить("СтатьяЗатрат", СтатьяЗатратСтоимостьЗапчастей);
					СтруктураПараметров.Вставить("ПодразделениеЗатрат", ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
					СтруктураПараметров.Вставить("ТранспортноеСредство", ВыборкаПоТранспортномуСредству.ТранспортноеСредство);
					СтруктураПараметров.Вставить("Комментарий", "#Списание материалов " + ВыборкаПоТранспортномуСредству.ТранспортноеСредство);
					СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Ложь);

					СоздаватьДокумент = Ложь;
					ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров, СоздаватьДокумент);		
					
					Если ДокументТребованиеНакладная <> Неопределено Тогда
						Возврат Истина;
					КонецЕсли;	

				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 

	КонецЦикла; 
	
	//Обработка остальных категорий

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСписанияМатериалов();
	
	тзСписаниеМатериалов = ТаблицаСписаниеМатериалов.Выгрузить();
	Запрос.УстановитьПараметр("тзСписаниеМатериалов", тзСписаниеМатериалов);
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	
		
		ВыборкаПоСчетуЗатрат = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоСчетуЗатрат.Следующий() Цикл 
		
			ВыборкаПоПодразделениюЗатрат = ВыборкаПоСчетуЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаПоПодразделениюЗатрат.Следующий() Цикл 

				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Организация", Объект.Организация);
				СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
				СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
				СтруктураПараметров.Вставить("СчетЗатрат", ВыборкаПоСчетуЗатрат.СчетЗатрат);
				СтруктураПараметров.Вставить("СтатьяЗатрат", СтатьяЗатратСтоимостьЗапчастей);
				СтруктураПараметров.Вставить("ПодразделениеЗатрат", ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
				СтруктураПараметров.Вставить("ТранспортноеСредство", Неопределено);
				СтруктураПараметров.Вставить("Комментарий", "#Списание материалов " + ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
				СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Ложь);
				
				СоздаватьДокумент = Ложь;
				ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров, СоздаватьДокумент);
		
				Если ДокументТребованиеНакладная <> Неопределено Тогда
					Возврат Истина;
				КонецЕсли;	
				
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции	

&НаСервере
Функция ПолучитьДокументТребованиеНакладная(СтруктураПараметров, СоздаватьДокумент=Истина)

	Организация = СтруктураПараметров.Организация;
	ДатаПериода = СтруктураПараметров.ДатаПериода;                                                        
	Склад = СтруктураПараметров.Склад;
	Комментарий = СтруктураПараметров.Комментарий;
	СчетаУчетаЗатратВТаблице = СтруктураПараметров.СчетаУчетаЗатратВТаблице;
	
	СчетЗатрат = ?(СтруктураПараметров.Свойство("СчетЗатрат"),СтруктураПараметров.СчетЗатрат, Неопределено);
	СтатьяЗатрат = ?(СтруктураПараметров.Свойство("СтатьяЗатрат"),СтруктураПараметров.СтатьяЗатрат, Неопределено);
	ПодразделениеЗатрат = ?(СтруктураПараметров.Свойство("ПодразделениеЗатрат"),СтруктураПараметров.ПодразделениеЗатрат, Неопределено);
	ТранспортноеСредство = ?(СтруктураПараметров.Свойство("ТранспортноеСредство"),СтруктураПараметров.ТранспортноеСредство, Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТребованиеНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ТребованиеНакладная.Дата, МЕСЯЦ) = &Дата
		|	И ТребованиеНакладная.Организация = &Организация
		|	И ТребованиеНакладная.Склад = &Склад
		|	И ТребованиеНакладная.СчетаУчетаЗатратВТаблице = &СчетаУчетаЗатратВТаблице
		|	И ТребованиеНакладная.Комментарий ПОДОБНО &Комментарий";
		
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДатаПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Комментарий", Комментарий);
	Запрос.УстановитьПараметр("СчетаУчетаЗатратВТаблице", СчетаУчетаЗатратВТаблице);

	Если Не СчетаУчетаЗатратВТаблице Тогда //Отбор по реквизитам шапки документа	
		
		Запрос.Текст = Запрос.Текст + "
		|	И ТребованиеНакладная.СчетЗатрат = &СчетЗатрат
		|	И ТребованиеНакладная.ПодразделениеЗатрат = &ПодразделениеЗатрат
		|	И ТребованиеНакладная.Субконто1 = &СтатьяЗатрат";
		
		Запрос.УстановитьПараметр("СчетЗатрат", СчетЗатрат);
		Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеЗатрат);
		Запрос.УстановитьПараметр("СтатьяЗатрат", СтатьяЗатрат);
		
		Если ТранспортноеСредство <> Неопределено Тогда 
			Запрос.Текст = Запрос.Текст + " И ТребованиеНакладная.Субконто3 = &ТранспортноеСредство";
			Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
		КонецЕсли;	
		
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если СоздаватьДокумент Тогда

		ДокОбъект = Документы.ТребованиеНакладная.СоздатьДокумент();
		ДокОбъект.Дата = КонецМесяца(ДатаПериода) - 1;
		ДокОбъект.Организация = Организация;
		ДокОбъект.Склад = Склад;    
		
		Если Не СчетаУчетаЗатратВТаблице Тогда //Заполнение реквизитов шапки документа	
			
			ДокОбъект.СчетЗатрат = СчетЗатрат;
			ДокОбъект.ПодразделениеЗатрат = ПодразделениеЗатрат;
			
			ДокОбъект.Субконто1 = СтатьяЗатрат;
			Если ТранспортноеСредство <> Неопределено Тогда 
				ДокОбъект.Субконто2 = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
				ДокОбъект.Субконто3 = ТранспортноеСредство;
			КонецЕсли;
			
		КонецЕсли;
		
		ДокОбъект.ВидОперации = Перечисления.ВидыОперацийРасходМатериалов.ИспользованиеМатериалов;
		ДокОбъект.СчетаУчетаЗатратВТаблице = СчетаУчетаЗатратВТаблице; 
		ДокОбъект.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету; 
		ДокОбъект.Ответственный = Пользователи.ТекущийПользователь();
		ДокОбъект.Комментарий = Комментарий;
		
	Иначе
		ДокОбъект = Неопределено;
	КонецЕсли;
	
	Возврат ДокОбъект;
	
КонецФункции	

&НаСервере
Процедура ЗагрузитьСписаниеМатериаловНаСервере()
	
	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация);

	Если ПараметрыПодключения = Неопределено Тогда
		Сообщить("Не определены параметры подключения к УАТ!");
		Возврат;
	КонецЕсли;	
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
		Сообщить("Не удалось подключиться по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ДатаНачала = НачалоМесяца(Объект.ДатаПериода);
	ДатаКонца = КонецМесяца(Объект.ДатаПериода);
	//http://localhost/UAT/hs/api_uat/ItemsWriteOff?StartDate=01.04.2023&EndDate=30.04.2023
	РесурсНаСервере = "/UAT/hs/api_uat/ItemsWriteOff?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д");
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
			
	//Получаем ответный текст или текст ошибки  
	Если HTTPОтвет.КодСостояния = 401 Тогда
		Сообщить("Не удалось авторизоваться в программе УАТ. Неверный логин или пароль. HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		Сообщить("HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	Иначе	

		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ПолучитьСтруктуруИзJSON(СтрокаJSON);
		ДесериализоватьJSON_СписаниеМатериалов(СтрокаJSON);  

	КонецЕсли;		
	
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписаниеМатериалов(Команда)
	ЗагрузитьСписаниеМатериаловНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДесериализоватьJSON_СписаниеМатериалов(СтрокаJSON)
	
	СоздаватьОбъекты = Истина;
	
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Период");
	МассивПолейДат.Добавить("ДатаПериода");
	МассивПолейДат.Добавить("ФизлицоДатаРождения");
	СписокСтрок = ДесериализоватьJSON(СтрокаJSON, МассивПолейДат);	
	
	ТаблицаСписаниеМатериалов.Очистить();

	Для Каждого СтруктураСтроки Из СписокСтрок.ДанныеСписаниеМатериалов Цикл
		
		Склад = Неопределено;
		ТранспортноеСредство = Неопределено;
		Номенклатура = Неопределено;  
		НоменклатураУАТ = Неопределено;
		Подразделение = Неопределено;
		
		Если СтруктураСтроки.Свойство("Склад") Тогда
			Склад = ПолучитьСклад(СтруктураСтроки.Склад);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("ТранспортноеСредство") Тогда
			ТранспортноеСредство = ПолучитьТранспортноеСредство(СтруктураСтроки.ТранспортноеСредство);
		КонецЕсли;	
		
		Если СтруктураСтроки.Свойство("Подразделение") Тогда                                 
			Подразделение = ПолучитьПодразделение(СтруктураСтроки.Подразделение);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("Номенклатура") Тогда                                 
			Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
			НоменклатураУАТ = СтруктураСтроки.Номенклатура.Наименование; 
		КонецЕсли;	

		НоваяСтрока = ТаблицаСписаниеМатериалов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		НоваяСтрока.Склад = Склад;
		НоваяСтрока.ТранспортноеСредство = ТранспортноеСредство;
		НоваяСтрока.ПодразделениеЗатрат = Подразделение;

		Если ЗначениеЗаполнено(Номенклатура) Тогда
			СтруктураСчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, Номенклатура);
			НоваяСтрока.Счет = СтруктураСчетаУчета.СчетУчета;
		КонецЕсли;	
		
		НоваяСтрока.Номенклатура = Номенклатура;    
		НоваяСтрока.НоменклатураУАТ = НоменклатураУАТ;    
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзСписаниеМатериалов.Склад КАК Склад,
		|	тзСписаниеМатериалов.ТранспортноеСредство КАК ТранспортноеСредство,
		|	тзСписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзСписаниеМатериалов.НоменклатураУАТ КАК НоменклатураУАТ,
		|	тзСписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	тзСписаниеМатериалов.Счет КАК Счет,
		|	тзСписаниеМатериалов.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_СписаниеМатериалов
		|ИЗ
		|	&тзСписаниеМатериалов КАК тзСписаниеМатериалов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписаниеМатериалов.Склад КАК Склад,
		|	ВТ_СписаниеМатериалов.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_СписаниеМатериалов.НоменклатураУАТ КАК НоменклатураУАТ,
		|	ВТ_СписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	ВТ_СписаниеМатериалов.Счет КАК Счет,
		|	ВТ_СписаниеМатериалов.Количество КАК Количество,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|	ВЗ_ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|	ВТ_СписаниеМатериалов КАК ВТ_СписаниеМатериалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат.Счет КАК Счет,
		|			ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат.СтатьяЗатрат КАК СтатьяЗатрат
		|		ИЗ
		|			РегистрСведений.ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат КАК ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат) КАК ВЗ_ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат
		|		ПО ВТ_СписаниеМатериалов.Счет = ВЗ_ЮЦАУ_СоответствияСчетовУчетаНоменклатурыИСтатейЗатрат.Счет
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение КАК Подразделение,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат
		|		ИЗ
		|			РегистрСведений.ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТ.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних) КАК ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних
		|		ПО ВТ_СписаниеМатериалов.ПодразделениеЗатрат = ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	ПодразделениеЗатрат,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	тзСписаниеМатериалов = ТаблицаСписаниеМатериалов.Выгрузить();
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("тзСписаниеМатериалов", тзСписаниеМатериалов);
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(Объект.ДатаПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСписаниеМатериалов.Загрузить(РезультатЗапроса.Выгрузить());   
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСписанияМатериаловНаСервере()
	
	СтатьяЗатратСтоимостьЗапчастей = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СтатьяЗатратСтоимостьЗапчастей", Объект.Организация, Объект.ДатаПериода);

	//Обработка подразделения "Автобусная колонна (пассажирские перевозки)"
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСписанияМатериалов(ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	тзСписаниеМатериалов = ТаблицаСписаниеМатериалов.Выгрузить();
	Запрос.УстановитьПараметр("тзСписаниеМатериалов", тзСписаниеМатериалов);
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	
		
		ВыборкаПоСчетуЗатрат = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоСчетуЗатрат.Следующий() Цикл 
		
			ВыборкаПоПодразделениюЗатрат = ВыборкаПоСчетуЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаПоПодразделениюЗатрат.Следующий() Цикл 
		
				ВыборкаПоТранспортномуСредству = ВыборкаПоПодразделениюЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				Пока ВыборкаПоТранспортномуСредству.Следующий() Цикл 

					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Организация", Объект.Организация);
					СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
					СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
					СтруктураПараметров.Вставить("СчетЗатрат", ВыборкаПоСчетуЗатрат.СчетЗатрат);
					СтруктураПараметров.Вставить("СтатьяЗатрат", СтатьяЗатратСтоимостьЗапчастей);
					СтруктураПараметров.Вставить("ПодразделениеЗатрат", ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
					СтруктураПараметров.Вставить("ТранспортноеСредство", ВыборкаПоТранспортномуСредству.ТранспортноеСредство);
					СтруктураПараметров.Вставить("Комментарий", "#Списание материалов " + ВыборкаПоТранспортномуСредству.ТранспортноеСредство);
					СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Ложь);

					ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров);	

					Если ДокументТребованиеНакладная.Проведен Тогда //Проведенные документы не перезаписываются!
						Продолжить;
					КонецЕсли;

					ДокументТребованиеНакладная.Материалы.Очистить();
					
					ВыборкаПоНоменклатуре = ВыборкаПоТранспортномуСредству.Выбрать(); 
					Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
					
						НоваяСтрока = ДокументТребованиеНакладная.Материалы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре); 
						НоваяСтрока.Количество = ВыборкаПоНоменклатуре.Количество;
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
						НоваяСтрока.Коэффициент = 1;
						НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
						НоваяСтрока.Субконто1 = СтатьяЗатратСтоимостьЗапчастей; 
						НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
						
					КонецЦикла; 

					ДокументТребованиеНакладная.Записать(РежимЗаписиДокумента.Запись);

					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Записан документ: " + ДокументТребованиеНакладная;
					Сообщение.Сообщить();
					
				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 

	КонецЦикла; 
	
	//Обработка остальных категорий
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСписанияМатериалов();
	
	тзСписаниеМатериалов = ТаблицаСписаниеМатериалов.Выгрузить();
	Запрос.УстановитьПараметр("тзСписаниеМатериалов", тзСписаниеМатериалов);
	Запрос.УстановитьПараметр("ПодразделениеЗатрат", ПодразделениеАвтоколоннаПассажирскиеПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 

	ВыборкаПоСкладу = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоСкладу.Следующий() Цикл 

		Если Не ЗначениеЗаполнено(ВыборкаПоСкладу.Склад) Тогда
			Продолжить;
		КонецЕсли;	
		
		ВыборкаПоСчетуЗатрат = ВыборкаПоСкладу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоСчетуЗатрат.Следующий() Цикл 
		
			ВыборкаПоПодразделениюЗатрат = ВыборкаПоСчетуЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаПоПодразделениюЗатрат.Следующий() Цикл 

				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Организация", Объект.Организация);
				СтруктураПараметров.Вставить("ДатаПериода", Объект.ДатаПериода);
				СтруктураПараметров.Вставить("Склад", ВыборкаПоСкладу.Склад);
				СтруктураПараметров.Вставить("СчетЗатрат", ВыборкаПоСчетуЗатрат.СчетЗатрат);
				СтруктураПараметров.Вставить("СтатьяЗатрат", СтатьяЗатратСтоимостьЗапчастей);
				СтруктураПараметров.Вставить("ПодразделениеЗатрат", ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
				СтруктураПараметров.Вставить("ТранспортноеСредство", Неопределено);
				СтруктураПараметров.Вставить("Комментарий", "#Списание материалов " + ВыборкаПоПодразделениюЗатрат.ПодразделениеЗатрат);
				СтруктураПараметров.Вставить("СчетаУчетаЗатратВТаблице", Ложь);

				ДокументТребованиеНакладная = ПолучитьДокументТребованиеНакладная(СтруктураПараметров);

				Если ДокументТребованиеНакладная.Проведен Тогда //Проведенные документы не перезаписываются!
					Продолжить;
				КонецЕсли;
				
				ДокументТребованиеНакладная.Материалы.Очистить();
		
				ВыборкаПоНоменклатуре = ВыборкаПоПодразделениюЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
					
					НоваяСтрока = ДокументТребованиеНакладная.Материалы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре); 
					НоваяСтрока.Количество = ВыборкаПоНоменклатуре.Количество;
					НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент = 1;
					НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
					НоваяСтрока.Субконто1 = СтатьяЗатратСтоимостьЗапчастей; 
					НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
						
				КонецЦикла; 
		
				ДокументТребованиеНакладная.Записать(РежимЗаписиДокумента.Запись);
		
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ: " + ДокументТребованиеНакладная;
				Сообщение.Сообщить();
				
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыСписаниеМатериалов(Команда)

	СуществуютДокументыВПериоде = СуществуютДокументыСписанияМатериаловВПериоде("#Списание материалов");
	
	Если СуществуютДокументыВПериоде Тогда
		
		ТекстВопроса = НСтр("ru = 'Существующие документы будут перезаполнены. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередФормированиемДокументовСписаниеМатериаловЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Формирование документов'"));
	
	Иначе	
		СоздатьДокументыСписанияМатериаловНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаСписанияМатериалов(ПодразделениеЗатрат=Неопределено)

	Если ПодразделениеЗатрат = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки") Тогда 
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	тзСписаниеМатериалов.Склад КАК Склад,
		|	тзСписаниеМатериалов.ТранспортноеСредство КАК ТранспортноеСредство,
		|	тзСписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзСписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	тзСписаниеМатериалов.СчетЗатрат КАК СчетЗатрат,
		|	тзСписаниеМатериалов.Счет КАК Счет,
		|	тзСписаниеМатериалов.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_СписаниеМатериалов
		|ИЗ
		|	&тзСписаниеМатериалов КАК тзСписаниеМатериалов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписаниеМатериалов.Склад КАК Склад,
		|	ВТ_СписаниеМатериалов.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_СписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	ВТ_СписаниеМатериалов.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_СписаниеМатериалов.Счет КАК Счет,
		|	СУММА(ВТ_СписаниеМатериалов.Количество) КАК Количество
		|ИЗ
		|	ВТ_СписаниеМатериалов КАК ВТ_СписаниеМатериалов
		|ГДЕ
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат = &ПодразделениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписаниеМатериалов.Счет,
		|	ВТ_СписаниеМатериалов.СчетЗатрат,
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат,
		|	ВТ_СписаниеМатериалов.ТранспортноеСредство,
		|	ВТ_СписаниеМатериалов.Номенклатура,
		|	ВТ_СписаниеМатериалов.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	СчетЗатрат,
		|	ПодразделениеЗатрат,
		|	ТранспортноеСредство
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	ОБЩИЕ,
		|	Склад,
		|	СчетЗатрат,
		|	ПодразделениеЗатрат,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Иначе
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	тзСписаниеМатериалов.Склад КАК Склад,
		|	тзСписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзСписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	тзСписаниеМатериалов.СчетЗатрат КАК СчетЗатрат,
		|	тзСписаниеМатериалов.Счет КАК Счет,
		|	тзСписаниеМатериалов.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_СписаниеМатериалов
		|ИЗ
		|	&тзСписаниеМатериалов КАК тзСписаниеМатериалов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписаниеМатериалов.Склад КАК Склад,
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_СписаниеМатериалов.Номенклатура КАК Номенклатура,
		|	ВТ_СписаниеМатериалов.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_СписаниеМатериалов.Счет КАК Счет,
		|	СУММА(ВТ_СписаниеМатериалов.Количество) КАК Количество
		|ИЗ
		|	ВТ_СписаниеМатериалов КАК ВТ_СписаниеМатериалов
		|ГДЕ
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат <> &ПодразделениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписаниеМатериалов.Счет,
		|	ВТ_СписаниеМатериалов.СчетЗатрат,
		|	ВТ_СписаниеМатериалов.ПодразделениеЗатрат,
		|	ВТ_СписаниеМатериалов.Номенклатура,
		|	ВТ_СписаниеМатериалов.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	ОБЩИЕ,
		|	Склад,
		|	СчетЗатрат,
		|	ПодразделениеЗатрат
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;	
	
КонецФункции		

&НаКлиенте
Процедура ВопросПередФормированиемДокументовСписаниеМатериаловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьДокументыСписанияМатериаловНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуАналоговНоменклатурыНаСервере()
	
	ТаблицаАналогиНоменклатуры.Очистить();   
	
	//Топливо
	тзАналогиНоменклатуры = ТаблицаПотреблениеТоплива.Выгрузить(,"Склад, Номенклатура");  
	
	//Тех. жидкости
	Для Каждого ТекСтрока Из ТаблицаПотреблениеТехническихЖидкостей Цикл
		НоваяСтрока = тзАналогиНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;	
	
	тзАналогиНоменклатуры.Свернуть("Склад, Номенклатура",);
	
	ТаблицаАналогиНоменклатуры.Загрузить(тзАналогиНоменклатуры);  
	ТаблицаАналогиНоменклатуры.Сортировать("Склад, Номенклатура");
	
	Для Каждого ТекСтрока Из ТаблицаАналогиНоменклатуры Цикл
		ТекСтрока.АналогНоменклатуры = ТекСтрока.Номенклатура; 
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуАналоговНоменклатуры(Команда)
	ЗаполнитьТаблицуАналоговНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДесериализоватьJSON_ПотреблениеТехническихЖидкостей(СтрокаJSON)
	
	СоздаватьОбъекты = Истина;
	
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Период");
	МассивПолейДат.Добавить("ДатаПериода");
	МассивПолейДат.Добавить("ФизлицоДатаРождения");
	СписокСтрок = ДесериализоватьJSON(СтрокаJSON, МассивПолейДат);	
	
	ТаблицаПотреблениеТехническихЖидкостей.Очистить();

	Для Каждого СтруктураСтроки Из СписокСтрок.ДанныеПотреблениеТехническихЖидкостей Цикл
		
		Склад = Неопределено;
		ТранспортноеСредство = Неопределено;
		Номенклатура = Неопределено;
		Подразделение = Неопределено;

		Если СтруктураСтроки.Свойство("Склад") Тогда
			Склад = ПолучитьСклад(СтруктураСтроки.Склад);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("ТранспортноеСредство") Тогда
			ТранспортноеСредство = ПолучитьТранспортноеСредство(СтруктураСтроки.ТранспортноеСредство);
		КонецЕсли;	
		
		Если СтруктураСтроки.Свойство("Номенклатура") Тогда                                 
			Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("Подразделение") Тогда                                 
			Подразделение = ПолучитьПодразделение(СтруктураСтроки.Подразделение);
		КонецЕсли;	

		НоваяСтрока = ТаблицаПотреблениеТехническихЖидкостей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		НоваяСтрока.Склад = Склад;
		НоваяСтрока.ТранспортноеСредство = ТранспортноеСредство;
		НоваяСтрока.ПодразделениеЗатрат = Подразделение;
		НоваяСтрока.Номенклатура = Номенклатура;    
			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзАналогиНоменклатуры.Склад КАК Склад,
		|	тзАналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	тзАналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|ПОМЕСТИТЬ ВТ_АналогиНоменклатуры
		|ИЗ
		|	&тзАналогиНоменклатуры КАК тзАналогиНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзПотреблениеТехническихЖидкостей.Склад КАК Склад,
		|	тзПотреблениеТехническихЖидкостей.ТранспортноеСредство КАК ТранспортноеСредство,
		|	тзПотреблениеТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	тзПотреблениеТехническихЖидкостей.Номенклатура КАК Номенклатура,
		|	тзПотреблениеТехническихЖидкостей.РасходПоФакту КАК РасходПоФакту
		|ПОМЕСТИТЬ ВТ_ПотреблениеТехническихЖидкостей
		|ИЗ
		|	&тзПотреблениеТехническихЖидкостей КАК тзПотреблениеТехническихЖидкостей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТехническихЖидкостей.Склад КАК Склад,
		|	ВТ_ПотреблениеТехническихЖидкостей.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ПотреблениеТехническихЖидкостей.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТехническихЖидкостей.Номенклатура КАК Номенклатура,
		|	ВТ_ПотреблениеТехническихЖидкостей.РасходПоФакту КАК РасходПоФакту,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|	ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетУчетаГСМ КАК СчетУчетаГСМ
		|ПОМЕСТИТЬ ВТ_ПотреблениеТехническихЖидкостейИтог
		|ИЗ
		|	ВТ_ПотреблениеТехническихЖидкостей КАК ВТ_ПотреблениеТехническихЖидкостей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение КАК Подразделение,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СкладТехническиеЖидкости КАК СкладТехническиеЖидкости,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетЗатрат КАК СчетЗатрат,
		|			ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.СчетУчетаГСМ КАК СчетУчетаГСМ
		|		ИЗ
		|			РегистрСведений.ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТ.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних) КАК ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних
		|		ПО ВТ_ПотреблениеТехническихЖидкостей.ПодразделениеЗатрат = ВЗ_ЮЦАУ_НастройкаЗагрузкиСписанияГСМиТМЦизУАТСрезПоследних.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.Склад КАК Склад,
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.РасходПоФакту КАК РасходПоФакту,
		|	ВТ_ПотреблениеТехническихЖидкостейИтог.СчетУчетаГСМ КАК СчетУчетаГСМ,
		|	ЕСТЬNULL(ВЗ_АналогиНоменклатуры.АналогНоменклатуры, ВТ_ПотреблениеТехническихЖидкостейИтог.Номенклатура) КАК Номенклатура
		|ИЗ
		|	ВТ_ПотреблениеТехническихЖидкостейИтог КАК ВТ_ПотреблениеТехническихЖидкостейИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_АналогиНоменклатуры.Склад КАК Склад,
		|			ВТ_АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|			ВТ_АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры
		|		ИЗ
		|			ВТ_АналогиНоменклатуры КАК ВТ_АналогиНоменклатуры) КАК ВЗ_АналогиНоменклатуры
		|		ПО ВТ_ПотреблениеТехническихЖидкостейИтог.Склад = ВЗ_АналогиНоменклатуры.Склад
		|			И ВТ_ПотреблениеТехническихЖидкостейИтог.Номенклатура = ВЗ_АналогиНоменклатуры.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	ПодразделениеЗатрат,
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	тзПотреблениеТехническихЖидкостей = ТаблицаПотреблениеТехническихЖидкостей.Выгрузить();
	тзАналогиНоменклатуры = ТаблицаАналогиНоменклатуры.Выгрузить();
	
	Запрос.УстановитьПараметр("тзПотреблениеТехническихЖидкостей", тзПотреблениеТехническихЖидкостей);
	Запрос.УстановитьПараметр("тзАналогиНоменклатуры", тзАналогиНоменклатуры);
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(Объект.ДатаПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ТаблицаПотреблениеТехническихЖидкостей.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПотреблениеТехническихЖидкостейНаСервере()

	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация);

	Если ПараметрыПодключения = Неопределено Тогда
		Сообщить("Не определены параметры подключения к УАТ!");
		Возврат;
	КонецЕсли;	
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
		Сообщить("Не удалось подключиться по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ДатаНачала = НачалоМесяца(Объект.ДатаПериода);
	ДатаКонца = КонецМесяца(Объект.ДатаПериода);
	РесурсНаСервере = "/UAT/hs/api_uat/TechFluidsConsumption?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д");
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
			
	//Получаем ответный текст или текст ошибки  
	Если HTTPОтвет.КодСостояния = 401 Тогда
		Сообщить("Не удалось авторизоваться в программе УАТ. Неверный логин или пароль. HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		Сообщить("HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	Иначе	

		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ПолучитьСтруктуруИзJSON(СтрокаJSON);
		ДесериализоватьJSON_ПотреблениеТехническихЖидкостей(СтрокаJSON);  

	КонецЕсли;		
	
	ЭтаФорма.Модифицированность = Истина;        
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотреблениеТехническихЖидкостей(Команда)
	ЗагрузитьПотреблениеТехническихЖидкостейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередФормированиемДокументовПотребленияТехническихЖидкостейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьДокументыПотребленияТехническихЖидкостейНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПотребленияТехническихЖидкостейНаСервере()   
	СоздатьДокументыПотребленияТопливаИТехническихЖидкостейНаСервере(ТаблицаПотреблениеТехническихЖидкостей.Выгрузить(), "#Потребление тех. жидкостей");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПотребленияТехническихЖидкостей(Команда)

	СуществуютДокументыВПериоде = СуществуютДокументыПотребленияТопливаИТехническихЖидкостейВПериоде("#Потребление тех. жидкостей");
	
	Если СуществуютДокументыВПериоде Тогда
		
		ТекстВопроса = НСтр("ru = 'Существующие документы будут перезаполнены. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередФормированиемДокументовПотребленияТехническихЖидкостейЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Формирование документов'"));
	
	Иначе	
		СоздатьДокументыПотребленияТехническихЖидкостейНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДесериализоватьJSON_ДокументыТМЦУАТ(СтрокаJSON)
	
	СоздаватьОбъекты = Истина;
	
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Период");
	МассивПолейДат.Добавить("ДатаПериода");
	СписокСтрок = ДесериализоватьJSON(СтрокаJSON, МассивПолейДат);	
	
	ТаблицаДокументыТМЦУАТ.Очистить();

	Для Каждого СтруктураСтроки Из СписокСтрок.ДанныеТаблицаДокументовУАТ Цикл
		
		НоваяСтрока = ТаблицаДокументыТМЦУАТ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыТМЦУАТНаСервере()

	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация); 
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
		Сообщить("Не удалось подключиться по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ДатаНачала = НачалоМесяца(Объект.ДатаПериода);
	ДатаКонца = КонецМесяца(Объект.ДатаПериода);
	//http://localhost/UAT/hs/api_uat/ItemsWriteOff?StartDate=01.04.2023&EndDate=30.04.2023
	//АдресРесурса = "/UAT/hs/api_uat/ItemsWriteOff?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д");
	//АдресРесурса = СокрЛП(Объект.КорневойURL) + "/StorageDocuments?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д") +
	//				"&GUID=" + Объект.Организация.УникальныйИдентификатор() + "&INN=" + Объект.Организация.ИНН + "&KPP=" + Объект.Организация.КПП;
	
	КорневойURL = "/UAT/hs/api_uat";
	АдресРесурса = СокрЛП(КорневойURL) + "/StorageDocuments?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д") +
					"&GUID=" + Объект.Организация.УникальныйИдентификатор() + "&INN=" + Объект.Организация.ИНН + "&KPP=" + Объект.Организация.КПП;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
			
	//Получаем ответный текст или текст ошибки  
	Если HTTPОтвет.КодСостояния = 401 Тогда
		Сообщить("Не удалось авторизоваться в программе УАТ. Неверный логин или пароль. HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		Сообщить("HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	Иначе	

		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ПолучитьСтруктуруИзJSON(СтрокаJSON);
		ДесериализоватьJSON_ДокументыТМЦУАТ(СтрокаJSON);  
		ЭтаФорма.Модифицированность = Истина;

	КонецЕсли;		
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДвиженияТМЦНаСервере()
	
	ТаблицаДокументыТМЦ.Очистить();
	
	ЗагрузитьДокументыТМЦУАТНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_СкладыУАТ.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_СкладыУАТ
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СкладыУАТ КАК ЮЦАУ_СкладыУАТ
		|ГДЕ
		|	ЮЦАУ_СкладыУАТ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПоступлениеТоваровУслуг.Ссылка) КАК ГУИД,
		|	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
		|	ПоступлениеТоваровУслуг.Склад КАК Склад,
		|	NULL КАК СкладПолучатель,
		|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации КАК Подразделение
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Склад В
		|			(ВЫБРАТЬ
		|				ВТ_СкладыУАТ.Склад
		|			ИЗ
		|				ВТ_СкладыУАТ КАК ВТ_СкладыУАТ)
		|	И НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, МЕСЯЦ) = &ДатаПериода
		|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОприходованиеТоваров.Ссылка),
		|	ОприходованиеТоваров.Ссылка,
		|	ОприходованиеТоваров.Склад,
		|	NULL,
		|	ОприходованиеТоваров.ПодразделениеОрганизации
		|ИЗ
		|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		|ГДЕ
		|	ОприходованиеТоваров.Организация = &Организация
		|	И ОприходованиеТоваров.Склад В
		|			(ВЫБРАТЬ
		|				ВТ_СкладыУАТ.Склад
		|			ИЗ
		|				ВТ_СкладыУАТ КАК ВТ_СкладыУАТ)
		|	И НАЧАЛОПЕРИОДА(ОприходованиеТоваров.Дата, МЕСЯЦ) = &ДатаПериода
		|	И ОприходованиеТоваров.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АвансовыйОтчетТовары.Ссылка),
		|	АвансовыйОтчетТовары.Ссылка,
		|	АвансовыйОтчетТовары.Ссылка.Склад,
		|	NULL,
		|	АвансовыйОтчетТовары.Ссылка.ПодразделениеОрганизации
		|ИЗ
		|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
		|ГДЕ
		|	АвансовыйОтчетТовары.Ссылка.Организация = &Организация
		|	И АвансовыйОтчетТовары.Ссылка.Склад В
		|			(ВЫБРАТЬ
		|				ВТ_СкладыУАТ.Склад
		|			ИЗ
		|				ВТ_СкладыУАТ КАК ВТ_СкладыУАТ)
		|	И НАЧАЛОПЕРИОДА(АвансовыйОтчетТовары.Ссылка.Дата, МЕСЯЦ) = &ДатаПериода
		|	И АвансовыйОтчетТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	АвансовыйОтчетТовары.Ссылка,
		|	АвансовыйОтчетТовары.Ссылка.Склад,
		|	АвансовыйОтчетТовары.Ссылка.ПодразделениеОрганизации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПеремещениеТоваров.Ссылка),
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.ПодразделениеОтправитель
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	(ПеремещениеТоваров.Организация = &Организация
		|				И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, МЕСЯЦ) = &ДатаПериода
		|				И ПеремещениеТоваров.СкладОтправитель В
		|					(ВЫБРАТЬ
		|						ВТ_СкладыУАТ.Склад
		|					ИЗ
		|						ВТ_СкладыУАТ КАК ВТ_СкладыУАТ)
		|			ИЛИ ПеремещениеТоваров.СкладПолучатель В
		|				(ВЫБРАТЬ
		|					ВТ_СкладыУАТ.Склад
		|				ИЗ
		|					ВТ_СкладыУАТ КАК ВТ_СкладыУАТ))
		|	И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, МЕСЯЦ) = &ДатаПериода
		|	И ПеремещениеТоваров.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентаризацияТоваровНаСкладе.Ссылка),
		|	ИнвентаризацияТоваровНаСкладе.Ссылка,
		|	ИнвентаризацияТоваровНаСкладе.Склад,
		|	NULL,
		|	NULL
		//|	ИнвентаризацияТоваровНаСкладе.ПодразделениеОрганизации
		|ИЗ
		|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
		|ГДЕ
		|	ИнвентаризацияТоваровНаСкладе.Организация = &Организация
		|	И ИнвентаризацияТоваровНаСкладе.Склад В
		|			(ВЫБРАТЬ
		|				ВТ_СкладыУАТ.Склад
		|			ИЗ
		|				ВТ_СкладыУАТ КАК ВТ_СкладыУАТ)
		|	И НАЧАЛОПЕРИОДА(ИнвентаризацияТоваровНаСкладе.Дата, МЕСЯЦ) = &ДатаПериода
		|	И ИнвентаризацияТоваровНаСкладе.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаПериода", НачалоМесяца(Объект.ДатаПериода));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДокументыТМЦ.Загрузить(РезультатЗапроса.Выгрузить());
	
	//Запрос для связи с таблицей ДокументыУАТ по ГУИД
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокументыУАТ.ГУИД КАК ГУИД,
		|	ТаблицаДокументыУАТ.ДокументУАТ КАК ДокументУАТ,
		|	ТаблицаДокументыУАТ.ДокументУАТПроведен КАК ДокументУАТПроведен
		|ПОМЕСТИТЬ ВТ_ДокументыУАТ
		|ИЗ
		|	&ТаблицаДокументыУАТ КАК ТаблицаДокументыУАТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументы.ГУИД КАК ГУИД,
		|	ТаблицаДокументы.Документ КАК Документ,
		|	ТаблицаДокументы.Склад КАК Склад,
		|	ТаблицаДокументы.СкладПолучатель КАК СкладПолучатель,
		|	ТаблицаДокументы.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	&ТаблицаДокументы КАК ТаблицаДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документы.Документ КАК Документ,
		|	ВТ_Документы.Склад КАК Склад,
		|	ВТ_Документы.СкладПолучатель КАК СкладПолучатель,
		|	ВТ_Документы.Подразделение КАК Подразделение,
		|	ВЗ_ДокументыУАТ.ДокументУАТ КАК ДокументУАТ,
		|	ВЗ_ДокументыУАТ.ДокументУАТПроведен КАК ДокументУАТПроведен
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ДокументыУАТ.ГУИД КАК ГУИД,
		|			ВТ_ДокументыУАТ.ДокументУАТ КАК ДокументУАТ,
		|			ВТ_ДокументыУАТ.ДокументУАТПроведен КАК ДокументУАТПроведен
		|		ИЗ
		|			ВТ_ДокументыУАТ КАК ВТ_ДокументыУАТ) КАК ВЗ_ДокументыУАТ
		|		ПО ВТ_Документы.ГУИД = ВЗ_ДокументыУАТ.ГУИД
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументУАТПроведен,
		|	Документ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаДокументыУАТ", ТаблицаДокументыТМЦУАТ.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаДокументы", ТаблицаДокументыТМЦ.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДокументыТМЦ.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуДвиженияТМЦ(Команда)
	ЗаполнитьТаблицуДвиженияТМЦНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДокументыТМЦвУАТНаСервере()
	
	СписокВыгруженныхОбъектов.Очистить();
	
	Сообщение = Новый СообщениеПользователю;

	Если ТаблицаДокументыТМЦ.Количество() = 0 Тогда
	    Сообщение.Текст = "Не заполнена таблица Движения ТМЦ!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация); 
	
	//Получаем строку JSON с данными по сотрудникам
	СтрокаДокументыJSON = ПолучитьJSONСтрокуДокументыТМЦ();
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
	    Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		HTTPСоединение = Неопределено;
		Возврат;
	КонецПопытки;
	
	//АдресРесурса = "/UAT/hs/api_uat/Employee/"; 
	
	КорневойURL = "/UAT/hs/api_uat";
	АдресРесурса = КорневойURL + "/StorageDocuments/";
	Заголовки = Новый Соответствие;
	
	//Отвечает за тип данных, которые будут установлены в тело запроса
	Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	//Устанавливаем тело запроса
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДокументыJSON);
	
	Попытка
	    //Отправляем данные на сервер
	    HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Исключение
	    Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;	
	
	ЗаполнитьТаблицуДвиженияТМЦНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументыТМЦвУАТ(Команда)

	ТекущийДокумент = Элементы.ТаблицаДокументыТМЦ.ТекущиеДанные.Документ;

	ВыгрузитьДокументыТМЦвУАТНаСервере();

	//Позиционирование на текущий документ
	МассивСтрок = ТаблицаДокументыТМЦ.НайтиСтроки(Новый Структура("Документ", ТекущийДокумент));
	Если МассивСтрок.Количество() > 0 Тогда
    	 Элементы.ТаблицаДокументыТМЦ.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьJSONСтрокуДокументыТМЦ()
	
	МассивДокументыТМЦ = Новый Массив;
	Для Каждого ТекСтрока Из ТаблицаДокументыТМЦ Цикл

		Если ТекСтрока.Пометка Тогда
			СтруктураДокументТМЦ = ПолучитьСтруктуруДокументТМЦ(ТекСтрока.Документ);		
			МассивДокументыТМЦ.Добавить(СтруктураДокументТМЦ);  
		КонецЕсли;	
		
	КонецЦикла;

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	
	ЗаписатьJSON(ЗаписьJSON, МассивДокументыТМЦ, НастройкиСериализации, "ФункцияПреобразованияЗаписи", ЭтотОбъект);
	
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	Возврат СериализованнаяСтрока;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруПоступлениеТоваровУслуг(СтруктураДокумента, ТекущийДокумент)

	СтруктураДокумента.Вставить("ТипДокумента", "ПоступлениеТоваровУслуг");   
	СтруктураДокумента.Вставить("ВидОперации", Строка(ТекущийДокумент.ВидОперации));
	
	СтруктураДокумента.Вставить("ВалютаДокумента", ПолучитьСтруктуруВалюта(ТекущийДокумент.ВалютаДокумента));
	СтруктураДокумента.Вставить("НомерВходящегоДокумента", ТекущийДокумент.НомерВходящегоДокумента);
	СтруктураДокумента.Вставить("ДатаВходящегоДокумента", ТекущийДокумент.ДатаВходящегоДокумента);
	
	СтруктураДокумента.Вставить("Склад", ПолучитьСтруктуруСклад(ТекущийДокумент.Склад));
	СтруктураДокумента.Вставить("Подразделение", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеОрганизации));
	СтруктураДокумента.Вставить("Контрагент", ПолучитьСтруктуруКонтрагент(ТекущийДокумент.Контрагент));
	СтруктураДокумента.Вставить("ДоговорКонтрагента", ПолучитьСтруктуруДоговорКонтрагента(ТекущийДокумент.ДоговорКонтрагента));
	
	СтруктураДокумента.Вставить("КратностьВзаиморасчетов", ТекущийДокумент.КратностьВзаиморасчетов);
	СтруктураДокумента.Вставить("КурсВзаиморасчетов", ТекущийДокумент.КурсВзаиморасчетов);
	СтруктураДокумента.Вставить("СуммаВключаетНДС", ТекущийДокумент.СуммаВключаетНДС);
	СтруктураДокумента.Вставить("СуммаДокумента", ТекущийДокумент.СуммаДокумента);
	
	//Обработка табличных частей
	МассивТовары = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Товары Цикл
		
		СтруктураТовар = Новый Структура;
		
		СтруктураТовар.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура));
		СтруктураТовар.Вставить("ЕдиницаИзмерения", ПолучитьСтруктуруЕдиницаИзмерения(ТекСтрока.ЕдиницаИзмерения));
		СтруктураТовар.Вставить("Количество", ТекСтрока.Количество);
		СтруктураТовар.Вставить("СтавкаНДС", Строка(ТекСтрока.СтавкаНДС));
		СтруктураТовар.Вставить("Сумма", ТекСтрока.Сумма);
		СтруктураТовар.Вставить("СуммаНДС", ТекСтрока.СуммаНДС);
		СтруктураТовар.Вставить("Цена", ТекСтрока.Цена);

		МассивТовары.Добавить(СтруктураТовар);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивТовары", МассивТовары);
	
	МассивУслуги = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Услуги Цикл
		
		СтруктураУслуга = Новый Структура;
		
		СтруктураУслуга.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура));
		СтруктураУслуга.Вставить("Содержание", ТекСтрока.Содержание);
		СтруктураУслуга.Вставить("Количество", ТекСтрока.Количество);
		СтруктураУслуга.Вставить("СтавкаНДС", Строка(ТекСтрока.СтавкаНДС));
		СтруктураУслуга.Вставить("Сумма", ТекСтрока.Сумма);
		СтруктураУслуга.Вставить("СуммаНДС", ТекСтрока.СуммаНДС);
		СтруктураУслуга.Вставить("Цена", ТекСтрока.Цена);

		МассивУслуги.Добавить(СтруктураУслуга);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивУслуги", МассивУслуги);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтруктуруИнвентаризацияТоваровНаСкладе(СтруктураДокумента, ТекущийДокумент)
	
	СтруктураДокумента.Вставить("ТипДокумента", "ИнвентаризацияТоваровНаСкладе");
	СтруктураДокумента.Вставить("Склад", ПолучитьСтруктуруСклад(ТекущийДокумент.Склад));
//	СтруктураДокумента.Вставить("Подразделение", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеОрганизации)); //Реквизит появляется в версии корп.

	СтруктураДокумента.Вставить("ДокументОснованиеВид", ТекущийДокумент.ДокументОснованиеВид);
	СтруктураДокумента.Вставить("ДокументОснованиеНомер", ТекущийДокумент.ДокументОснованиеНомер);
	СтруктураДокумента.Вставить("ДокументОснованиеДата", ТекущийДокумент.ДокументОснованиеДата);
	СтруктураДокумента.Вставить("ПричинаПроведенияИнвентаризации", ТекущийДокумент.ПричинаПроведенияИнвентаризации);
	СтруктураДокумента.Вставить("ДатаНачалаИнвентаризации", ТекущийДокумент.ДатаНачалаИнвентаризации);
	СтруктураДокумента.Вставить("ДатаОкончанияИнвентаризации", ТекущийДокумент.ДатаОкончанияИнвентаризации);

	//Обработка табличных частей
	МассивТовары = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Товары Цикл
		
		СтруктураТовар = Новый Структура;
		
		СтруктураТовар.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура));
		СтруктураТовар.Вставить("Количество", ТекСтрока.Количество);
		СтруктураТовар.Вставить("КоличествоУчет", ТекСтрока.КоличествоУчет);
		СтруктураТовар.Вставить("Цена", ТекСтрока.Цена);
		СтруктураТовар.Вставить("ЦенаВРознице", ТекСтрока.ЦенаВРознице);
		СтруктураТовар.Вставить("Сумма", ТекСтрока.Сумма);
		СтруктураТовар.Вставить("СуммаУчет", ТекСтрока.СуммаУчет);
		
		МассивТовары.Добавить(СтруктураТовар);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивТовары", МассивТовары);
	
КонецПроцедуры		

&НаСервере
Процедура ЗаполнитьСтруктуруОприходованиеТоваров(СтруктураДокумента, ТекущийДокумент)

	СтруктураДокумента.Вставить("ТипДокумента", "ОприходованиеТоваров");
	СтруктураДокумента.Вставить("Склад", ПолучитьСтруктуруСклад(ТекущийДокумент.Склад));
	СтруктураДокумента.Вставить("Подразделение", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеОрганизации));
	СтруктураДокумента.Вставить("СуммаДокумента", ТекущийДокумент.СуммаДокумента);
	СтруктураДокумента.Вставить("Основание", ТекущийДокумент.Основание);
	
	//Обработка табличных частей
	МассивТовары = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Товары Цикл
		
		СтруктураТовар = Новый Структура;
		
		СтруктураТовар.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура));
		СтруктураТовар.Вставить("Количество", ТекСтрока.Количество);
		СтруктураТовар.Вставить("Цена", ТекСтрока.Цена);
		СтруктураТовар.Вставить("Сумма", ТекСтрока.Сумма);

		МассивТовары.Добавить(СтруктураТовар);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивТовары", МассивТовары);

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтруктуруАвансовыйОтчет(СтруктураДокумента, ТекущийДокумент)
	
	//В УАТ этот документ будет отражаться документом "Оприходование товаров", поэтому выгружаются только необходимые реквизиты
	СтруктураДокумента.Вставить("ТипДокумента", "АвансовыйОтчет");
	СтруктураДокумента.Вставить("Склад", ПолучитьСтруктуруСклад(ТекущийДокумент.Склад));
	СтруктураДокумента.Вставить("Подразделение", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеОрганизации));
	СтруктураДокумента.Вставить("СуммаДокумента", ТекущийДокумент.СуммаДокумента);
	СтруктураДокумента.Вставить("Основание", "#АвансовыйОтчет");
	
	//Обработка табличных частей
	МассивТовары = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Товары Цикл
		
		СтруктураТовар = Новый Структура;
		
		СтруктураТовар.Вставить("ВидДокВходящий", ТекСтрока.ВидДокВходящий);
		СтруктураТовар.Вставить("НомерВходящегоДокумента", ТекСтрока.НомерВходящегоДокумента);
		СтруктураТовар.Вставить("ДатаВходящегоДокумента", ТекСтрока.ДатаВходящегоДокумента);
	
		СтруктураТовар.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура));
		СтруктураТовар.Вставить("Количество", ТекСтрока.Количество);
		СтруктураТовар.Вставить("Цена", ТекСтрока.Цена);
		СтруктураТовар.Вставить("Сумма", ТекСтрока.Сумма);

		МассивТовары.Добавить(СтруктураТовар);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивТовары", МассивТовары);
	
КонецПроцедуры		

&НаСервере
Процедура ЗаполнитьСтруктуруПеремещениеТоваров(СтруктураДокумента, ТекущийДокумент)

	СтруктураДокумента.Вставить("ТипДокумента", "ПеремещениеТоваров");                   
	СтруктураДокумента.Вставить("ВидОперации", Строка(ТекущийДокумент.ВидОперации));
	СтруктураДокумента.Вставить("СкладОтправитель", ПолучитьСтруктуруСклад(ТекущийДокумент.СкладОтправитель));
	СтруктураДокумента.Вставить("ПодразделениеОтправитель", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеОтправитель));
	СтруктураДокумента.Вставить("СкладПолучатель", ПолучитьСтруктуруСклад(ТекущийДокумент.СкладПолучатель));
	СтруктураДокумента.Вставить("ПодразделениеПолучатель", ПолучитьСтруктуруПодразделение(ТекущийДокумент.ПодразделениеПолучатель));

	//Обработка табличных частей
	МассивТовары = Новый Массив;
	Для Каждого ТекСтрока Из ТекущийДокумент.Товары Цикл
		
		СтруктураТовар = Новый Структура;
		
		СтруктураТовар.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ТекСтрока.Номенклатура)); 
		СтруктураТовар.Вставить("ЕдиницаИзмерения", ПолучитьСтруктуруЕдиницаИзмерения(ТекСтрока.ЕдиницаИзмерения));
		СтруктураТовар.Вставить("Количество", ТекСтрока.Количество);
		
		МассивТовары.Добавить(СтруктураТовар);
		
	КонецЦикла;		
	
	СтруктураДокумента.Вставить("МассивТовары", МассивТовары);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтруктуруДокументТМЦ(ТекущийДокумент)
	
	СтруктураДокумента = Новый Структура;

	СтруктураДокумента.Вставить("Идентификатор", ТекущийДокумент.УникальныйИдентификатор());
	СтруктураДокумента.Вставить("Номер", ТекущийДокумент.Номер);
	СтруктураДокумента.Вставить("Дата", ТекущийДокумент.Дата);
	СтруктураДокумента.Вставить("Комментарий", ТекущийДокумент.Комментарий);
	СтруктураДокумента.Вставить("Организация", ПолучитьСтруктуруОрганизация(ТекущийДокумент.Организация));
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		ЗаполнитьСтруктуруПоступлениеТоваровУслуг(СтруктураДокумента, ТекущийДокумент);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ЗаполнитьСтруктуруПеремещениеТоваров(СтруктураДокумента, ТекущийДокумент);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		
		ЗаполнитьСтруктуруИнвентаризацияТоваровНаСкладе(СтруктураДокумента, ТекущийДокумент);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		ЗаполнитьСтруктуруАвансовыйОтчет(СтруктураДокумента, ТекущийДокумент);

	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		
		ЗаполнитьСтруктуруОприходованиеТоваров(СтруктураДокумента, ТекущийДокумент);

	КонецЕсли;	
		
	Возврат СтруктураДокумента;
	
КонецФункции

Функция ПолучитьСтруктуруЕдиницаИзмерения(ЕдиницаИзмерения)
	
	ГУИД = ЕдиницаИзмерения.УникальныйИдентификатор();
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.КлассификаторЕдиницИзмерения");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	
	СтруктураОбъекта.Вставить("Код", ЕдиницаИзмерения.Код);
	СтруктураОбъекта.Вставить("Наименование", ЕдиницаИзмерения.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", ЕдиницаИзмерения.ЭтоГруппа);

	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруЕдиницаИзмерения(ЕдиницаИзмерения.Родитель));
	КонецЕсли;	
	
	Если Не ЕдиницаИзмерения.ЭтоГруппа Тогда
		СтруктураОбъекта.Вставить("НаименованиеПолное", ЕдиницаИзмерения.НаименованиеПолное);
	КонецЕсли;	
		
	Возврат СтруктураОбъекта;
	
КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруОрганизация(Организация)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Организации");
	СтруктураОбъекта.Вставить("Идентификатор", Организация.УникальныйИдентификатор());
	
	СтруктураОбъекта.Вставить("Код", Организация.Код);
	СтруктураОбъекта.Вставить("Наименование", Организация.Наименование);
	СтруктураОбъекта.Вставить("ИНН", Организация.ИНН);
	СтруктураОбъекта.Вставить("КПП", Организация.РегистрацияВНалоговомОргане.КПП);
		
	Возврат СтруктураОбъекта;

КонецФункции	      

&НаСервере
Функция ФункцияПреобразованияЗаписи(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт

	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
        Возврат Строка(Значение);
	Иначе
		Сообщить(ТипЗнч(Значение));
    КонецЕсли;

	Отказ = Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСклад(Склад)
	
	ГУИД = Склад.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Склады");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", Склад.Код);
	СтруктураОбъекта.Вставить("Наименование", Склад.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Склад.ЭтоГруппа);

	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Склад.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруСклад(Склад.Родитель));
	КонецЕсли;	
	
	Если Не Склад.ЭтоГруппа Тогда
		СтруктураОбъекта.Вставить("Комментарий", Склад.Комментарий);
		СтруктураОбъекта.Вставить("ТипСклада", Строка(Склад.ТипСклада));
	КонецЕсли;	
	
	Возврат СтруктураОбъекта;

КонецФункции
	
&НаСервере
Функция ПолучитьСтруктуруПодразделение(Подразделение)

	ГУИД = Подразделение.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ПодразделенияОрганизаций");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Владелец", ПолучитьСтруктуруОрганизация(Подразделение.Владелец));
	СтруктураОбъекта.Вставить("Код", Подразделение.Код);
	СтруктураОбъекта.Вставить("Наименование", Подразделение.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Подразделение.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруПодразделение(Подразделение.Родитель));
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Подразделение.РегистрацияВНалоговомОргане) Тогда
		СтруктураОбъекта.Вставить("КПП", Подразделение.РегистрацияВНалоговомОргане.КПП);
		СтруктураОбъекта.Вставить("КодПоОКАТО", Подразделение.РегистрацияВНалоговомОргане.КодПоОКАТО);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ПроверитьЧтоОбъектУжеВыгружен(ГУИД)
	
	ЭлементСписка = СписокВыгруженныхОбъектов.НайтиПоЗначению(ГУИД);
	Если ЭлементСписка = Неопределено Тогда 
		СписокВыгруженныхОбъектов.Добавить(ГУИД); 
		Возврат Ложь;
	Иначе	
		Возврат Истина;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруКонтрагент(Контрагент)

	ГУИД = Контрагент.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Контрагенты");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", Контрагент.Код);
	СтруктураОбъекта.Вставить("Наименование", Контрагент.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Контрагент.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Контрагент.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруКонтрагент(Контрагент.Родитель));
	КонецЕсли;	 
	
	Если Не Контрагент.ЭтоГруппа Тогда
		
		СтруктураОбъекта.Вставить("НаименованиеПолное", Контрагент.НаименованиеПолное);
		СтруктураОбъекта.Вставить("Комментарий", Контрагент.Комментарий);
		СтруктураОбъекта.Вставить("ИНН", Контрагент.ИНН);
		СтруктураОбъекта.Вставить("КПП", Контрагент.КПП);
		СтруктураОбъекта.Вставить("КодПоОКПО", Контрагент.КодПоОКПО);
		СтруктураОбъекта.Вставить("ДополнительноеОписание", Контрагент.ДополнительнаяИнформация);
		СтруктураОбъекта.Вставить("ЮридическоеФизическоеЛицо", Строка(Контрагент.ЮридическоеФизическоеЛицо));
		СтруктураОбъекта.Вставить("НалоговыйНомер", Строка(Контрагент.НалоговыйНомер));
		СтруктураОбъекта.Вставить("СтранаРегистрации", ПолучитьСтруктуруСтранаМира(Контрагент.СтранаРегистрации));

		СтруктураОбъекта.Вставить("ГоловнойКонтрагент", ПолучитьСтруктуруКонтрагент(Контрагент.ГоловнойКонтрагент));
		
	КонецЕсли;
	
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтранаМира(СтранаМира)
	
	ГУИД = СтранаМира.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.СтраныМира");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", СтранаМира.Код);
	СтруктураОбъекта.Вставить("Наименование", СтранаМира.Наименование);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	СтруктураОбъекта.Вставить("НаименованиеПолное", СтранаМира.НаименованиеПолное);
	СтруктураОбъекта.Вставить("КодАльфа2", СтранаМира.КодАльфа2);
	СтруктураОбъекта.Вставить("КодАльфа3", СтранаМира.КодАльфа3);
	СтруктураОбъекта.Вставить("УчастникЕАЭС", СтранаМира.УчастникЕАЭС);
	СтруктураОбъекта.Вставить("МеждународноеНаименование", СтранаМира.МеждународноеНаименование);
	
	Возврат СтруктураОбъекта;

КонецФункции

Функция ПолучитьСтруктуруДоговорКонтрагента(ДоговорКонтрагента)
	
	ГУИД = ДоговорКонтрагента.УникальныйИдентификатор();
	
   	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ДоговорыКонтрагентов");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Владелец", ПолучитьСтруктуруКонтрагент(ДоговорКонтрагента.Владелец));
	СтруктураОбъекта.Вставить("Код", ДоговорКонтрагента.Код);
	СтруктураОбъекта.Вставить("Наименование", ДоговорКонтрагента.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", ДоговорКонтрагента.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруДоговорКонтрагента(ДоговорКонтрагента.Родитель));
	КонецЕсли;	 
	
	Если Не ДоговорКонтрагента.ЭтоГруппа Тогда
		
		СтруктураОбъекта.Вставить("ВалютаВзаиморасчетов", ПолучитьСтруктуруВалюта(ДоговорКонтрагента.ВалютаВзаиморасчетов));
		СтруктураОбъекта.Вставить("ВидВзаиморасчетов", ПолучитьСтруктуруВидВзаиморасчетов(ДоговорКонтрагента.ВидВзаиморасчетов));
		СтруктураОбъекта.Вставить("ВидДоговора", Строка(ДоговорКонтрагента.ВидДоговора));   
		СтруктураОбъекта.Вставить("РасчетыВУсловныхЕдиницах", ДоговорКонтрагента.РасчетыВУсловныхЕдиницах);
		СтруктураОбъекта.Вставить("Комментарий", ДоговорКонтрагента.Комментарий);
		СтруктураОбъекта.Вставить("Дата", ДоговорКонтрагента.Дата);
		СтруктураОбъекта.Вставить("Номер", ДоговорКонтрагента.Номер);
		СтруктураОбъекта.Вставить("Организация", ПолучитьСтруктуруОрганизация(ДоговорКонтрагента.Организация));
		СтруктураОбъекта.Вставить("ТипЦен", ПолучитьСтруктураТипЦен(ДоговорКонтрагента.ТипЦен));
		СтруктураОбъекта.Вставить("Контрагент", ПолучитьСтруктуруКонтрагент(ДоговорКонтрагента.Владелец));
		
	КонецЕсли;
	
	Возврат СтруктураОбъекта;

КонецФункции

Функция ПолучитьСтруктуруВалюта(Валюта)                   
	
	ГУИД = Валюта.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Валюты");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", Валюта.Код);
	СтруктураОбъекта.Вставить("Наименование", Валюта.Наименование);
	СтруктураОбъекта.Вставить("НаименованиеПолное", Валюта.НаименованиеПолное);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	СтруктураОбъекта.Вставить("ЗагружаетсяИзИнтернета", Валюта.ЗагружаетсяИзИнтернета);
	СтруктураОбъекта.Вставить("Наценка", Валюта.Наценка);  
	СтруктураОбъекта.Вставить("ОсновнаяВалюта", ПолучитьСтруктуруВалюта(Валюта.ОсновнаяВалюта));
	СтруктураОбъекта.Вставить("ПараметрыПрописи", Валюта.ПараметрыПрописи);
	СтруктураОбъекта.Вставить("ФормулаРасчетаКурса", Валюта.ФормулаРасчетаКурса);
	СтруктураОбъекта.Вставить("СпособУстановкиКурса", Строка(Валюта.СпособУстановкиКурса));      
	СтруктураОбъекта.Вставить("РеквизитДопУпорядочивания", Валюта.РеквизитДопУпорядочивания);
	
	Возврат СтруктураОбъекта;

КонецФункции	  

Функция ПолучитьСтруктуруВидВзаиморасчетов(ВидВзаиморасчетов)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ВидыВзаиморасчетов");
	СтруктураОбъекта.Вставить("Идентификатор", ВидВзаиморасчетов.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Код", ВидВзаиморасчетов.Код);
	СтруктураОбъекта.Вставить("Наименование", ВидВзаиморасчетов.Наименование);
	
	Возврат СтруктураОбъекта;

КонецФункции	
	
Функция ПолучитьСтруктураТипЦен(ТипЦен)
	
	ГУИД = ТипЦен.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ТипыЦенНоменклатуры");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", ТипЦен.Код);
	СтруктураОбъекта.Вставить("Наименование", ТипЦен.Наименование);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	СтруктураОбъекта.Вставить("СтруктураВалютаЦены", ПолучитьСтруктуруВалюта(ТипЦен.ВалютаЦены));   
	СтруктураОбъекта.Вставить("СтруктураБазовыйТипЦен", ПолучитьСтруктураТипЦен(ТипЦен.БазовыйТипЦен));
	
	//Рассчитывается - нет реквизита             
	СтруктураОбъекта.Вставить("ЦенаВключаетНДС", ТипЦен.ЦенаВключаетНДС); 
	СтруктураОбъекта.Вставить("ПорядокОкругления", Строка(ТипЦен.ПорядокОкругления));    
	СтруктураОбъекта.Вставить("ОкруглятьВБольшуюСторону", ТипЦен.ОкруглятьВБольшуюСторону);
	СтруктураОбъекта.Вставить("Комментарий", ТипЦен.Комментарий);
	
	Возврат СтруктураОбъекта;
	
КонецФункции	

Функция ПолучитьСтруктуруНоменклатура(Номенклатура)
	
	ГУИД = Номенклатура.УникальныйИдентификатор();
	
   	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Номенклатура");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", Номенклатура.Код);
	СтруктураОбъекта.Вставить("Наименование", Номенклатура.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Номенклатура.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Номенклатура.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруНоменклатура(Номенклатура.Родитель));
	КонецЕсли;	 
	
	Если Не Номенклатура.ЭтоГруппа Тогда

		СтруктураОбъекта.Вставить("Артикул", Номенклатура.Артикул);
		СтруктураОбъекта.Вставить("ВидНоменклатуры", ПолучитьСтруктуруВидНоменклатуры(Номенклатура.ВидНоменклатуры));
		СтруктураОбъекта.Вставить("ЕдиницаИзмерения", ПолучитьСтруктуруЕдиницаИзмерения(Номенклатура.ЕдиницаИзмерения));
		//ЕдиницаХраненияОстатков - нет реквизита
		СтруктураОбъекта.Вставить("Комментарий", Номенклатура.Комментарий);
		СтруктураОбъекта.Вставить("НаименованиеПолное", Номенклатура.НаименованиеПолное);
		СтруктураОбъекта.Вставить("НоменклатурнаяГруппа", ПолучитьСтруктуруНоменклатурнаяГруппа(Номенклатура.НоменклатурнаяГруппа));
		СтруктураОбъекта.Вставить("НомерГТД", ПолучитьСтруктуруНомерГТД(Номенклатура.НомерГТД));
		//ОсновнойПоставщик - нет реквизита
		СтруктураОбъекта.Вставить("СтранаПроисхождения", ПолучитьСтруктуруСтранаМира(Номенклатура.СтранаПроисхождения));
		СтруктураОбъекта.Вставить("Услуга", Номенклатура.Услуга);
		
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции	

Функция ПолучитьСтруктуруВидНоменклатуры(ВидНоменклатуры)
	
	ГУИД = ВидНоменклатуры.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ВидыНоменклатуры");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", ВидНоменклатуры.Код);
	СтруктураОбъекта.Вставить("Наименование", ВидНоменклатуры.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", ВидНоменклатуры.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидНоменклатуры.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруВидНоменклатуры(ВидНоменклатуры.Родитель));
	КонецЕсли;	 
	
	Если Не ВидНоменклатуры.ЭтоГруппа Тогда
		СтруктураОбъекта.Вставить("Услуга", ВидНоменклатуры.Услуга);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции	

Функция ПолучитьСтруктуруНоменклатурнаяГруппа(НоменклатурнаяГруппа)
	
	ГУИД = НоменклатурнаяГруппа.УникальныйИдентификатор();
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.НоменклатурныеГруппы");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", НоменклатурнаяГруппа.Код);
	СтруктураОбъекта.Вставить("Наименование", НоменклатурнаяГруппа.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", НоменклатурнаяГруппа.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	

	Если ЗначениеЗаполнено(НоменклатурнаяГруппа.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруНоменклатурнаяГруппа(НоменклатурнаяГруппа.Родитель));
	КонецЕсли;	 
	
	Если Не НоменклатурнаяГруппа.ЭтоГруппа Тогда
		СтруктураОбъекта.Вставить("СпособУчетаНДС", Строка(НоменклатурнаяГруппа.СпособУчетаНДС));
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции	

Функция ПолучитьСтруктуруНомерГТД(НомерГТД)

	ГУИД = НомерГТД.УникальныйИдентификатор();
	
   	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.НомераГТД");
	СтруктураОбъекта.Вставить("Идентификатор", ГУИД);
	СтруктураОбъекта.Вставить("Код", НомерГТД.Код);
	СтруктураОбъекта.Вставить("Наименование", НомерГТД.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", НомерГТД.ЭтоГруппа);
	
	ОбъектУжеВыгружен = ПроверитьЧтоОбъектУжеВыгружен(ГУИД);
	Если ОбъектУжеВыгружен Тогда //Достаточно ссылки, не надо перебирать реквизиты
		Возврат СтруктураОбъекта;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НомерГТД.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруНомерГТД(НомерГТД.Родитель));
	КонецЕсли;	 
	
	Если Не НомерГТД.ЭтоГруппа Тогда
		СтруктураОбъекта.Вставить("Комментарий", НомерГТД.Комментарий);
		СтруктураОбъекта.Вставить("РегистрационныйНомер", НомерГТД.РегистрационныйНомер);
		СтруктураОбъекта.Вставить("СтранаВвозаНеРФ", НомерГТД.СтранаВвозаНеРФ);
		СтруктураОбъекта.Вставить("ЭтоРНПТ", НомерГТД.ЭтоРНПТ);
		СтруктураОбъекта.Вставить("ЭтоНомерТД", НомерГТД.ЭтоНомерТД);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции	
