
Функция СформироватьЗапросПоПодразделениюСч20_01(Подразделение)
	
	Дата = Объект.Дата;
	Организация = Объект.Организация;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
    Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Запрос.УстановитьПараметр("КорСчет",ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто1 КАК НомГруппа,
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт,
	               |	ХозрасчетныйОбороты.СуммаНУОборотДт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты 
				   |ГДЕ
	               |	ХозрасчетныйОбороты.Организация = &Организация
	               |	И ХозрасчетныйОбороты.Счет = &Счет
	               |	И ХозрасчетныйОбороты.КорСчет = &КорСчет
	               |	И ХозрасчетныйОбороты.Подразделение = &Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомГруппа";

  Возврат Запрос;	
	
КонецФункции

Процедура ДатаПриИзменении(Элемент)
	
	Дата = КонецМесяца(Дата);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ПодразделениеДт20 = Объект.ПодразделениеДт20;
	ТабЧастьКоэфф = Объект.ТабЧастьКоэфф;
	Организация = Объект.Организация;
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана организация !");
		Сообщение.Сообщить();
	КонецЕсли;


	Если ПодразделениеДт20 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрано подразделение Дт 20.01 счета!");
		Сообщение.Сообщить();
	КонецЕсли;	
	
	ТабЧастьКоэфф.Очистить();
	ВсегоОборотДт = 0;
	
	Запрос = СформироватьЗапросПоПодразделениюСч20_01(ПодразделениеДт20);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТабЧасти = ТабЧастьКоэфф.Добавить();
		СтрокаТабЧасти.НоменклатурнаяГруппа = Выборка.НомГруппа;
		СтрокаТабЧасти.СуммаОборотДт = Выборка.СуммаОборотДт;
		Если Выборка.СуммаОборотДт>0 Тогда 
			ВсегоОборотДт = ВсегоОборотДт + Выборка.СуммаОборотДт;
		КонецЕсли;
		СтрокаТабЧасти.СуммаОборотДтНУ = Выборка.СуммаНУОборотДт;
	КонецЦикла;
	ТабЧастьКоэфф.Сортировать("НоменклатурнаяГруппа");
	
	Для Каждого	СтрокаТабЧасти Из ТабЧастьКоэфф Цикл
		Коэффициент = СтрокаТабЧасти.СуммаОборотДт/ВсегоОборотДт; 
		СтрокаТабЧасти.Коэффициент = Коэффициент; 
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	
	ТабЧастьКоэфф = Объект.ТабЧастьКоэфф;
	ТабЧастьКоэфф.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры
