#Область ПрограммныйИнтерфейс
	
Функция ДанныеЗаполненияЭТрН(Основание) Экспорт
	ДанныеЗаполнения = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Основание) 
		ИЛИ ТипЗнч(Основание) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат ДанныеЗаполнения;
	КонецЕсли; 
	
	СписокРеквизитов = "Организация, Контрагент, Грузоотправитель, Грузополучатель, Склад,
		|Перевозчик, Дата, Номер, АдресДоставкиЗначение, 
		|Организация";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, СписокРеквизитов);
		
	Если ЗначениеЗаполнено(РеквизитыОснования.Склад) Тогда
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Склад, 
			Справочники.ВидыКонтактнойИнформации.АдресСклада, РеквизитыОснования.Дата);
	Иначе
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Организация, 
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, РеквизитыОснования.Дата);
	КонецЕсли;
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", РеквизитыОснования.Дата);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузоотправитель), 
		РеквизитыОснования.Грузоотправитель, РеквизитыОснования.Организация));
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузополучатель), 
		РеквизитыОснования.Грузополучатель, РеквизитыОснования.Контрагент));
		
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяПеревозчик", РеквизитыОснования.Перевозчик);
	
	// дозаполняем контактные данные участников
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузоотправитель, "ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, "ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяПеревозчик, "ТитулГрузоотправителяПеревозчик", ДанныеЗаполнения, Неопределено);
	
	ЗаполнитьАдрес(ДанныеЗаполнения, "ТитулГрузоотправителяГрузополучательАдресДоставки", РеквизитыОснования.АдресДоставкиЗначение);

	ЗаполнитьАдрес(ДанныеЗаполнения, "ТитулГрузоотправителяАдресПогрузки", АдресПогрузки);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяГрузы", ДанныеОГрузе(Основание));
	
	ЗаполнитьСтоимостьГрузаИВалюту(ДанныеЗаполнения, Основание);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаявленныеДатаВремяПодачи", ОбменСГИСЭПДКлиентСервер.ОкруглениеДатыПриИзменении(ТекущаяДата));
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаявленныеДатаВремяПодачиИспользуетсяUTC", Истина);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяФактическиеДатаВремяПодачи", ОбменСГИСЭПДКлиентСервер.ОкруглениеДатыПриИзменении(ТекущаяДата));
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяФактическиеДатаВремяПодачиИспользуетсяUTC", Истина);  
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяФактическиеДатаВремяУбытия", ОбменСГИСЭПДКлиентСервер.ОкруглениеДатыПриИзменении(ТекущаяДата));
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяФактическиеДатаВремяУбытияИспользуетсяUTC", Истина); 
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем", "1");
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяВладелецПунктаПогрузкиЯвляетсяГрузоотправителем", "1");
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяМассаБруттоГруза", 10);
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяКоличествоГрузовыхМест", 1);
	
	Возврат ДанныеЗаполнения;
КонецФункции 

Функция ДанныеЗаполненияЭЗЗ(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат ДанныеЗаполненияЭЗЗПоДаннымСчета(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат ДанныеЗаполненияЭЗЗПоДаннымРеализации(Основание);
	КонецЕсли;
КонецФункции 

Функция СоздатьХранимыеДанныеЭПД(ЗначенияЗаполнения) Экспорт
	СправочникОбъект = Справочники.ХранимыеДанныеЭПД.СоздатьЭлемент();
	
	СправочникОбъект.ГруппаДанных = ЗначенияЗаполнения.ГруппаДанных;
	СправочникОбъект.Тип          = ЗначенияЗаполнения.Тип;
	СправочникОбъект.ИмяОбъекта   = ЗначенияЗаполнения.ИмяОбъекта;
	
	Для каждого КлючИЗначение Из ЗначенияЗаполнения.ДанныеЗаполненияРеквизитовФормы Цикл
		НоваяСтрока = СправочникОбъект.Данные.Добавить();
		НоваяСтрока.Имя      = КлючИЗначение.Ключ;
		НоваяСтрока.Значение = КлючИЗначение.Значение;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	СправочникОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат СправочникОбъект.Ссылка;
КонецФункции 

Функция НастроенОбменЭПД(Организация, Грузополучатель, Перевозчик) Экспорт
	Возврат ОбменСГИСЭПДБП.ДокументооборотНастроен(Организация, Грузополучатель) 
		  И ОбменСГИСЭПДБП.ДокументооборотНастроен(Организация, Перевозчик);
КонецФункции

Функция ОтгрузочноеНаименованиеГруза(ХранимыеДанныеСсылка) Экспорт
	ХранимыеДанныеЭПД = ОбменСГИСЭПДБП.ХранимыеДанныеЭПД(ХранимыеДанныеСсылка);
	Возврат ХранимыеДанныеЭПД["ОтгрузочноеНаименованиеГруза"];
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокРеализацийПоСчетуПокупателю(Ссылка) Экспорт
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(
		Документы.СчетНаОплатуПокупателю.РеализацииПоСчету(Ссылка), "СчетНаОплату", Истина);
КонецФункции 


#Область ЗаполнениеЭЗЗ
	
Функция ДанныеЗаполненияЭЗЗПоДаннымСчета(Основание) 
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, 
		|Дата, Номер, АдресДоставкиЗначение, Организация, СпособДоставки.Контрагент, Склад, ПараметрыТранспортногоСредства";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	Если ЗначениеЗаполнено(РеквизитыОснования.Склад) Тогда
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Склад, 
			Справочники.ВидыКонтактнойИнформации.АдресСклада, РеквизитыОснования.Дата);
	Иначе
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Организация, 
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, РеквизитыОснования.Дата);
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", РеквизитыОснования.Дата);
	
	ВладелецПунктаПогрузки = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(РеквизитыОснования.Организация, РеквизитыОснования.Дата);
	ЗаполнитьДанныеПунктовПогрузкиВыгрузки(ДанныеЗаполнения, АдресПогрузки.Значение, ВладелецПунктаПогрузки, РеквизитыОснования.АдресДоставкиЗначение);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", РеквизитыОснования.Организация);
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		РеквизитыОснования.Организация, 
		"ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", РеквизитыОснования.Контрагент);
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, 
		"ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяПеревозчик", РеквизитыОснования.СпособДоставкиКонтрагент);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяПеревозчик, 
		"ТитулГрузоотправителяПеревозчик", ДанныеЗаполнения, Неопределено);
	
	ЗаполнитьАдрес(ДанныеЗаполнения, "ТитулГрузоотправителяАдресПогрузки", АдресПогрузки.Значение);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяГрузы", ДанныеОГрузе(Основание));
	ДанныеЗаполнения.Вставить("ХранимыеДанныеТитулГрузоотправителяПараметрыТранспортногоСредства", РеквизитыОснования.ПараметрыТранспортногоСредства);
	
	ЗаполнитьСтоимостьГрузаИВалюту(ДанныеЗаполнения, Основание);
	
	ГруппаДанных = "ТитулГрузоотправителяПараметрыТранспортногоСредства";
	ДанныеПоПараметрамТранспортногоСредства = ОбменСГИСЭПД.ПолучитьОписаниеХранимыхДанныхЭПДПоСсылке(РеквизитыОснования.ПараметрыТранспортногоСредства, ГруппаДанных);
	
	Для Каждого ПараметрТранспортногоСредства Из ДанныеПоПараметрамТранспортногоСредства.ДанныеЗаполненияРеквизитовФормы Цикл
		ДанныеЗаполнения.Вставить(ГруппаДанных + ПараметрТранспортногоСредства.Ключ, ПараметрТранспортногоСредства.Значение);
	КонецЦикла;
	
	Возврат ДанныеЗаполнения
КонецФункции

Функция ДанныеЗаполненияЭЗЗПоДаннымРеализации(Основание) 
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, Грузоотправитель, Грузополучатель, 
		|Перевозчик, Дата, Номер, АдресДоставкиЗначение, 
		|Организация, ЭтоУниверсальныйДокумент, Склад, ПараметрыТранспортногоСредства, СпособДоставки.Контрагент";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	Если ЗначениеЗаполнено(РеквизитыОснования.Склад) Тогда
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Склад, 
			Справочники.ВидыКонтактнойИнформации.АдресСклада, РеквизитыОснования.Дата);
	Иначе
		АдресПогрузки = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(РеквизитыОснования.Организация, 
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, РеквизитыОснования.Дата);
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	МассивОснований = ДанныеЗаполнения.ДокументыОснования;
	МассивОснований.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);

	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", 
		РеквизитыОснования.Дата);
		
	// Грузоотправитель
	СсылкаГрузоотправителя = ?(ЗначениеЗаполнено(РеквизитыОснования.Грузоотправитель), 
		РеквизитыОснования.Грузоотправитель, РеквизитыОснования.Организация);
		
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", 
		СсылкаГрузоотправителя); 
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузоотправитель, 
		"ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
		
	// Грузополучатель
	СсылкаГрузополучателя = ?(ЗначениеЗаполнено(РеквизитыОснования.Грузополучатель), 
			РеквизитыОснования.Грузополучатель, РеквизитыОснования.Контрагент);
			
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", СсылкаГрузополучателя);
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, 
		"ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
		
	// Перевозчик
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяПеревозчик", 
		РеквизитыОснования.Перевозчик);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяПеревозчик, 
		"ТитулГрузоотправителяПеревозчик", ДанныеЗаполнения, Неопределено);

	ЗаполнитьАдрес(ДанныеЗаполнения, "ТитулГрузоотправителяГрузополучательАдресДоставки", РеквизитыОснования.АдресДоставкиЗначение);
	
	ВладелецПунктаПогрузки = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СсылкаГрузоотправителя, РеквизитыОснования.Дата);
	ЗаполнитьДанныеПунктовПогрузкиВыгрузки(ДанныеЗаполнения, АдресПогрузки.Значение, ВладелецПунктаПогрузки, РеквизитыОснования.АдресДоставкиЗначение);
	
	ЗаполнитьАдрес(ДанныеЗаполнения, "ТитулГрузоотправителяАдресПогрузки", АдресПогрузки.Значение);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяГрузы", ДанныеОГрузе(Основание));
	ДанныеЗаполнения.Вставить("ХранимыеДанныеТитулГрузоотправителяПараметрыТранспортногоСредства", РеквизитыОснования.ПараметрыТранспортногоСредства);
	
	ГруппаДанных = "ТитулГрузоотправителяПараметрыТранспортногоСредства";
	ДанныеПоПараметрамТранспортногоСредства = ОбменСГИСЭПД.ПолучитьОписаниеХранимыхДанныхЭПДПоСсылке(РеквизитыОснования.ПараметрыТранспортногоСредства, ГруппаДанных);
	
	Для Каждого ПараметрТранспортногоСредства Из ДанныеПоПараметрамТранспортногоСредства.ДанныеЗаполненияРеквизитовФормы Цикл
		ДанныеЗаполнения.Вставить(ГруппаДанных + ПараметрТранспортногоСредства.Ключ, ПараметрТранспортногоСредства.Значение);
	КонецЦикла;

	Возврат ДанныеЗаполнения;
КонецФункции

#КонецОбласти

Процедура ЗаполнитьСтоимостьГрузаИВалюту(ДанныеЗаполнения, ДокументСсылка)
	ВалютаСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВалютаДокумента");
	СведенияОВалюте = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВалютаСсылка, "Ссылка, Наименование, Код");

	СуммаИтого = 0;
	Для Каждого СтрокаГруз Из ДанныеЗаполнения.ТитулГрузоотправителяГрузы Цикл
		СтрокаГруз.Вставить("НаименованиеВалютыСтоимости", СведенияОВалюте.Наименование);
		СтрокаГруз.Вставить("КодВалютыСтоимости",          СведенияОВалюте.Код);
		
		СуммаИтого = СуммаИтого + СтрокаГруз.СтоимостьГруза;
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяСтоимостьГруза",     СуммаИтого);
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяКодВалюты",          СведенияОВалюте.Код);
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяНаименованиеВалюты", СведенияОВалюте.Наименование);
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяВалюта",       СведенияОВалюте.Ссылка);
КонецПроцедуры

Функция ЗаполнитьДанныеПунктовПогрузкиВыгрузки(ДанныеЗаполнения, АдресПогрузки, ВладелецПунктаПогрузки, АдресДоставки)
	
	МассивАдресов = Новый Массив;
	
	// Пункт погрузки
	Если АдресПогрузки <> Неопределено Тогда
		СтрокаПогрузки = Новый Структура;
		СтрокаПогрузки.Вставить("НомерПп", 1);
		СтрокаПогрузки.Вставить("Операция", "Погрузка");
		
		СтрокаПогрузки.Вставить("ВладелецПунктаПогрузкиНаименование", ВладелецПунктаПогрузки.ПолноеНаименование);
		СтрокаПогрузки.Вставить("ВладелецПунктаПогрузкиИНН", ВладелецПунктаПогрузки.ИНН);
		
		СтруктураАдреса = Неопределено;
		ЗаполнитьАдрес(СтрокаПогрузки, "АдресПунктаПогрузки", АдресПогрузки, СтруктураАдреса);
		СтрокаПогрузки.Вставить("ПредставлениеАдресПунктаПогрузки", СтруктураАдреса.Представление);
		
		МассивАдресов.Добавить(СтрокаПогрузки);
	КонецЕсли;
	
	// Пункт доставки (выгрузки)
	Если АдресДоставки <> Неопределено Тогда
		СтрокаВыгрузки = Новый Структура;
		НомерПп = МассивАдресов.Количество() + 1;
		
		СтрокаВыгрузки.Вставить("НомерПп", НомерПп);
		СтрокаВыгрузки.Вставить("Операция", "Выгрузка");
		
		СтруктураАдреса = Неопределено;
		ЗаполнитьАдрес(СтрокаВыгрузки, "АдресПунктаПогрузки", АдресДоставки, СтруктураАдреса);
		СтрокаВыгрузки.Вставить("ПредставлениеАдресПунктаПогрузки", СтруктураАдреса.Представление);
		
		МассивАдресов.Добавить(СтрокаВыгрузки);
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки", МассивАдресов);
	
	Возврат ДанныеЗаполнения;
КонецФункции

Функция НовыйДанныеОГрузе()
	ДанныеОГрузе = Новый Структура();
	
	ДанныеОГрузе.Вставить("ИдентификаторСтроки", "");
	ДанныеОГрузе.Вставить("ХранимыеДанныеГруз", "");
	ДанныеОГрузе.Вставить("ОтгрузочноеНаименованиеГруза", "");
	ДанныеОГрузе.Вставить("ВидТары", "");
	ДанныеОГрузе.Вставить("СостояниеГруза", "Надлежащее");
	ДанныеОГрузе.Вставить("СпособУпаковки", "");
	ДанныеОГрузе.Вставить("МассаБрутто", 0);
	ДанныеОГрузе.Вставить("СтоимостьГруза", 0);
	ДанныеОГрузе.Вставить("ОбъемГруза", 0);
	ДанныеОГрузе.Вставить("Плотность", 0);
	ДанныеОГрузе.Вставить("МетодОпределенияМассыГруза", "03");
	ДанныеОГрузе.Вставить("ВозможностьРаспределенияПоДлинеПлатформы", Ложь);
	ДанныеОГрузе.Вставить("ДелимостьГруза", Ложь);
	ДанныеОГрузе.Вставить("КоличествоГрузовыхМест", 0);
	ДанныеОГрузе.Вставить("Длина");
	ДанныеОГрузе.Вставить("Высота");
	ДанныеОГрузе.Вставить("Ширина");
	
	Возврат ДанныеОГрузе;
КонецФункции 


Функция ДанныеОГрузе(ДокументСсылка)
	
	ДанныеОГрузе = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументСсылка);
	
	Запрос.Текст = МодульМенеджера.ТекстЗапросаДанныеОГрузе();
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		ЗначенияЗаполнения = НовыйДанныеОГрузе();
		
		ЗначенияЗаполнения.Вставить("ХранимыеДанныеГруз", Результат.ГрузСсылка);
		
		ХранимыеДанныеОГрузе = ОбменСГИСЭПДБП.ХранимыеДанныеЭПД(Результат.ГрузСсылка);
		Для каждого КлючИЗначение Из ХранимыеДанныеОГрузе Цикл
			ЗначенияЗаполнения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		ЗначенияЗаполнения.Вставить("МассаБрутто",    Результат.Вес);
		ЗначенияЗаполнения.Вставить("СтоимостьГруза", Окр(Результат.СтоимостьГруза, 2));
		ЗначенияЗаполнения.Вставить("ОбъемГруза",     Результат.Объем);
		
		Если Результат.Объем <> 0 Тогда
			ЗначенияЗаполнения.Вставить("Плотность", Окр(Результат.Вес/Результат.Объем,2));
		ИначеЕсли НЕ ХранимыеДанныеОГрузе["Плотность"] = Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Плотность", ХранимыеДанныеОГрузе["Плотность"]);
		КонецЕсли;
		
		Если Результат.НасыпнойНаливной Тогда
			ЗначенияЗаполнения.Вставить("КоличествоГрузовыхМест", 1);
			
			Измерение = Окр(Pow(Результат.Объем, 1/3),3);
			
			ЗначенияЗаполнения.Вставить("Длина", Измерение);
			ЗначенияЗаполнения.Вставить("Высота", Измерение);
			ЗначенияЗаполнения.Вставить("Ширина", Измерение);
		КонецЕсли;
		
		ДанныеОГрузе.Добавить(ЗначенияЗаполнения);
	КонецЦикла;
	
	Возврат ДанныеОГрузе;

КонецФункции

Функция ЭлектронныеДокументыПоОснованию(ДокументСсылка, ТипСсылки = Неопределено) Экспорт 
	Возврат ОбменСГИСЭПДБП.ЭлектронныеДокументыПоОснованию(ДокументСсылка, ТипСсылки);
КонецФункции 

Функция ЕстьПодключенныеМобильныеПриложения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключенныеМПЭПД.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПодключенныеМПЭПД КАК ПодключенныеМПЭПД";
	ВОзврат НЕ Запрос.Выполнить().Пустой();

КонецФункции 

Функция ИспользуетсяОбменЭлектроннымиДокументами() Экспорт 
	Возврат ОбменСГИСЭПДБП.ИспользуетсяОбменЭлектроннымиДокументами();
КонецФункции

Процедура ЗаполнитьАдрес(ДанныеЗаполнения, Префикс, Знач АдресЗначение, СтруктураАдреса = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(АдресЗначение) Тогда
		СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(АдресЗначение);
		Возврат;
	КонецЕсли; 

	Если НЕ УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(АдресЗначение) Тогда
		АдресЗначение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
			АдресЗначение, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	КонецЕсли;
	
	Если НЕ ТипЗнч(АдресЗначение) = Тип("Структура") Тогда
		СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(АдресЗначение);
	Иначе
		СтруктураАдреса = АдресЗначение;
	КонецЕсли;
	
	Если СтруктураАдреса.ТипАдреса = "ВСвободнойФорме" Тогда
		ДанныеЗаполнения.Вставить(Префикс + "Представление",   СтруктураАдреса.Представление);
		ДанныеЗаполнения.Вставить(Префикс + "КодСтраны",       СтруктураАдреса.КодСтраны);
	Иначе	
		ДанныеЗаполнения.Вставить(Префикс + "Индекс",          СтруктураАдреса.Индекс);
		ДанныеЗаполнения.Вставить(Префикс + "КодРегиона",      СтруктураАдреса.КодРегиона);
		ДанныеЗаполнения.Вставить(Префикс + "Город",           СтруктураАдреса.Город 
			+ ?(СтруктураАдреса.ГородТипКраткий = "", "", " ") + СтруктураАдреса.ГородТипКраткий); 
		ДанныеЗаполнения.Вставить(Префикс + "Район",           СтруктураАдреса.Район 
			+ ?(СтруктураАдреса.РайонТипКраткий = "", "", " ") + СтруктураАдреса.РайонТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "НаселенныйПункт", СтруктураАдреса.НаселенныйПункт 
			+ ?(СтруктураАдреса.НаселенныйПунктТипКраткий = "", "", " ") + СтруктураАдреса.НаселенныйПунктТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "Улица",           СтруктураАдреса.Улица 
			+ ?(СтруктураАдреса.УлицаТипКраткий = "", "", " ") + СтруктураАдреса.УлицаТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "Дом",             СтруктураАдреса.Здание.Номер);
		Если СтруктураАдреса.Корпуса.Количество() > 0 Тогда
			ДанныеЗаполнения.Вставить(Префикс + "Корпус",      СтруктураАдреса.Корпуса[0].Номер);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
