
//Процедура ОсновныеДействияФормыНастройка(Кнопка)
//	
//	ОбщегоНазначения.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(),Ссылка,ЭтотОбъект);
//	
//КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

Функция СформироватьЗапросПоСч23()
	
	Запрос = Новый Запрос;
	
	Дата = Объект.Дата;
	Организация = Объект.Организация;

	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.РасходыПоАвтомойкеКосв);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Организация = &Организация
	|	И ХозрасчетныйОбороты.Счет = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Субконто1";
	
	Возврат Запрос;	
	
КонецФункции

Процедура ДатаПриИзменении(Элемент)
	
	Дата = КонецМесяца(Дата);
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	
	Коэффициент = Объект.Коэффициент;
	НоменклатурнаяГруппа_20 = Объект.НоменклатурнаяГруппа_20;
	ПодразделениеДт20 = Объект.ПодразделениеДт20;
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;

	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана организация !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ПодразделениеДт20 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрано подразделение Дт 20.01 счета !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если НоменклатурнаяГруппа_20 = Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана номенклатурная группа Дт 20.01 счета !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Коэффициент=0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не заполнен коэффициент распределения !");
		Сообщение.Сообщить();
	КонецЕсли;	
	
	ТабЧасть.Очистить();
	
	Сч23_01 = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводстваКосв;
	Сч20_01 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	Запрос = СформироватьЗапросПоСч23();
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТабЧасти = ТабЧасть.Добавить();                   //Дт 23_01 Кт 23_02
		СтрокаТабЧасти.СчетДт = Сч23_01;
		СтрокаТабЧасти.ПодразделениеДт = Выборка.Подразделение;
		СтрокаТабЧасти.ПодразделениеКт = Выборка.Подразделение; 
		СтрокаТабЧасти.Субконто1 = Выборка.Субконто1;
		СтрокаТабЧасти.Субконто1Кт = Выборка.Субконто1;
		СуммаРаспр = Окр(Выборка.СуммаОборотДт * Коэффициент,2); 
		СтрокаТабЧасти.СуммаОборотКт = СуммаРаспр;
		СуммаРаспрНУ = Окр(Выборка.СуммаНУОборотДт * Коэффициент,2);
		СтрокаТабЧасти.СуммаОборотКтНУ = СуммаРаспрНУ;
		СтрокаТабЧасти = ТабЧасть.Добавить();                   //Дт 20_01 Кт 23_02  
		СтрокаТабЧасти.СчетДт = Сч20_01;
		СтрокаТабЧасти.ПодразделениеДт = ПодразделениеДт20;
		СтрокаТабЧасти.ПодразделениеКт = Выборка.Подразделение; 
		СтрокаТабЧасти.Субконто1 = НоменклатурнаяГруппа_20;
		СтрокаТабЧасти.Субконто2 = Выборка.Субконто1;
		СтрокаТабЧасти.Субконто1Кт = Выборка.Субконто1;
		СтрокаТабЧасти.СуммаОборотКт = Выборка.СуммаОборотДт - СуммаРаспр ; 
		СтрокаТабЧасти.СуммаОборотКтНУ = Выборка.СуммаНУОборотДт - СуммаРаспрНУ;  
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры
