Функция СформироватьЗапросПоНомГруппе_20(НомГруппа)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Запрос.УстановитьПараметр("НомГруппа",НомГруппа);

	Запрос.Текст ="ВЫБРАТЬ
	              |	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
				  |	ХозрасчетныйОбороты.Субконто1 КАК НомГруппа,
	          	  |	ХозрасчетныйОбороты.Субконто2 КАК СтатьяЗатрат,
	              |	ХозрасчетныйОбороты.СуммаОборотДт,
	              |	ХозрасчетныйОбороты.СуммаНУОборотДт	             
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты
	              |ГДЕ
	              |	ХозрасчетныйОбороты.Организация = &Организация
	              |	И ХозрасчетныйОбороты.Счет = &Счет
				  |	И ХозрасчетныйОбороты.Субконто1 = &НомГруппа 
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Подразделение";

  Возврат Запрос;	
	
КонецФункции

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана организация");
		Возврат;
	КонецЕсли;
	
	Если (НеРаспределять = Ложь) И (НоменклатурнаяГруппа_20 = Справочники.НоменклатурныеГруппы.ПустаяСсылка()) Тогда
		Сообщить ("Не выбрана номенклатурная группа Кт счета 20.01");
		Возврат;
	КонецЕсли;
	
	// Если не распределяем тогда коэффициент равен единице
	Если НеРаспределять = Истина Тогда
		Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
			Запрос = СформироватьЗапросПоНомГруппе_20(ТекСтрока.НоменклатурнаяГруппа_20);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать(); 			
			Пока Выборка.Следующий() Цикл
				СуммаРаспр = Выборка.СуммаОборотДт;
				СуммаРаспрНУ = Выборка.СуммаНУОборотДт;
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
				Движение.ПодразделениеКт = Выборка.Подразделение;
				Движение.Сумма = СуммаРаспр;
				Если СуммаРаспр<>СуммаРаспрНУ Тогда
					//Сообщить("Обнаружены разницы между БУ и НУ");
					Движение.СуммаНУДт = СуммаРаспрНУ;
					Движение.СуммаВРДт = СуммаРаспр-СуммаРаспрНУ;
					Движение.СуммаНУКт = СуммаРаспрНУ;
					Движение.СуммаВРКт = СуммаРаспр-СуммаРаспрНУ;
				КонецЕсли; 				
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_90;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_20;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;				
				
			КонецЦикла;  			
		КонецЦикла;	
		
	Иначе		
		
		// Если распределяем тогда сумма коэффициентов таб.части должна равняться единице

		СуммаКоэфф = 0;
		
		Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
			СуммаКоэфф = СуммаКоэфф+ТекСтрока.Коэффициент;	
		КонецЦикла;	
		
		Если СуммаКоэфф <> 1 Тогда
			Сообщить("Сумма коэффициентов распределения должна равняться единице");
			Возврат;
		КонецЕсли;
		
		СЧ = ТабЧастьКоэфф.Количество();		
		
		Запрос = СформироватьЗапросПоНомГруппе_20(НоменклатурнаяГруппа_20);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
    	Пока Выборка.Следующий() Цикл
			СуммаОст=0;
			СуммаОстНУ=0;
			Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
								
				Если ТекСтрока.НомерСтроки<СЧ Тогда
					СуммаРаспр = Окр(Выборка.СуммаОборотДт*ТекСтрока.Коэффициент,2);
					СуммаРаспрНУ = Окр(Выборка.СуммаНУОборотДт*ТекСтрока.Коэффициент,2);
					СуммаОст = СуммаОст+СуммаРаспр;
					СуммаОстНУ = СуммаОстНУ+СуммаРаспрНУ; 
				Иначе 
					СуммаРаспр = Выборка.СуммаОборотДт-СуммаОст;
					СуммаРаспрНУ = Выборка.СуммаНУОборотДт-СуммаОстНУ; 
				КонецЕсли;
				
					Движение = Движения.Хозрасчетный.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
					Движение.СчетКт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
					Движение.ПодразделениеКт = Выборка.Подразделение;
					Движение.Сумма = СуммаРаспр;
					Если СуммаРаспр<>СуммаРаспрНУ Тогда
						//Сообщить("Обнаружены разницы между БУ и НУ");
						Движение.СуммаНУДт = СуммаРаспрНУ;
						Движение.СуммаВРДт = СуммаРаспр-СуммаРаспрНУ;
						Движение.СуммаНУКт = СуммаРаспрНУ;
						Движение.СуммаВРКт = СуммаРаспр-СуммаРаспрНУ;
					КонецЕсли; 				
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_90;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = НоменклатурнаяГруппа_20;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;				
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры
