#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для Каждого ТекСтрока Из ОсновныеТССотрудников Цикл
		
		НовоеДвижение = Движения.ЮЦАУ_ОсновныеТССотрудников.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, ТекСтрока);

		НовоеДвижение.Период = Дата;
		НовоеДвижение.Подразделение = Подразделение;
			
	КонецЦикла;	
	
	Движения.ЮЦАУ_ОсновныеТССотрудников.Записать(Истина);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ЗаполнитьОсновныеТССотрудниковПоОборотамПериода(Организация, Подразделение, ДатаПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник КАК Сотрудник,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение КАК Подразделение,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	|	СУММА(ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот) КАК РабочееВремяОборот,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат КАК СчетЗатрат
	|ПОМЕСТИТЬ ВТ_ОборотыПоТС
	|ИЗ
	|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&ДатаНач, &ДатаКон, Период, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
	|ГДЕ
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
	|	И ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыПоТС.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВТ_ОборотыПоТС.РабочееВремяОборот) КАК РабочееВремяОборот,
	|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат
	|ПОМЕСТИТЬ ВТ_МаксимумПоСотрудникам
	|ИЗ
	|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотыПоТС.Сотрудник,
	|	ВТ_ОборотыПоТС.СчетЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат,
	|	ВТ_ОборотыПоТС.Сотрудник КАК Сотрудник,
	|	ВТ_ОборотыПоТС.Подразделение КАК Подразделение,
	|	ВТ_ОборотыПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_МаксимумПоСотрудникам.РабочееВремяОборот КАК РабочееВремяОборот
	|ИЗ
	|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_МаксимумПоСотрудникам.Сотрудник КАК Сотрудник,
	|			ВТ_МаксимумПоСотрудникам.РабочееВремяОборот КАК РабочееВремяОборот
	|		ИЗ
	|			ВТ_МаксимумПоСотрудникам КАК ВТ_МаксимумПоСотрудникам) КАК ВТ_МаксимумПоСотрудникам
	|		ПО ВТ_ОборотыПоТС.Сотрудник = ВТ_МаксимумПоСотрудникам.Сотрудник
	|			И ВТ_ОборотыПоТС.РабочееВремяОборот = ВТ_МаксимумПоСотрудникам.РабочееВремяОборот
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаПериода));
	Граница = Новый Граница(КонецМесяца(ДатаПериода), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаКон", Граница);

	Запрос.УстановитьПараметр("Организация", Организация);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение = &Подразделение", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ОсновныеТССотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли