
&ИзменениеИКонтроль("ПодготовитьТаблицыАмортизацииОСИСуммАмортизационнойПремии")
Функция Расш1_ПодготовитьТаблицыАмортизацииОСИСуммАмортизационнойПремии(ТаблицаОС, ТаблицаРеквизиты, Отказ, ОкончательныйРасчет, Ошибки)

	Параметры = ПодготовитьПараметрыПодготовитьТаблицыАмортизацииОСИСуммАмортизационнойПремии(ТаблицаОС, ТаблицаРеквизиты);

	Реквизиты = Параметры.Реквизиты[0];

	Содержание = "Амортизация ОС";

	ПараметрыНачисленияАмортизации = Новый Структура;

	Параметры.Реквизиты.Колонки.Добавить("ДатаРасчета");
	Параметры.Реквизиты.ЗаполнитьЗначения(Реквизиты.Период, "ДатаРасчета");
	Параметры.Реквизиты.Колонки.Добавить("Содержание");
	Параметры.Реквизиты.ЗаполнитьЗначения(Содержание, "Содержание");
	Параметры.Реквизиты.Колонки.Добавить("ВыдаватьСообщения");
	Параметры.Реквизиты.ЗаполнитьЗначения(истина, "ВыдаватьСообщения");

	РасчетАмортизацииОС = ПодготовитьРасчетАмортизацииОС(
	Параметры.ТаблицаОС,
	Параметры.Реквизиты,
	Отказ,
	Ложь,
	ОкончательныйРасчет);

	ТаблицаАмортизации = РасчетАмортизацииОС.ТаблицаАмортизации;

	Если Ошибки <> Неопределено Тогда
		УправлениеВнеоборотнымиАктивамиПереопределяемый.ПроверитьКорректностьДанныхРегламентнойОперации(
		Ошибки,
		ТаблицаАмортизации,
		Параметры.Реквизиты,
		Отказ);
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

	ПараметрыНачисленияАмортизации.Вставить("Амортизация", Новый Структура(Новый ФиксированнаяСтруктура(РасчетАмортизацииОС))); // нерекурсивная копия
	ПараметрыНачисленияАмортизации.Амортизация.Вставить("ТаблицаРеквизиты", Параметры.Реквизиты);

	Параметры.Реквизиты.ЗаполнитьЗначения("", "ИмяСписка");

	ТаблицаРаспределения = УправлениеВнеоборотнымиАктивамиПереопределяемый.ПодготовитьТаблицуРаспределениеАмортизацииПоНаправлениямРегл(
	ТаблицаАмортизации, Параметры.Реквизиты, Отказ);
    #Вставка
	ЮЦАУ.РаспределитьАмортизацию(ТаблицаРаспределения, Параметры.Реквизиты);
	#КонецВставки
	ПараметрыРаспределения = Новый Структура;
	ПараметрыРаспределения.Вставить("ТаблицаРеквизиты", Параметры.Реквизиты);
	ПараметрыРаспределения.Вставить("ТаблицаЗатрат", ТаблицаРаспределения);
	ПараметрыНачисленияАмортизации.Вставить("РаспределениеАмортизации", ПараметрыРаспределения);

	ТаблицаНачисленияАмортизационнойПремии = ПодготовитьТаблицуСуммАмортизационнойПремии(ТаблицаАмортизации,
	Параметры.Реквизиты, Отказ);

	ПараметрыАмортизационнойПремии = Новый Структура;
	ПараметрыАмортизационнойПремии.Вставить("ТаблицаРеквизиты", ТаблицаРеквизиты);
	ПараметрыАмортизационнойПремии.Вставить("ТаблицаНачисленияАмортизационнойПремии", ТаблицаНачисленияАмортизационнойПремии);
	ПараметрыНачисленияАмортизации.Вставить("АмортизационнаяПремия", ПараметрыАмортизационнойПремии);

	Возврат ПараметрыНачисленияАмортизации;

КонецФункции
