
&Вместо("ПолучитьВыборкуИзРегистраНДСРаздельныйУчет")
Функция Расш1_ПолучитьВыборкуИзРегистраНДСРаздельныйУчет(СтруктураПараметров)
	
	ТолькоОСиНМА = Ложь; //ЮЦАУ //КонецМесяца(СтруктураПараметров.Дата) <> КонецКвартала(СтруктураПараметров.Дата);
	
	ПредопределенныеСчетаУчетаОСиНМА = Новый Массив;
	Если ТолькоОСиНМА Тогда
		ПланСчетов = ПланыСчетов.Хозрасчетный;
		ПредопределенныеСчетаУчетаОСиНМА.Добавить(ПланСчетов.ОСвОрганизации);        // 01.01
		ПредопределенныеСчетаУчетаОСиНМА.Добавить(ПланСчетов.АрендованноеИмущество); // 01.03
		ПредопределенныеСчетаУчетаОСиНМА.Добавить(ПланСчетов.ОСБезГосРегистрации);   // 01.08
		ПредопределенныеСчетаУчетаОСиНМА.Добавить(ПланСчетов.ДоходныеВложенияВ_МЦ);  // 03
		ПредопределенныеСчетаУчетаОСиНМА.Добавить(ПланСчетов.НематериальныеАктивы);  // 04
	КонецЕсли;
	СчетаУчетаОСиНМА = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеСчетаУчетаОСиНМА);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоДня(СтруктураПараметров.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",	КонецМесяца(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("ТолькоОСиНМА",	ТолькоОСиНМА);
	Запрос.УстановитьПараметр("СчетаУчетаОСиНМА",	СчетаУчетаОСиНМА);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСРаздельныйУчетОбороты.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
	|	НДСРаздельныйУчетОбороты.АналитикаУчетаНДС КАК АналитикаУчетаНДС,
	|	НДСРаздельныйУчетОбороты.Партия КАК Партия,
	|	СУММА(НДСРаздельныйУчетОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(НДСРаздельныйУчетОбороты.СуммаБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(НДСРаздельныйУчетОбороты.НДСОборот) КАК НДС
	|ПОМЕСТИТЬ ВТОбороты
	|ИЗ
	|	РегистрНакопления.НДСРаздельныйУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И СпособУчетаНДС = ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.Распределяется)) КАК НДСРаздельныйУчетОбороты
	|ГДЕ
	|	НДСРаздельныйУчетОбороты.НДСПриход > 0
	|	И НДСРаздельныйУчетОбороты.НДСОборот > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСРаздельныйУчетОбороты.АналитикаУчетаЗатрат,
	|	НДСРаздельныйУчетОбороты.АналитикаУчетаНДС,
	|	НДСРаздельныйУчетОбороты.Партия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаЗатрат,
	|	АналитикаУчетаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСРаздельныйУчет.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
	|	НДСРаздельныйУчет.АналитикаУчетаНДС КАК АналитикаУчетаНДС,
	|	НДСРаздельныйУчет.Партия КАК Партия,
	|	СУММА(НДСРаздельныйУчет.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(НДСРаздельныйУчет.НДС) КАК НДС
	|ПОМЕСТИТЬ ВТМодернизации
	|ИЗ
	|	РегистрНакопления.НДСРаздельныйУчет КАК НДСРаздельныйУчет
	|ГДЕ
	|	НДСРаздельныйУчет.Организация = &Организация
	|	И НДСРаздельныйУчет.СпособУчетаНДС = ЗНАЧЕНИЕ(Перечисление.СпособыУчетаНДС.Распределяется)
	|	И НДСРаздельныйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НДСРаздельныйУчет.Регистратор ССЫЛКА Документ.МодернизацияОС
	|	И НДСРаздельныйУчет.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСРаздельныйУчет.АналитикаУчетаЗатрат,
	|	НДСРаздельныйУчет.АналитикаУчетаНДС,
	|	НДСРаздельныйУчет.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбороты.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
	|	ВТОбороты.АналитикаУчетаНДС КАК АналитикаУчетаНДС,
	|	ВТОбороты.Партия КАК Партия,
	|	ВТОбороты.Количество КАК Количество,
	|	ВТОбороты.СуммаБезНДС - ЕСТЬNULL(ВТМодернизации.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ВТОбороты.НДС - ЕСТЬNULL(ВТМодернизации.НДС, 0) КАК НДС,
	|	ЛОЖЬ КАК Модернизация
	|ПОМЕСТИТЬ ВТНДСРаздельныйУчет
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМодернизации КАК ВТМодернизации
	|		ПО ВТОбороты.АналитикаУчетаЗатрат = ВТМодернизации.АналитикаУчетаЗатрат
	|			И ВТОбороты.АналитикаУчетаНДС = ВТМодернизации.АналитикаУчетаНДС
	|			И ВТОбороты.Партия = ВТМодернизации.Партия
	|ГДЕ
	|	ВТОбороты.СуммаБезНДС - ЕСТЬNULL(ВТМодернизации.СуммаБезНДС, 0) >= 0
	|	И ВТОбороты.НДС - ЕСТЬNULL(ВТМодернизации.НДС, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТМодернизации.АналитикаУчетаЗатрат,
	|	ВТМодернизации.АналитикаУчетаНДС,
	|	ВТМодернизации.Партия,
	|	0,
	|	ВТМодернизации.СуммаБезНДС,
	|	ВТМодернизации.НДС,
	|	ИСТИНА
	|ИЗ
	|	ВТМодернизации КАК ВТМодернизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТМодернизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрАналитикаУчетаНДС.СчетФактура КАК СчетФактура,
	|	РегистрАналитикаУчетаНДС.ВидЦенности КАК ВидЦенности,
	|	РегистрАналитикаУчетаНДС.СчетУчетаНДС КАК СчетУчетаНДС,
	|	РегистрАналитикаУчетаНДС.СтавкаНДС КАК СтавкаНДС,
	|	ВТНДСРаздельныйУчет.Партия КАК Партия,
	|	ВТНДСРаздельныйУчет.Количество КАК Количество,
	|	ВТНДСРаздельныйУчет.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТНДСРаздельныйУчет.НДС КАК НДС,
	|	РегистрАналитикаУчетаЗатрат.СчетЗатрат КАК СчетЗатрат,
	|	РегистрАналитикаУчетаЗатрат.Подразделение КАК Подразделение,
	|	РегистрАналитикаУчетаЗатрат.Субконто1 КАК Субконто1,
	|	РегистрАналитикаУчетаЗатрат.Субконто2 КАК Субконто2,
	|	РегистрАналитикаУчетаЗатрат.Субконто3 КАК Субконто3,
	|	ВТНДСРаздельныйУчет.Модернизация КАК Модернизация,
	|	ЕСТЬNULL(РегистрАналитикаУчетаНДС.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Поставщик,
	|	ЕСТЬNULL(РегистрАналитикаУчетаНДС.ИсправленныйСчетФактура, ЗНАЧЕНИЕ(Документ.КорректировкаПоступления.ПустаяСсылка)) КАК ИсправленныйСчетФактура
	|ПОМЕСТИТЬ ВТНДСКРаспределению
	|ИЗ
	|	ВТНДСРаздельныйУчет КАК ВТНДСРаздельныйУчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаЗатрат КАК РегистрАналитикаУчетаЗатрат
	|		ПО ВТНДСРаздельныйУчет.АналитикаУчетаЗатрат = РегистрАналитикаУчетаЗатрат.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНДС КАК РегистрАналитикаУчетаНДС
	|		ПО ВТНДСРаздельныйУчет.АналитикаУчетаНДС = РегистрАналитикаУчетаНДС.КлючАналитики
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоОСиНМА
	|				ТОГДА РегистрАналитикаУчетаЗатрат.СчетЗатрат В (&СчетаУчетаОСиНМА)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНДСРаздельныйУчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНДСКРаспределению.СчетФактура КАК СчетФактура,
	|	ВТНДСКРаспределению.ВидЦенности КАК ВидЦенности,
	|	ВТНДСКРаспределению.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ВТНДСКРаспределению.СтавкаНДС КАК СтавкаНДС,
	|	ВТНДСКРаспределению.Партия КАК Партия,
	|	ВТНДСКРаспределению.Количество КАК Количество,
	|	ВТНДСКРаспределению.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТНДСКРаспределению.НДС КАК НДС,
	|	ВТНДСКРаспределению.СчетЗатрат КАК СчетЗатрат,
	|	ВТНДСКРаспределению.Подразделение КАК Подразделение,
	|	ВТНДСКРаспределению.Субконто1 КАК Субконто1,
	|	ВТНДСКРаспределению.Субконто2 КАК Субконто2,
	|	ВТНДСКРаспределению.Субконто3 КАК Субконто3,
	|	ЕСТЬNULL(ДанныеСчетФактура.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСФ,
	|	ЕСТЬNULL(ДанныеПартия.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПартии,
	|	ВТНДСКРаспределению.Модернизация КАК Модернизация,
	|	ВТНДСКРаспределению.Поставщик КАК Поставщик,
	|	ВТНДСКРаспределению.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
	|ИЗ
	|	ВТНДСКРаспределению КАК ВТНДСКРаспределению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеСчетФактура
	|		ПО ВТНДСКРаспределению.СчетФактура = ДанныеСчетФактура.Документ
	|			И (ДанныеСчетФактура.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПартия
	|		ПО ВТНДСКРаспределению.Партия = ДанныеПартия.Документ
	|			И (ДанныеПартия.Организация = &Организация)";
	
	Результат = Запрос.Выполнить();
	
	Если ТолькоОСиНМА Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НДСКРаспределению", Результат.Выгрузить());
		Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоДня(СтруктураПараметров.НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода",	КонецМесяца(СтруктураПараметров.Дата));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСКРаспределению.СчетФактура КАК СчетФактура,
		|	НДСКРаспределению.ВидЦенности КАК ВидЦенности,
		|	НДСКРаспределению.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСКРаспределению.СтавкаНДС КАК СтавкаНДС,
		|	НДСКРаспределению.Партия КАК Партия,
		|	НДСКРаспределению.Количество КАК Количество,
		|	НДСКРаспределению.СуммаБезНДС КАК СуммаБезНДС,
		|	НДСКРаспределению.НДС КАК НДС,
		|	НДСКРаспределению.СчетЗатрат КАК СчетЗатрат,
		|	НДСКРаспределению.Подразделение КАК Подразделение,
		|	НДСКРаспределению.Субконто1 КАК Субконто1,
		|	НДСКРаспределению.Субконто2 КАК Субконто2,
		|	НДСКРаспределению.Субконто3 КАК Субконто3,
		|	НДСКРаспределению.ДатаСФ КАК ДатаСФ,
		|	НДСКРаспределению.ДатаПартии КАК ДатаПартии,
		|	НДСКРаспределению.Модернизация КАК Модернизация,
		|	НДСКРаспределению.Поставщик КАК Поставщик,
		|	НДСКРаспределению.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
		|ПОМЕСТИТЬ НДСКРаспределению
		|ИЗ
		|	&НДСКРаспределению КАК НДСКРаспределению
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСКРаспределению.СчетФактура КАК СчетФактура,
		|	НДСКРаспределению.ВидЦенности КАК ВидЦенности,
		|	НДСКРаспределению.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСКРаспределению.СтавкаНДС КАК СтавкаНДС,
		|	НДСКРаспределению.Партия КАК Партия,
		|	НДСКРаспределению.Количество КАК Количество,
		|	НДСКРаспределению.СуммаБезНДС КАК СуммаБезНДС,
		|	НДСКРаспределению.НДС КАК НДС,
		|	НДСКРаспределению.СчетЗатрат КАК СчетЗатрат,
		|	НДСКРаспределению.Подразделение КАК Подразделение,
		|	НДСКРаспределению.Субконто1 КАК Субконто1,
		|	НДСКРаспределению.Субконто2 КАК Субконто2,
		|	НДСКРаспределению.Субконто3 КАК Субконто3,
		|	НДСКРаспределению.ДатаСФ КАК ДатаСФ,
		|	НДСКРаспределению.ДатаПартии КАК ДатаПартии,
		|	НДСКРаспределению.Модернизация КАК Модернизация,
		|	НДСКРаспределению.Поставщик КАК Поставщик,
		|	НДСКРаспределению.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
		|ПОМЕСТИТЬ ВТ_ОС
		|ИЗ
		|	НДСКРаспределению КАК НДСКРаспределению
		|ГДЕ
		|	НДСКРаспределению.Субконто1 ССЫЛКА Справочник.ОсновныеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСКРаспределению.СчетФактура КАК СчетФактура,
		|	НДСКРаспределению.ВидЦенности КАК ВидЦенности,
		|	НДСКРаспределению.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСКРаспределению.СтавкаНДС КАК СтавкаНДС,
		|	НДСКРаспределению.Партия КАК Партия,
		|	НДСКРаспределению.Количество КАК Количество,
		|	НДСКРаспределению.СуммаБезНДС КАК СуммаБезНДС,
		|	НДСКРаспределению.НДС КАК НДС,
		|	НДСКРаспределению.СчетЗатрат КАК СчетЗатрат,
		|	НДСКРаспределению.Подразделение КАК Подразделение,
		|	НДСКРаспределению.Субконто1 КАК Субконто1,
		|	НДСКРаспределению.Субконто2 КАК Субконто2,
		|	НДСКРаспределению.Субконто3 КАК Субконто3,
		|	НДСКРаспределению.ДатаСФ КАК ДатаСФ,
		|	НДСКРаспределению.ДатаПартии КАК ДатаПартии,
		|	НДСКРаспределению.Модернизация КАК Модернизация,
		|	НДСКРаспределению.Поставщик КАК Поставщик,
		|	НДСКРаспределению.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
		|ПОМЕСТИТЬ ВТ_НМА
		|ИЗ
		|	НДСКРаспределению КАК НДСКРаспределению
		|ГДЕ
		|	НДСКРаспределению.Субконто1 ССЫЛКА Справочник.НематериальныеАктивы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НДСКРаспределению
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ СостоянияОС
		|ИЗ
		|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
		|ГДЕ
		|	СостоянияОСОрганизаций.ОсновноеСредство В
		|			(ВЫБРАТЬ
		|				ВТ_ОС.Субконто1
		|			ИЗ
		|				ВТ_ОС)
		|	И СостоянияОСОрганизаций.Организация = &Организация
		|	И СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|	И СостоянияОСОрганизаций.ДатаСостояния МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияНМАОрганизаций.НематериальныйАктив КАК НематериальныйАктив
		|ПОМЕСТИТЬ СостоянияНМА
		|ИЗ
		|	РегистрСведений.СостоянияНМАОрганизаций КАК СостоянияНМАОрганизаций
		|ГДЕ
		|	СостоянияНМАОрганизаций.НематериальныйАктив В
		|			(ВЫБРАТЬ
		|				ВТ_НМА.Субконто1
		|			ИЗ
		|				ВТ_НМА)
		|	И СостоянияНМАОрганизаций.Организация = &Организация
		|	И СостоянияНМАОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийНМА.ПринятКУчету)
		|	И СостоянияНМАОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОС.СчетФактура КАК СчетФактура,
		|	ВТ_ОС.ВидЦенности КАК ВидЦенности,
		|	ВТ_ОС.СчетУчетаНДС КАК СчетУчетаНДС,
		|	ВТ_ОС.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_ОС.Партия КАК Партия,
		|	ВТ_ОС.Количество КАК Количество,
		|	ВТ_ОС.СуммаБезНДС КАК СуммаБезНДС,
		|	ВТ_ОС.НДС КАК НДС,
		|	ВТ_ОС.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_ОС.Подразделение КАК Подразделение,
		|	ВТ_ОС.Субконто1 КАК Субконто1,
		|	ВТ_ОС.Субконто2 КАК Субконто2,
		|	ВТ_ОС.Субконто3 КАК Субконто3,
		|	ВТ_ОС.ДатаСФ КАК ДатаСФ,
		|	ВТ_ОС.ДатаПартии КАК ДатаПартии,
		|	ВТ_ОС.Модернизация КАК Модернизация,
		|	ВТ_ОС.Поставщик КАК Поставщик,
		|	ВТ_ОС.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
		|ИЗ
		|	СостоянияОС КАК СостоянияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОС КАК ВТ_ОС
		|		ПО СостоянияОС.ОсновноеСредство = ВТ_ОС.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НМА.СчетФактура,
		|	ВТ_НМА.ВидЦенности,
		|	ВТ_НМА.СчетУчетаНДС,
		|	ВТ_НМА.СтавкаНДС,
		|	ВТ_НМА.Партия,
		|	ВТ_НМА.Количество,
		|	ВТ_НМА.СуммаБезНДС,
		|	ВТ_НМА.НДС,
		|	ВТ_НМА.СчетЗатрат,
		|	ВТ_НМА.Подразделение,
		|	ВТ_НМА.Субконто1,
		|	ВТ_НМА.Субконто2,
		|	ВТ_НМА.Субконто3,
		|	ВТ_НМА.ДатаСФ,
		|	ВТ_НМА.ДатаПартии,
		|	ВТ_НМА.Модернизация,
		|	ВТ_НМА.Поставщик,
		|	ВТ_НМА.ИсправленныйСчетФактура
		|ИЗ
		|	СостоянияНМА КАК СостоянияНМА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НМА КАК ВТ_НМА
		|		ПО СостоянияНМА.НематериальныйАктив = ВТ_НМА.Субконто1";
		
		Результат = Запрос.Выполнить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
