
&Вместо("УстановитьПравилаЗаполненияСчетовУчета")
Функция Расш1_УстановитьПравилаЗаполненияСчетовУчета(Правила)
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		
		ПродолжитьВызов(Правила);
		
	#Иначе	
		// Шапка
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "",     "СчетСписанияНДС",     "ЗатратыНДС");
		СчетаУчетаВДокументах.ДобавитьВПравилоУсловиеРазрешено(Правила, "СписатьНДС");
		СчетаУчетаВДокументах.ДобавитьПодчиненноеПравилоЗаполнения(Правила, "СубконтоСписанияНДС1", "СубконтоЗатрат1");
		СчетаУчетаВДокументах.ДобавитьПодчиненноеПравилоЗаполнения(Правила, "СубконтоСписанияНДС2", "СубконтоЗатрат2");
		СчетаУчетаВДокументах.ДобавитьПодчиненноеПравилоЗаполнения(Правила, "СубконтоСписанияНДС3", "СубконтоЗатрат3");
		
		// Табличная часть Товары
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "Товары", "СчетУчета",   "Запасы"   ); //ЮЦАУ //"ЗапасыКромеЗабалансовых"
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила,      "Склад",        "СкладОтправитель");
		СчетаУчетаВДокументах.ДобавитьВПравилоУсловиеЗапрещено(Правила, "ТоварыВЦенахПродажи");
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "Товары", "НовыйСчетУчета", "Запасы");   //ЮЦАУ //ЗапасыКромеЗабалансовых
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила,      "Склад",        "СкладПолучатель");
		СчетаУчетаВДокументах.ДобавитьВПравилоУсловиеЗапрещено(Правила, "ТоварыВЦенахПродажи");
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "Товары", "СпособУчетаНДС", "СпособУчетаНДСПредъявленного");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила,      "Склад",        "СкладПолучатель");
		
		// Табличная часть ВозвратнаяТара
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "ВозвратнаяТара", "СчетУчета",      "ВозвратнаяТараНаСкладе");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила, "Склад", "СкладОтправитель");
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "ВозвратнаяТара", "НовыйСчетУчета", "ВозвратнаяТараНаСкладе");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила, "Склад", "СкладПолучатель");
		
		// Табличная часть ТоварыНаКомиссии
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "ТоварыНаКомиссии", "СчетУчета",      "ТоварыПринятыеНаКомиссию");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила, "Склад", "СкладОтправитель");
		
		СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "ТоварыНаКомиссии", "НовыйСчетУчета", "ТоварыПринятыеНаКомиссию");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
		СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхЗаполнения(Правила, "Склад", "СкладПолучатель");
		
		// Данные заполнения
		СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "Дата");
		СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "Организация");
		СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "СкладОтправитель");
		СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "СкладПолучатель");
		СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеДополнительныхДанных(Правила, "СписатьНДС", "НДСвСтоимостиТоваров");
		
		Возврат Правила;
		
	#КонецЕсли
	
КонецФункции


